#Область ПрограммныйИнтерфейс

// Задает типы предметов взаимодействий, например: заказы, вакансии и т.п.
// Используется, если в конфигурации определен хотя бы один предмет взаимодействий. 
//
// Параметры:
//  ТипыПредметов  - Массив - предметы взаимодействий (Строка),
//                            например, "ДокументСсылка.ЗаказПокупателя" и т.п.
//
Процедура ПриОпределенииВозможныхПредметов(ТипыПредметов) Экспорт

	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

// Задает описания возможных типов контактов взаимодействий, например: партнеры, контактные лица и т.п.
// см. ВзаимодействияКлиентСерверПереопределяемый.ПриОпределенииВозможныхКонтактов
//
Процедура ПриОпределенииВозможныхКонтактов(ТипыКонтактов) Экспорт
			
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти