
// В процедуре необходимо определить необходимость запроса МРЦ для номенклатуры в системе МОТП.
// 
// Параметры:
//  Номенклатура - ОпределяемыйТип.Номенклатура - Номенклатура.
//  ТребуетсяЗапрос - Булево - Истина, если для номенклатуры требуется запрашивать МРЦ в системе МОТП.
Процедура ПриОпределенииНеобходимостиЗапросаМРЦ(Номенклатура, ТребуетсяЗапрос) Экспорт
	
	//++ НЕ ГОСИС
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		ТребуетсяЗапрос = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ВидНоменклатуры.ИспользоватьМРЦМОТПСерии");
	КонецЕсли;
	Возврат;
	//-- НЕ ГОСИС
	ТребуетсяЗапрос = Истина;
	
КонецПроцедуры