/////////////////////////////////////////////////////////////////////////////
// Совместная работа подсистем ВетИС и ИСМП.
//   * Процедуры работы с внешним модулем ВетИС.
//   * Если подсистема ВетИС отсутствует, выставить СтандартнаяОбработка = Ложь во всех процедурах.
//

#Область ПрограммныйИнтерфейс

// Дополняет параметры сканирования для документа Маркировка товаров при необходимости передавать специфику ВетИС:
//   * Взводит флаг "ЗаполнятьДанныеВЕТИС".
//   * Определяет тип идентификатора происхождения ВетИС.
// 
// Параметры:
//   Операция              - ПеречислениеСсылка.ВидыОперацийИСМП - операция маркировки.
//   ПараметрыСканирования - См. ШтрихкодированиеИСКлиент.ПараметрыСканирования.
//   СтандартнаяОбработка  - Булево - признак библиотечной обработки
//
Процедура ДополнитьПараметрыСканированияМаркировкаТоваров(Операция, ПараметрыСканирования, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Возвращает уточненный заголовок поля "Идентификатор происхождения ВетИС" по типу идентификатора
// 
// Параметры:
//   ТипПоля              - Тип    - тип идентификатора происхождения ВетИС.
//   Заголовок            - Строка - признак библиотечной обработки
//   СтандартнаяОбработка - Булево - признак библиотечной обработки
//
Процедура ПриПолученииЗаголовкаПоляИдентификаторПроисхожденияВЕТИСПоТипу(ТипПоля, Заголовок, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Возвращает тип идентификатора происхождения ВетИС для документа "Маркировка товаров ИСМП"
// 
// Параметры:
//   ТипПоля            - Тип                        - тип идентификатора происхождения ВетИС
//   Форма              - ФормаКлиентскогоПриложения - форма документа "Маркировка товаров ИСМП"
//   ЭтоОперацияИмпорта - Булево                     - признак операции импорта
//   СтандартнаяОбработка - Булево - признак библиотечной обработки
//
Процедура ПриПолученииТипаПоляИдентификаторПроисхожденияВЕТИСВДокументеМаркировка(ТипПоля, Форма, ЭтоОперацияИмпорта, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти