///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет виды доступа, используемые в ограничениях прав доступа.
// Примечание: виды доступа Пользователи и ВнешниеПользователи предопределены,
// но их можно удалить из списка ВидыДоступа, если они не требуются для ограничения прав доступа.
//
// Параметры:
//  ВидыДоступа - ТаблицаЗначений:
//   * Имя                    - Строка - имя, используемое в описании поставляемых
//                                       профилей групп доступа и текстах ОДД.
//   * Представление          - Строка - представляет вид доступа в профилях и группах доступа.
//   * ТипЗначений            - Тип    - тип ссылки значений доступа,
//                                       например Тип("СправочникСсылка.Номенклатура").
//   * ТипГруппЗначений       - Тип    - тип ссылки групп значений доступа,
//                                       например Тип("СправочникСсылка.ГруппыДоступаНоменклатуры").
//   * НесколькоГруппЗначений - Булево - Истина указывает, что для значения доступа (Номенклатуры) можно
//                                       выбрать несколько групп значений (Групп доступа номенклатуры).
//
// Пример:
//  1. Для настройки прав доступа в разрезе организаций:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "Организации";
//  ВидДоступа.Представление = НСтр("ru = 'Организации'");
//  ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
//
//  2. Для настройки прав доступа в разрезе групп партнеров:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "ГруппыПартнеров";
//  ВидДоступа.Представление    = НСтр("ru = 'Группы партнеров'");
//  ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Партнеры");
//  ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаПартнеров");
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	//++ НЕ ГОСИС
	УправлениеДоступомУТ.ПриЗаполненииВидовДоступа(ВидыДоступа);
	УправлениеДоступомЛокализация.ЗаполнитьВидыДоступа(ВидыДоступа);
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Позволяет указать списки, у которых объекты метаданных содержат описание логики ограничения
// доступа в модулях менеджеров или переопределяемом модуле.
//
// В модулях менеджеров указанных списков должна быть размещена процедура обработчика,
// в которую передаются следующие параметры.
// 
//  Ограничение - Структура - со свойствами:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                            Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                            Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                            если Истина, тогда не записывать ключи доступа,
//                                            а использовать ключи доступа владельца (требуется,
//                                            чтобы ограничение было строго по объекту-владельцу).
///   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - см.
//                                            описание предыдущего параметра.
//
// Далее пример процедуры для модуля менеджера.
//
//// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
//	
//	Ограничение.Текст =
//	"РазрешитьЧтениеИзменение
//	|ГДЕ
//	|	ЗначениеРазрешено(Организация)
//	|	И ЗначениеРазрешено(Контрагент)";
//	
//КонецПроцедуры
//
// Параметры:
//  Списки - Соответствие - списки с ограничением доступа:
//             * Ключ     - ОбъектМетаданных - список с ограничением доступа.
//             * Значение - Булево - Истина - текст ограничения в модуле менеджера,
//                                   Ложь   - текст ограничения в этом переопределяемом.
//                модуле в процедуре ПриЗаполненииОграниченияДоступа.
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	//++ НЕ ГОСИС
	
	УправлениеДоступомУТ.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	
	УправлениеДоступомЛокализация.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	
	Списки.Вставить(Метаданные.Справочники.АвансовыйОтчетПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.АктВыполненныхРаботПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.БанковскиеСчетаКонтрагентов, Истина);
	Списки.Вставить(Метаданные.Справочники.БанковскиеСчетаОрганизаций, Истина);
	Списки.Вставить(Метаданные.Справочники.ВариантыКомплектацииНоменклатуры, Истина);
	Списки.Вставить(Метаданные.Справочники.ВзаимозачетЗадолженностиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ВидыЗапасов, Истина);
	Списки.Вставить(Метаданные.Справочники.ВидыНоменклатуры, Истина);
	Списки.Вставить(Метаданные.Справочники.ВидыНоменклатурыПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ВидыЦен, Истина);
	Списки.Вставить(Метаданные.Справочники.ВидыЦенПоставщиков, Истина);
	Списки.Вставить(Метаданные.Справочники.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ВозвратТоваровОтКлиентаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ВозвратТоваровПоставщикуПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ГруппыДоступаПартнеров, Истина);
	Списки.Вставить(Метаданные.Справочники.ДоговорыКонтрагентов, Истина);
	Списки.Вставить(Метаданные.Справочники.ДоговорыКонтрагентовПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ДоговорыКредитовИДепозитов, Истина);
	Списки.Вставить(Метаданные.Справочники.ДоговорыКредитовИДепозитовПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ДоговорыМеждуОрганизациями, Истина);
	Списки.Вставить(Метаданные.Справочники.ДоговорыМеждуОрганизациямиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаданиеНаПеревозкуПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗадачиПроектов, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаказКлиентаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаказПоставщикуПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.Кассы, Истина);
	Списки.Вставить(Метаданные.Справочники.КассыККМ, Истина);
	Списки.Вставить(Метаданные.Справочники.КонтактныеЛицаПартнеров, Истина);
	Списки.Вставить(Метаданные.Справочники.Контрагенты, Истина);
	Списки.Вставить(Метаданные.Справочники.КорректировкаПриобретенияПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.КорректировкаРеализацииПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.Номенклатура, Истина);
	Списки.Вставить(Метаданные.Справочники.НоменклатураКонтрагентовПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.НоменклатураПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ОбластиХранения, Истина);
	Списки.Вставить(Метаданные.Справочники.ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.Организации, Истина);
	Списки.Вставить(Метаданные.Справочники.ОрганизацииПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтветственныеЛицаОрганизаций, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтчетКомиссионераОСписанииПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтчетКомиссионераПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтчетКомитентуОСписанииПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтчетКомитентуПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.Партнеры, Истина);
	Списки.Вставить(Метаданные.Справочники.ПартнерыПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПланЗакупокПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПланПродажПоКатегориямПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПланПродажПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПодпискиНаРассылкиИОповещенияКлиентам, Истина);
	Списки.Вставить(Метаданные.Справочники.ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПоступлениеТоваровНаСкладПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПретензииКлиентов, Истина);
	Списки.Вставить(Метаданные.Справочники.ПретензииКлиентовПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПриобретениеТоваровУслугПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПрочиеДоходыРасходыПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РабочиеУчастки, Истина);
	Списки.Вставить(Метаданные.Справочники.РассылкаКлиентамПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РеализацияТоваровУслугПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РеализацияУслугПрочихАктивовПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СверкаВзаиморасчетовПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СделкиСКлиентами, Истина);
	Списки.Вставить(Метаданные.Справочники.СделкиСКлиентамиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СкладскиеПомещения, Истина);
	Списки.Вставить(Метаданные.Справочники.СкладскиеЯчейки, Истина);
	Списки.Вставить(Метаданные.Справочники.Склады, Истина);
	Списки.Вставить(Метаданные.Справочники.СоглашенияСКлиентами, Истина);
	Списки.Вставить(Метаданные.Справочники.СоглашенияСКлиентамиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СоглашенияСПоставщиками, Истина);
	Списки.Вставить(Метаданные.Справочники.СоглашенияСПоставщикамиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СписаниеЗадолженностиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СправкаОПодтверждающихДокументахПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СтруктураПредприятия, Истина);
	Списки.Вставить(Метаданные.Справочники.СчетНаОплатуКлиентуПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.УпаковкиЕдиницыИзмерения, Истина);
	Списки.Вставить(Метаданные.Справочники.УсловияОбслуживанияПартнеровТорговымиПредставителями, Истина);
	Списки.Вставить(Метаданные.Справочники.УстановкаЦенНоменклатурыПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ХарактеристикиНоменклатуры, Истина);
	Списки.Вставить(Метаданные.Справочники.ЭквайринговыеТерминалы, Истина);
	Списки.Вставить(Метаданные.Документы.АвансовыйОтчет, Истина);
	Списки.Вставить(Метаданные.Документы.АктВыполненныхРабот, Истина);
	Списки.Вставить(Метаданные.Документы.АктОРасхожденияхПослеОтгрузки, Истина);
	Списки.Вставить(Метаданные.Документы.АктОРасхожденияхПослеПеремещения, Истина);
	Списки.Вставить(Метаданные.Документы.АктОРасхожденияхПослеПриемки, Истина);
	Списки.Вставить(Метаданные.Документы.ВводОстатков, Истина);
	Списки.Вставить(Метаданные.Документы.ВзаимозачетЗадолженности, Истина);
	Списки.Вставить(Метаданные.Документы.ВнутреннееПотреблениеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратТоваровМеждуОрганизациями, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратТоваровОтКлиента, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратТоваровПоставщику, Истина);
	Списки.Вставить(Метаданные.Документы.ВыкупВозвратнойТарыКлиентом, Истина);
	Списки.Вставить(Метаданные.Документы.ВыкупВозвратнойТарыУПоставщика, Истина);
	Списки.Вставить(Метаданные.Документы.ДвижениеПрочихАктивовПассивов, Истина);
	Списки.Вставить(Метаданные.Документы.ДоверенностьВыданная, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаданиеНаПеревозку, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаданиеТорговомуПредставителю, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказКлиента, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказНаВнутреннееПотребление, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказНаПеремещение, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказНаСборку, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказПоставщику, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаявкаНаВозвратТоваровОтКлиента, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.ИзменениеАссортимента, Истина);
	Списки.Вставить(Метаданные.Документы.ИнвентаризационнаяОпись, Истина);
	Списки.Вставить(Метаданные.Документы.ИнвентаризацияНаличныхДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.УдалитьКассовыйЧекКоррекции, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаЗадолженностиПоФинансовымИнструментам, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаИзлишковНедостачПоТоварнымМестам, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаНазначенияТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаОбособленногоУчетаЗапасов, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаПоОрдеруНаТовары, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаПриобретения, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаРеализации, Истина);
	Списки.Вставить(Метаданные.Документы.ЛимитыРасходаДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.НачисленияКредитовИДепозитов, Истина);
	Списки.Вставить(Метаданные.Документы.ОжидаемоеПоступлениеДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.ОперацияПоПлатежнойКарте, Истина);
	Списки.Вставить(Метаданные.Документы.ОприходованиеИзлишковТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ОрдерНаОтражениеИзлишковТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ОрдерНаОтражениеНедостачТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ОрдерНаОтражениеПересортицыТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ОрдерНаОтражениеПорчиТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ОрдерНаПеремещениеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ОтборРазмещениеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ОтражениеРасхожденийПриИнкассацииДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетБанкаПоОперациямЭквайринга, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетКомиссионера, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетКомиссионераОСписании, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетКомитенту, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетКомитентуОСписании, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетОРозничныхПродажах, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетПоКомиссииМеждуОрганизациями, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетПоКомиссииМеждуОрганизациямиОСписании, Истина);
	Списки.Вставить(Метаданные.Документы.ПервичныйДокумент, Истина);
	Списки.Вставить(Метаданные.Документы.ПередачаТоваровМеждуОрганизациями, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремещениеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ПересортицаТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ПересчетТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ПланЗакупок, Истина);
	Списки.Вставить(Метаданные.Документы.ПланОстатков, Истина);
	Списки.Вставить(Метаданные.Документы.ПланПродаж, Истина);
	Списки.Вставить(Метаданные.Документы.ПланПродажПоКатегориям, Истина);
	Списки.Вставить(Метаданные.Документы.ПоручениеЭкспедитору, Истина);
	Списки.Вставить(Метаданные.Документы.ПорчаТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ПоступлениеБезналичныхДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.ПоступлениеТоваровНаСклад, Истина);
	Списки.Вставить(Метаданные.Документы.ПриобретениеТоваровУслуг, Истина);
	Списки.Вставить(Метаданные.Документы.ПриобретениеУслугПрочихАктивов, Истина);
	Списки.Вставить(Метаданные.Документы.ПриходныйКассовыйОрдер, Истина);
	Списки.Вставить(Метаданные.Документы.ПриходныйОрдерНаТовары, Истина);
	Списки.Вставить(Метаданные.Документы.ПрочееОприходованиеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ПрочиеДоходыРасходы, Истина);
	Списки.Вставить(Метаданные.Документы.РаспоряжениеНаПеремещениеДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.РаспределениеДоходовПоНаправлениямДеятельности, Истина);
	Списки.Вставить(Метаданные.Документы.РаспределениеРасходовБудущихПериодов, Истина);
	Списки.Вставить(Метаданные.Документы.РасходныйКассовыйОрдер, Истина);
	Списки.Вставить(Метаданные.Документы.РасходныйОрдерНаТовары, Истина);
	Списки.Вставить(Метаданные.Документы.РасчетКурсовыхРазниц, Истина);
	Списки.Вставить(Метаданные.Документы.РасчетСебестоимостиТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.РеализацияТоваровУслуг, Истина);
	Списки.Вставить(Метаданные.Документы.РеализацияУслугПрочихАктивов, Истина);
	Списки.Вставить(Метаданные.Документы.РегистраторГрафикаДвиженияТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.РегистрацияЦенНоменклатурыПоставщика, Истина);
	Списки.Вставить(Метаданные.Документы.СборкаТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.СверкаВзаиморасчетов, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеБезналичныхДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеЗадолженности, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеНедостачТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.СправкаОПодтверждающихДокументах, Истина);
	Списки.Вставить(Метаданные.Документы.СчетНаОплатуКлиенту, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОЗачисленииВалюты, Истина);
	Списки.Вставить(Метаданные.Документы.УстановкаБлокировокЯчеек, Истина);
	Списки.Вставить(Метаданные.Документы.УстановкаЦенНоменклатуры, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ОтчетыКомиссионеров, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ОтчетыКомитентам, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.СкладскиеОрдера, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.СкладскиеОрдераНаИзлишкиНедостачиПорчи, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ABCXYZКлассификацияКлиентов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ВариантыОбеспеченияТоварами, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ГрафикПлатежей, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДатыПередачиТоваровНаКомиссию, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДанныеПервичныхДокументов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДокументыФизическихЛиц, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДоступностьТоваровДляВнешнихПользователей, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДоступныеОстаткиПланируемыхПоступлений, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЗаданияКРаспределениюРасчетовСКлиентами, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЗаданияКРаспределениюРасчетовСПоставщиками, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ИсточникиПервичногоИнтереса, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.КорзинаПокупателя, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкаКонтроляОбеспечения, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкаПередачиТоваровМеждуОрганизациями, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиАдресныхСкладов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОстаткиНаБанковскихСчетахПоДаннымВыписок, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОчередьФормированияКорректировокИзлишковИНедостачПоТоварнымМестам, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОшибкиРасчетаПартийИСебестоимости, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПартнерыСегмента, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПравилаРазмещенияТоваровВЯчейках, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПрогнозыРасходаУпаковок, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РеестрДокументов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ABCXYZКлассификацияНоменклатуры, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СвязиМеждуПартнерами, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СостоянияИРеквизитыДоставки, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СтатистикаСделокСКлиентами, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СтоимостьТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СхемыОбеспечения, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ТоварныеОграничения, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.УчетнаяПолитикаОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЦеныНоменклатуры, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЦеныНоменклатурыПоставщиков, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ГрафикОтгрузкиТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ГрафикПоступленияТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвижениеТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияДенежныеСредстваДоходыРасходы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияДенежныеСредстваКонтрагент, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияДоходыРасходыПрочиеАктивыПассивы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияКонтрагентДоходыРасходы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияКонтрагентКонтрагент, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияНоменклатураНоменклатура, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияСерийТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваБезналичные, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваВКассахККМ, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваВПути, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваКВыплате, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваНаличные, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваУПодотчетныхЛиц, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыКлиентов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыНаВнутреннееПотребление, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыНаПеремещение, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыНаСборку, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыПоставщикам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.Закупки, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаявкиНаВозвратТоваровОтКлиентов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЛимитыРасходаДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.МатериалыИРаботыВПроизводстве, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ОбеспечениеЗаказов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииЗатратНаВыпуск, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииПроизводственныхЗатрат, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииПрочихРасходов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииРасходовНаСебестоимостьТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровПереданныеНаКомиссию, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПереданнаяВозвратнаяТара, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПринятаяВозвратнаяТара, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПрочиеДоходы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПрочиеРасходы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыПоФинансовымИнструментам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыПоЭквайрингу, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСКлиентами, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоДокументам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПланОплат, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПланОтгрузок, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПоставщиками, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоДокументам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПланОплат, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПланПоставок, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РезервыТоваровОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.СвободныеОстатки, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.СебестоимостьТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварныеМестаКОтражениюИзлишковНедостач, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыВЯчейках, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыКОтгрузке, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыКОформлениюИзлишковНедостач, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыКОформлениюОтчетовКомитенту, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыКПоступлению, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыНаСкладах, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыОрганизацийКПередаче, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыПереданныеНаКомиссию, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.УслугиКОформлениюОтчетовПринципалу, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ФинансовыеРезультаты, Истина);
	Списки.Вставить(Метаданные.БизнесПроцессы.СогласованиеЦенНоменклатуры, Истина);
	Списки.Вставить(Метаданные.БизнесПроцессы.ТиповаяПродажа, Истина);
	Списки.Вставить(Метаданные.Справочники.ФизическиеЛицаПрисоединенныеФайлы, Истина);
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  ОписанияПрофилей - Массив из см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа
//  ПараметрыОбновления - Структура:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа, который был удален из профиля, будут также удалены из групп доступа.
//
// Пример:
//  ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
//  ОписаниеПрофиля.Имя           = "Менеджер";
//  ОписаниеПрофиля.Идентификатор = "75fa0ecb-98aa-11df-b54f-e0cb4ed5f655";
//  ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по продажам'", ОбщегоНазначения.КодОсновногоЯзыка());
//  ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
//  ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
//  ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
//  ОписаниеПрофиля.Роли.Добавить("Подсистема_Продажи");
//  ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПокупателей");
//  ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаКнигаПокупок");
//  ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	//++ НЕ ГОСИС
	УправлениеДоступомУТ.ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);
	УправлениеДоступомЛокализация.ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);
	//-- НЕ ГОСИС
КонецПроцедуры

// Заполняет зависимости прав доступа "подчиненного" объекта (например, задачи ЗадачаИсполнителя),
// от "ведущего" объекта (например,  бизнес-процесса Задание), которые отличаются от стандартных.
//
// Зависимости прав используются в стандартном шаблоне ограничения доступа для вида доступа "Объект".
// 1. Стандартно при чтении "подчиненного" объекта
//    проверяется наличие права чтения "ведущего" объекта и
//    проверяется отсутствие ограничения чтения "ведущего" объекта.
// 2. Стандартно при добавлении, изменении, удалении "подчиненного" объекта
//    проверяется наличие права изменения "ведущего" объекта и
//    проверяется отсутствие ограничения изменения "ведущего" объекта.
//
// Допускается только одно переназначение по сравнению со стандартным -
// в пункте 2 вместо проверки права изменения "ведущего" объекта установить
// проверку права чтения "ведущего" объекта.
//
// Параметры:
//  ЗависимостиПрав - ТаблицаЗначений:
//   * ВедущаяТаблица     - Строка - например Метаданные.БизнесПроцессы.Задание.ПолноеИмя().
//   * ПодчиненнаяТаблица - Строка - например Метаданные.Задачи.ЗадачаИсполнителя.ПолноеИмя().
//
Процедура ПриЗаполненииЗависимостейПравДоступа(ЗависимостиПрав) Экспорт
	
	//++ НЕ ГОСИС
	УправлениеДоступомУТ.ПриЗаполненииЗависимостейПравДоступа(ЗависимостиПрав);
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Заполняет описания возможных прав, назначаемых для объектов указанных типов.
//
// Параметры:
//  ВозможныеПрава - ТаблицаЗначений:
//   * ВладелецПрав - Строка - полное имя таблицы значения доступа.
//
//   * Имя          - Строка - идентификатор права, например ИзменениеПапок. Право с именем УправлениеПравами
//                  должно быть обязательно определено для общей формы настройки прав "Права доступа".
//                  УправлениеПравами - это право на изменение прав по владельцу прав, которое проверяется
//                  при открытии ОбщаяФорма.НастройкиПравОбъектов.
//
//   * Заголовок    - Строка - заголовок права, например в форме НастройкиПравОбъектов:
//                  "Изменение.
//                  |папок".
//
//   * Подсказка    - Строка - подсказка к заголовку права,
//                  например "Добавление, изменение и пометка удаления папок".
//
//   * НачальноеЗначение - Булево - начальное значение флажка права при добавлении новой строки
//                  в форме "Права доступа".
//
//   * ТребуемыеПрава - Массив Из Строка - имена прав, требуемых для этого права -
//                  например, право "ДобавлениеФайлов" требует права "ИзменениеФайлов".
//
//   * ЧтениеВТаблицах - Массив Из Строка - полные имена таблиц, для которых это право обозначает право Чтение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц",
//                  т.к. право Чтение может зависеть только от права Чтение, то имеет смысл только символ "*"
//                  (требуется для работы шаблонов ограничения доступа).
//
//   * ИзменениеВТаблицах - Массив Из Строка - полные имена таблиц, для которых это право обозначает право Изменение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц"
//                  (требуется для работы шаблонов ограничения доступа).
//
Процедура ПриЗаполненииВозможныхПравДляНастройкиПравОбъектов(ВозможныеПрава) Экспорт
	
	//++ НЕ ГОСИС
	УправлениеДоступомУТ.ПриЗаполненииВозможныхПравДляНастройкиПравОбъектов(ВозможныеПрава);
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Определяет вид используемого интерфейса пользователя для настройки доступа.
//
// Параметры:
//  УпрощенныйИнтерфейс - Булево - начальное значение Ложь.
//
Процедура ПриОпределенииИнтерфейсаНастройкиДоступа(УпрощенныйИнтерфейс) Экспорт
	
	//++ НЕ ГОСИС
	УправлениеДоступомУТ.ПриОпределенииИнтерфейсаНастройкиДоступа(УпрощенныйИнтерфейс);
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Заполняет использование видов доступа в зависимости от функциональных опций конфигурации,
// например, ИспользоватьГруппыДоступаНоменклатуры.
//
// Параметры:
//  ВидДоступа    - Строка - имя вида доступа, заданное в процедуре ПриЗаполненииВидовДоступа.
//  Использование - Булево - начальное значение Истина.
// 
Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
	//++ НЕ ГОСИС
	УправлениеДоступомУТ.ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование);
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Список - ОбъектМетаданных - список, для которого нужно вернуть текст ограничения.
//                              В процедуре ПриЗаполненииСписковСОграничениемДоступа нужно
//                              указать для списка значение Ложь, иначе вызова не будет.
//
//  Ограничение - Структура - со свойствами, как для процедур в модулях менеджеров. См. свойства
//                            в комментарии к процедуре ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	//++ НЕ ГОСИС
	УправлениеДоступомУТ.ПриЗаполненииОграниченияДоступа(Список, Ограничение);
	УправлениеДоступомЛокализация.ПриЗаполненииОграниченияДоступа(Список, Ограничение);
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа, могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  Описание     - Строка - многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта],
//                 например, "Документ.ПриходнаяНакладная.Чтение.Организации",
//                           "Документ.ПриходнаяНакладная.Чтение.Контрагенты",
//                           "Документ.ПриходнаяНакладная.Изменение.Организации",
//                           "Документ.ПриходнаяНакладная.Изменение.Контрагенты",
//                           "Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо",
//                           "Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо".
//                 Вид доступа Объект предопределен как литерал. Этот вид доступа используется в
//                 шаблонах ограничений доступа как "ссылка" на другой объект, по которому
//                 ограничивается текущий объект таблицы.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц,
//                 которые используются для этого вида доступа. Т.е. перечислить типы,
//                 которые соответствуют полю, использованному в шаблоне ограничения доступа
//                 в паре с видом доступа "Объект". При перечислении типов по виду доступа "Объект"
//                 нужно перечислить только те типы поля, которые есть
//                 у поля РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт

	Описание = Описание + "
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы.Чтение.Склады
	|Справочник.АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы.Изменение.Склады
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Чтение.ТипыОснованийАктаОРасхождениях
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Изменение.ТипыОснованийАктаОРасхождениях
	|Справочник.БанковскиеСчетаКонтрагентов.Чтение.ВнешниеПользователи
	|Справочник.БанковскиеСчетаКонтрагентов.Изменение.ВнешниеПользователи
	|Справочник.БанковскиеСчетаОрганизаций.Чтение.Организации
	|Справочник.ВариантыКомплектацииНоменклатуры.Изменение.ГруппыНоменклатуры
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.Задание
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.ОтчетОРозничныхПродажах
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ФизическиеЛица
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.Задание
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.ОтчетОРозничныхПродажах
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ФизическиеЛица
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВидыЗапасов.Чтение.Организации
	|Справочник.ВидыНоменклатуры.Изменение.ГруппыНоменклатуры
	|Справочник.ВидыНоменклатурыПрисоединенныеФайлы.Изменение.ГруппыНоменклатуры
	|Справочник.ВидыЦен.Чтение.ВидыЦен
	|Справочник.ВидыЦен.Изменение.ВидыЦен
	|Справочник.ВидыЦенПоставщиков.Чтение.ГруппыПартнеров
	|Справочник.ВидыЦенПоставщиков.Изменение.ГруппыПартнеров
	|Справочник.ВнешниеПользователи.Чтение.ВнешниеПользователи
	|Справочник.ВнешниеПользователи.Изменение.ВнешниеПользователи
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ВстречаПрисоединенныеФайлы.Чтение.Объект.Документ.Встреча
	|Справочник.ВстречаПрисоединенныеФайлы.Изменение.Объект.Документ.Встреча
	|Справочник.ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ГруппыВнешнихПользователей.Чтение.ВнешниеПользователи
	|Справочник.ГруппыДоступаПартнеров.Чтение.ГруппыПартнеров
	|Справочник.ГруппыПользователей.Чтение.Пользователи
	|Справочник.ДоговорыКонтрагентов.Чтение.ВнешниеПользователи
	|Справочник.ДоговорыКонтрагентов.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентов.Чтение.Организации
	|Справочник.ДоговорыКонтрагентов.Чтение.ХозяйственныеОперации
	|Справочник.ДоговорыКонтрагентов.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентов.Изменение.Организации
	|Справочник.ДоговорыКонтрагентов.Изменение.ХозяйственныеОперации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Чтение.ХозяйственныеОперации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Изменение.ХозяйственныеОперации
	|Справочник.ДоговорыКредитовИДепозитов.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКредитовИДепозитов.Чтение.Организации
	|Справочник.ДоговорыКредитовИДепозитов.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыКредитовИДепозитов.Изменение.Организации
	|Справочник.ДоговорыКредитовИДепозитовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКредитовИДепозитовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДоговорыКредитовИДепозитовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыКредитовИДепозитовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДоговорыМеждуОрганизациями.Чтение.Организации
	|Справочник.ДоговорыМеждуОрганизациямиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДополнительныеОтчетыИОбработки.Чтение.ДополнительныеОтчетыИОбработки
	|Справочник.ЗаданиеНаПеревозкуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаданиеНаПеревозкуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗадачиПроектов.Чтение.ГруппыПартнеров
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.МаркетинговыеМероприятия
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.ПретензииКлиентов
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.Проекты
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.СделкиСКлиентами
	|Справочник.ЗадачиПроектов.Изменение.ГруппыПартнеров
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.МаркетинговыеМероприятия
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.ПретензииКлиентов
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.Проекты
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.СделкиСКлиентами
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗапланированноеВзаимодействиеПрисоединенныеФайлы.Чтение.Объект.Документ.ЗапланированноеВзаимодействие
	|Справочник.ЗапланированноеВзаимодействиеПрисоединенныеФайлы.Изменение.Объект.Документ.ЗапланированноеВзаимодействие
	|Справочник.ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗапросКоммерческогоПредложенияОтКлиентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.Пользователи
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.ХозяйственныеОперации
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.Пользователи
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.ХозяйственныеОперации
	|Справочник.ЗначенияСвойствОбъектов.Чтение.ДополнительныеСведения
	|Справочник.ЗначенияСвойствОбъектовИерархия.Чтение.ДополнительныеСведения
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КассовыеКниги.Чтение.Организации
	|Справочник.КассовыеКниги.Изменение.Организации
	|Справочник.Кассы.Чтение.Кассы
	|Справочник.Кассы.Чтение.Организации
	|Справочник.КассыККМ.Чтение.КассыККМ
	|Справочник.КассыККМ.Чтение.Организации
	|Справочник.КлассификаторОрганизацийЕГАИС.Чтение.ГруппыПартнеров
	|Справочник.КлассификаторОрганизацийЕГАИС.Чтение.Организации
	|Справочник.КлассификаторОрганизацийЕГАИС.Изменение.ГруппыПартнеров
	|Справочник.КлассификаторОрганизацийЕГАИС.Изменение.Организации
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КонтактныеЛицаПартнеров.Чтение.ВнешниеПользователи
	|Справочник.КонтактныеЛицаПартнеров.Чтение.ГруппыПартнеров
	|Справочник.КонтактныеЛицаПартнеров.Изменение.ВнешниеПользователи
	|Справочник.КонтактныеЛицаПартнеров.Изменение.ГруппыПартнеров
	|Справочник.Контрагенты.Чтение.ВнешниеПользователи
	|Справочник.Контрагенты.Чтение.ГруппыПартнеров
	|Справочник.Контрагенты.Изменение.ВнешниеПользователи
	|Справочник.Контрагенты.Изменение.ГруппыПартнеров
	|Справочник.КорректировкаПриобретенияПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.КорректировкаПриобретенияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КорректировкаПриобретенияПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.КорректировкаПриобретенияПрисоединенныеФайлы.Чтение.Склады
	|Справочник.КорректировкаПриобретенияПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.КорректировкаПриобретенияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КорректировкаПриобретенияПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.КорректировкаПриобретенияПрисоединенныеФайлы.Изменение.Склады
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.Склады
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЛицензииПоставщиковАлкогольнойПродукции.Чтение.ГруппыПартнеров
	|Справочник.ЛицензииПоставщиковАлкогольнойПродукции.Изменение.ГруппыПартнеров
	|Справочник.МаршрутыПодписания.Чтение.Организации
	|Справочник.НаборыДополнительныхРеквизитовИСведений.Изменение.ГруппыНоменклатуры
	|Справочник.НастройкиОбменСБанками.Чтение.Организации
	|Справочник.НастройкиЯндексКассы.Чтение.Организации
	|Справочник.НастройкиЯндексКассы.Изменение.Организации
	|Справочник.Номенклатура.Изменение.ГруппыНоменклатуры
	|Справочник.НоменклатураКонтрагентов.Чтение.ГруппыПартнеров
	|Справочник.НоменклатураКонтрагентов.Изменение.ГруппыПартнеров
	|Справочник.НоменклатураКонтрагентовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.НоменклатураКонтрагентовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.НоменклатураПрисоединенныеФайлы.Изменение.ГруппыНоменклатуры
	|Справочник.ОбластиХранения.Чтение.Склады
	|Справочник.ОбластиХранения.Изменение.Склады
	|Справочник.ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы.Чтение.Кассы
	|Справочник.ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы.Изменение.Кассы
	|Справочник.ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы.Изменение.Организации
	|Справочник.Организации.Чтение.Организации
	|Справочник.ОрганизацииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтветственныеЛицаОрганизаций.Чтение.Организации
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПакетЭДПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПапкиФайлов.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ПапкиФайлов.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ПапкиЭлектронныхПисем.Чтение.Пользователи
	|Справочник.ПапкиЭлектронныхПисем.Чтение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.ПапкиЭлектронныхПисем.Изменение.Пользователи
	|Справочник.ПапкиЭлектронныхПисем.Изменение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.Партнеры.Чтение.ВнешниеПользователи
	|Справочник.Партнеры.Чтение.ГруппыПартнеров
	|Справочник.Партнеры.Изменение.ГруппыПартнеров
	|Справочник.ПартнерыПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПартнерыПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.Патенты.Чтение.Организации
	|Справочник.Патенты.Изменение.Организации
	|Справочник.ПатентыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПатентыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПланПродажПоКатегориямПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПланПродажПоКатегориямПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПланПродажПоКатегориямПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПланПродажПоКатегориямПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПланПродажПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПланПродажПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПланПродажПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПланПродажПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПланПродажПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПланПродажПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПодпискиНаРассылкиИОповещенияКлиентам.Чтение.ВнешниеПользователи
	|Справочник.ПодпискиНаРассылкиИОповещенияКлиентам.Чтение.ГруппыПартнеров
	|Справочник.ПодпискиНаРассылкиИОповещенияКлиентам.Изменение.ВнешниеПользователи
	|Справочник.ПодпискиНаРассылкиИОповещенияКлиентам.Изменение.ГруппыПартнеров
	|Справочник.Пользователи.Чтение.Пользователи
	|Справочник.Пользователи.Изменение.Пользователи
	|Справочник.ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.ХозяйственныеОперации
	|Справочник.ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.ХозяйственныеОперации
	|Справочник.ПоступлениеТоваровНаСкладПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПоступлениеТоваровНаСкладПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПоступлениеТоваровНаСкладПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПоступлениеТоваровНаСкладПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПоступлениеТоваровНаСкладПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПоступлениеТоваровНаСкладПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеТоваровНаСкладПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПоступлениеТоваровНаСкладПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПравилаОбработкиЭлектроннойПочты.Чтение.Пользователи
	|Справочник.ПравилаОбработкиЭлектроннойПочты.Чтение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.ПравилаОбработкиЭлектроннойПочты.Изменение.Пользователи
	|Справочник.ПравилаОбработкиЭлектроннойПочты.Изменение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.ПретензииКлиентов.Чтение.ВнешниеПользователи
	|Справочник.ПретензииКлиентов.Чтение.ГруппыПартнеров
	|Справочник.ПретензииКлиентов.Изменение.ВнешниеПользователи
	|Справочник.ПретензииКлиентов.Изменение.ГруппыПартнеров
	|Справочник.ПретензииКлиентовПрисоединенныеФайлы.Чтение.ВнешниеПользователи
	|Справочник.ПретензииКлиентовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПретензииКлиентовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПриобретениеТоваровУслугПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПриобретениеТоваровУслугПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриобретениеТоваровУслугПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПриобретениеТоваровУслугПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПриобретениеТоваровУслугПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПриобретениеТоваровУслугПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПриобретениеТоваровУслугПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПриобретениеТоваровУслугПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПрочиеДоходыРасходыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПрочиеДоходыРасходыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РабочиеУчастки.Чтение.Склады
	|Справочник.РабочиеУчастки.Изменение.Склады
	|Справочник.РассылкаКлиентамПрисоединенныеФайлы.Чтение.Объект.Документ.РассылкаКлиентам
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Чтение.Склады
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Изменение.Склады
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.РегистрацииВНалоговомОргане.Чтение.Организации
	|Справочник.РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СделкиСКлиентами.Чтение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СделкиСКлиентами.Изменение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СделкиСКлиентамиПрисоединенныеФайлы.Чтение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СделкиСКлиентамиПрисоединенныеФайлы.Изменение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СкладскиеПомещения.Чтение.Склады
	|Справочник.СкладскиеЯчейки.Чтение.Склады
	|Справочник.СкладскиеЯчейки.Изменение.Склады
	|Справочник.Склады.Чтение.Склады
	|Справочник.Склады.Изменение.Склады
	|Справочник.СоглашенияСКлиентами.Чтение.ВнешниеПользователи
	|Справочник.СоглашенияСКлиентами.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентами.Чтение.Организации
	|Справочник.СоглашенияСКлиентами.Чтение.Склады
	|Справочник.СоглашенияСКлиентами.Чтение.СоглашенияСКлиентамиЧтение
	|Справочник.СоглашенияСКлиентами.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентами.Изменение.Организации
	|Справочник.СоглашенияСКлиентами.Изменение.Склады
	|Справочник.СоглашенияСКлиентами.Изменение.СоглашенияСКлиентамиИзменение
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Чтение.Склады
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Чтение.СоглашенияСКлиентамиЧтение
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Изменение.Склады
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Изменение.СоглашенияСКлиентамиИзменение
	|Справочник.СоглашенияСПоставщиками.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщиками.Чтение.Организации
	|Справочник.СоглашенияСПоставщиками.Чтение.Склады
	|Справочник.СоглашенияСПоставщиками.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщиками.Изменение.Организации
	|Справочник.СоглашенияСПоставщиками.Изменение.Склады
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Чтение.Склады
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Изменение.Склады
	|Справочник.СообщениеSMSПрисоединенныеФайлы.Чтение.Объект.Документ.СообщениеSMS
	|Справочник.СообщениеSMSПрисоединенныеФайлы.Изменение.Объект.Документ.СообщениеSMS
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.ХозяйственныеОперации
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.ХозяйственныеОперации
	|Справочник.СписаниеЗадолженностиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СписаниеЗадолженностиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СписаниеЗадолженностиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СписаниеЗадолженностиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СправкаОПодтверждающихДокументахПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СправкаОПодтверждающихДокументахПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СтруктураПредприятия.Чтение.Подразделения
	|Справочник.СчетНаОплатуКлиентуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетНаОплатуКлиентуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетНаОплатуКлиентуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетНаОплатуКлиентуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураВыданныйАвансПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураВыданныйАвансПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураКомитентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураКомитентаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураПолученныйАвансПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураПолученныйАвансПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ТелефонныйЗвонокПрисоединенныеФайлы.Чтение.Объект.Документ.ТелефонныйЗвонок
	|Справочник.ТелефонныйЗвонокПрисоединенныеФайлы.Изменение.Объект.Документ.ТелефонныйЗвонок
	|Справочник.ТранспортнаяНакладнаяПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ТранспортнаяНакладнаяПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УпаковкиЕдиницыИзмерения.Изменение.ГруппыНоменклатуры
	|Справочник.УсловияОбслуживанияПартнеровТорговымиПредставителями.Чтение.ГруппыПартнеров
	|Справочник.УсловияОбслуживанияПартнеровТорговымиПредставителями.Изменение.ГруппыПартнеров
	|Справочник.УстановкаЦенНоменклатурыПрисоединенныеФайлы.Чтение.Объект.Документ.УстановкаЦенНоменклатуры
	|Справочник.УстановкаЦенНоменклатурыПрисоединенныеФайлы.Изменение.Объект.Документ.УстановкаЦенНоменклатуры
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Чтение.Пользователи
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Чтение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Изменение.Пользователи
	|Справочник.Файлы.Чтение.ВнешниеПользователи
	|Справочник.Файлы.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.Задание
	|Справочник.Файлы.Чтение.Объект.Документ.ОтчетОРозничныхПродажах
	|Справочник.Файлы.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.Файлы.Чтение.Объект.Справочник.ФизическиеЛица
	|Справочник.Файлы.Изменение.ВнешниеПользователи
	|Справочник.Файлы.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.Задание
	|Справочник.Файлы.Изменение.Объект.Документ.ОтчетОРозничныхПродажах
	|Справочник.Файлы.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.Файлы.Изменение.Объект.Справочник.ФизическиеЛица
	|Справочник.ХарактеристикиНоменклатуры.Изменение.ГруппыНоменклатуры
	|Справочник.ШаблоныСообщений.Чтение.Пользователи
	|Справочник.ШаблоныСообщений.Изменение.Пользователи
	|Справочник.ШаблоныСообщенийПрисоединенныеФайлы.Чтение.Пользователи
	|Справочник.ШаблоныСообщенийПрисоединенныеФайлы.Изменение.Пользователи
	|Справочник.ЭДПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЭквайринговыеТерминалы.Чтение.Организации
	|Справочник.ЭквайринговыеТерминалы.Чтение.ЭквайринговыеТерминалы
	|Справочник.ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.Чтение.Объект.Документ.ЭлектронноеПисьмоВходящее
	|Справочник.ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.Изменение.Объект.Документ.ЭлектронноеПисьмоВходящее
	|Справочник.ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы.Чтение.Объект.Документ.ЭлектронноеПисьмоИсходящее
	|Справочник.ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы.Изменение.Объект.Документ.ЭлектронноеПисьмоИсходящее
	|Документ.АвансовыйОтчет.Чтение.ГруппыПартнеров
	|Документ.АвансовыйОтчет.Чтение.ГруппыФизическихЛиц
	|Документ.АвансовыйОтчет.Чтение.Организации
	|Документ.АвансовыйОтчет.Чтение.Подразделения
	|Документ.АвансовыйОтчет.Изменение.ГруппыПартнеров
	|Документ.АвансовыйОтчет.Изменение.ГруппыФизическихЛиц
	|Документ.АвансовыйОтчет.Изменение.Организации
	|Документ.АвансовыйОтчет.Изменение.Подразделения
	|Документ.АктВыполненныхРабот.Чтение.ВнешниеПользователи
	|Документ.АктВыполненныхРабот.Чтение.ГруппыПартнеров
	|Документ.АктВыполненныхРабот.Чтение.Организации
	|Документ.АктВыполненныхРабот.Чтение.Подразделения
	|Документ.АктВыполненныхРабот.Изменение.ГруппыПартнеров
	|Документ.АктВыполненныхРабот.Изменение.Организации
	|Документ.АктВыполненныхРабот.Изменение.Подразделения
	|Документ.АктОРасхожденияхПослеОтгрузки.Чтение.ВнешниеПользователи
	|Документ.АктОРасхожденияхПослеОтгрузки.Чтение.ГруппыПартнеров
	|Документ.АктОРасхожденияхПослеОтгрузки.Чтение.Организации
	|Документ.АктОРасхожденияхПослеОтгрузки.Чтение.ТипыОснованийАктаОРасхождениях
	|Документ.АктОРасхожденияхПослеОтгрузки.Изменение.ВнешниеПользователи
	|Документ.АктОРасхожденияхПослеОтгрузки.Изменение.ГруппыПартнеров
	|Документ.АктОРасхожденияхПослеОтгрузки.Изменение.Организации
	|Документ.АктОРасхожденияхПослеОтгрузки.Изменение.ТипыОснованийАктаОРасхождениях
	|Документ.АктОРасхожденияхПослеПеремещения.Чтение.Организации
	|Документ.АктОРасхожденияхПослеПеремещения.Чтение.Склады
	|Документ.АктОРасхожденияхПослеПеремещения.Изменение.Организации
	|Документ.АктОРасхожденияхПослеПеремещения.Изменение.Склады
	|Документ.АктОРасхожденияхПослеПриемки.Чтение.ГруппыПартнеров
	|Документ.АктОРасхожденияхПослеПриемки.Чтение.Организации
	|Документ.АктОРасхожденияхПослеПриемки.Чтение.ТипыОснованийАктаОРасхождениях
	|Документ.АктОРасхожденияхПослеПриемки.Изменение.ГруппыПартнеров
	|Документ.АктОРасхожденияхПослеПриемки.Изменение.Организации
	|Документ.АктОРасхожденияхПослеПриемки.Изменение.ТипыОснованийАктаОРасхождениях
	|Документ.АктПостановкиНаБалансЕГАИС.Чтение.ГруппыПартнеров
	|Документ.АктПостановкиНаБалансЕГАИС.Чтение.Организации
	|Документ.АктПостановкиНаБалансЕГАИС.Изменение.ГруппыПартнеров
	|Документ.АктПостановкиНаБалансЕГАИС.Изменение.Организации
	|Документ.АктСписанияЕГАИС.Чтение.ГруппыПартнеров
	|Документ.АктСписанияЕГАИС.Чтение.Организации
	|Документ.АктСписанияЕГАИС.Изменение.ГруппыПартнеров
	|Документ.АктСписанияЕГАИС.Изменение.Организации
	|Документ.БлокировкаВычетаНДС.Чтение.Организации
	|Документ.БлокировкаВычетаНДС.Изменение.Организации
	|Документ.ВводОстатков.Чтение.Организации
	|Документ.ВводОстатков.Чтение.Склады
	|Документ.ВводОстатков.Изменение.Организации
	|Документ.ВводОстатков.Изменение.Склады
	|Документ.ВзаимозачетЗадолженности.Чтение.ГруппыПартнеров
	|Документ.ВзаимозачетЗадолженности.Чтение.Организации
	|Документ.ВзаимозачетЗадолженности.Изменение.ВидыОперацийВзаимозачетаЗадолженности
	|Документ.ВзаимозачетЗадолженности.Изменение.ГруппыПартнеров
	|Документ.ВзаимозачетЗадолженности.Изменение.Организации
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Чтение.Кассы
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Чтение.КассыККМ
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Чтение.Организации
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Изменение.Кассы
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Изменение.КассыККМ
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Изменение.Организации
	|Документ.ВнутреннееПотреблениеТоваров.Чтение.Организации
	|Документ.ВнутреннееПотреблениеТоваров.Чтение.Подразделения
	|Документ.ВнутреннееПотреблениеТоваров.Чтение.Склады
	|Документ.ВнутреннееПотреблениеТоваров.Изменение.Организации
	|Документ.ВнутреннееПотреблениеТоваров.Изменение.Подразделения
	|Документ.ВнутреннееПотреблениеТоваров.Изменение.Склады
	|Документ.ВозвратВОборотИСМП.Чтение.Организации
	|Документ.ВозвратВОборотИСМП.Изменение.Организации
	|Документ.ВозвратИзРегистра2ЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ВозвратИзРегистра2ЕГАИС.Чтение.Организации
	|Документ.ВозвратИзРегистра2ЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ВозвратИзРегистра2ЕГАИС.Изменение.Организации
	|Документ.ВозвратТоваровМеждуОрганизациями.Чтение.ГруппыПартнеров
	|Документ.ВозвратТоваровМеждуОрганизациями.Чтение.Организации
	|Документ.ВозвратТоваровМеждуОрганизациями.Чтение.Подразделения
	|Документ.ВозвратТоваровМеждуОрганизациями.Чтение.Склады
	|Документ.ВозвратТоваровМеждуОрганизациями.Изменение.ГруппыПартнеров
	|Документ.ВозвратТоваровМеждуОрганизациями.Изменение.Организации
	|Документ.ВозвратТоваровМеждуОрганизациями.Изменение.Подразделения
	|Документ.ВозвратТоваровМеждуОрганизациями.Изменение.Склады
	|Документ.ВозвратТоваровОтКлиента.Чтение.ВнешниеПользователи
	|Документ.ВозвратТоваровОтКлиента.Чтение.ГруппыПартнеров
	|Документ.ВозвратТоваровОтКлиента.Чтение.Организации
	|Документ.ВозвратТоваровОтКлиента.Чтение.Подразделения
	|Документ.ВозвратТоваровОтКлиента.Чтение.Склады
	|Документ.ВозвратТоваровОтКлиента.Изменение.ГруппыПартнеров
	|Документ.ВозвратТоваровОтКлиента.Изменение.Организации
	|Документ.ВозвратТоваровОтКлиента.Изменение.Подразделения
	|Документ.ВозвратТоваровОтКлиента.Изменение.Склады
	|Документ.ВозвратТоваровПоставщику.Чтение.ГруппыПартнеров
	|Документ.ВозвратТоваровПоставщику.Чтение.Организации
	|Документ.ВозвратТоваровПоставщику.Чтение.Подразделения
	|Документ.ВозвратТоваровПоставщику.Чтение.Склады
	|Документ.ВозвратТоваровПоставщику.Изменение.ГруппыПартнеров
	|Документ.ВозвратТоваровПоставщику.Изменение.Организации
	|Документ.ВозвратТоваровПоставщику.Изменение.Подразделения
	|Документ.ВозвратТоваровПоставщику.Изменение.Склады
	|Документ.Встреча.Чтение.Объект.Документ.Встреча
	|Документ.Встреча.Изменение.Объект.Документ.Встреча
	|Документ.ВыводИзОборотаИСМП.Чтение.Организации
	|Документ.ВыводИзОборотаИСМП.Изменение.Организации
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Чтение.КассыККМ
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Чтение.Организации
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Изменение.КассыККМ
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Изменение.Организации
	|Документ.ВыкупВозвратнойТарыКлиентом.Чтение.Организации
	|Документ.ВыкупВозвратнойТарыКлиентом.Изменение.Организации
	|Документ.ВыкупВозвратнойТарыУПоставщика.Чтение.Организации
	|Документ.ВыкупВозвратнойТарыУПоставщика.Изменение.Организации
	|Документ.ДвижениеПрочихАктивовПассивов.Чтение.Организации
	|Документ.ДвижениеПрочихАктивовПассивов.Изменение.Организации
	|Документ.ДоверенностьВыданная.Чтение.ГруппыПартнеров
	|Документ.ДоверенностьВыданная.Чтение.ГруппыФизическихЛиц
	|Документ.ДоверенностьВыданная.Чтение.Организации
	|Документ.ДоверенностьВыданная.Изменение.ГруппыПартнеров
	|Документ.ДоверенностьВыданная.Изменение.ГруппыФизическихЛиц
	|Документ.ДоверенностьВыданная.Изменение.Организации
	|Документ.ЗаданиеНаПеревозку.Чтение.Склады
	|Документ.ЗаданиеНаПеревозку.Изменение.Склады
	|Документ.ЗаданиеТорговомуПредставителю.Чтение.ГруппыПартнеров
	|Документ.ЗаданиеТорговомуПредставителю.Чтение.Организации
	|Документ.ЗаданиеТорговомуПредставителю.Чтение.Склады
	|Документ.ЗаданиеТорговомуПредставителю.Изменение.ГруппыПартнеров
	|Документ.ЗаданиеТорговомуПредставителю.Изменение.Организации
	|Документ.ЗаданиеТорговомуПредставителю.Изменение.Склады
	|Документ.ЗаказКлиента.Чтение.ВнешниеПользователи
	|Документ.ЗаказКлиента.Чтение.ГруппыПартнеров
	|Документ.ЗаказКлиента.Чтение.Организации
	|Документ.ЗаказКлиента.Чтение.Подразделения
	|Документ.ЗаказКлиента.Чтение.Склады
	|Документ.ЗаказКлиента.Изменение.ВнешниеПользователи
	|Документ.ЗаказКлиента.Изменение.ГруппыПартнеров
	|Документ.ЗаказКлиента.Изменение.Организации
	|Документ.ЗаказКлиента.Изменение.Подразделения
	|Документ.ЗаказКлиента.Изменение.Склады
	|Документ.ЗаказНаВнутреннееПотребление.Чтение.Организации
	|Документ.ЗаказНаВнутреннееПотребление.Чтение.Подразделения
	|Документ.ЗаказНаВнутреннееПотребление.Чтение.Склады
	|Документ.ЗаказНаВнутреннееПотребление.Изменение.Организации
	|Документ.ЗаказНаВнутреннееПотребление.Изменение.Подразделения
	|Документ.ЗаказНаВнутреннееПотребление.Изменение.Склады
	|Документ.ЗаказНаПеремещение.Чтение.Организации
	|Документ.ЗаказНаПеремещение.Чтение.Склады
	|Документ.ЗаказНаПеремещение.Изменение.Организации
	|Документ.ЗаказНаПеремещение.Изменение.Склады
	|Документ.ЗаказНаСборку.Чтение.Организации
	|Документ.ЗаказНаСборку.Чтение.Склады
	|Документ.ЗаказНаСборку.Изменение.Организации
	|Документ.ЗаказНаСборку.Изменение.Склады
	|Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Чтение.Организации
	|Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Изменение.Организации
	|Документ.ЗаказПоставщику.Чтение.ГруппыПартнеров
	|Документ.ЗаказПоставщику.Чтение.Организации
	|Документ.ЗаказПоставщику.Чтение.Подразделения
	|Документ.ЗаказПоставщику.Чтение.Склады
	|Документ.ЗаказПоставщику.Изменение.ГруппыПартнеров
	|Документ.ЗаказПоставщику.Изменение.Организации
	|Документ.ЗаказПоставщику.Изменение.Подразделения
	|Документ.ЗаказПоставщику.Изменение.Склады
	|Документ.ЗаписьКнигиПокупок.Чтение.Организации
	|Документ.ЗаписьКнигиПокупок.Изменение.Организации
	|Документ.ЗаписьКнигиПродаж.Чтение.Организации
	|Документ.ЗаписьКнигиПродаж.Изменение.Организации
	|Документ.ЗапланированноеВзаимодействие.Чтение.Объект.Документ.ЗапланированноеВзаимодействие
	|Документ.ЗапланированноеВзаимодействие.Изменение.Объект.Документ.ЗапланированноеВзаимодействие
	|Документ.ЗапросАкцизныхМарокЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ЗапросАкцизныхМарокЕГАИС.Чтение.Организации
	|Документ.ЗапросАкцизныхМарокЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ЗапросАкцизныхМарокЕГАИС.Изменение.Организации
	|Документ.ЗапросКоммерческихПредложенийПоставщиков.Чтение.Организации
	|Документ.ЗапросКоммерческихПредложенийПоставщиков.Изменение.Организации
	|Документ.ЗапросКоммерческогоПредложенияОтКлиента.Чтение.Организации
	|Документ.ЗапросКоммерческогоПредложенияОтКлиента.Изменение.Организации
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Чтение.ВнешниеПользователи
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Чтение.ГруппыПартнеров
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Чтение.Организации
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Чтение.Склады
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Изменение.ВнешниеПользователи
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Изменение.ГруппыПартнеров
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Изменение.Организации
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Изменение.Склады
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Чтение.ГруппыПартнеров
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Чтение.Организации
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Изменение.ГруппыПартнеров
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Изменение.Организации
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.ГруппыПартнеров
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.Организации
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.Подразделения
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.Пользователи
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.ГруппыПартнеров
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.Организации
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.Подразделения
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.Пользователи
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.ЗаявлениеОВвозеТоваров.Чтение.Организации
	|Документ.ЗаявлениеОВвозеТоваров.Изменение.Организации
	|Документ.ИзменениеАссортимента.Чтение.Объект.Документ.ИзменениеАссортимента
	|Документ.ИзменениеАссортимента.Изменение.Объект.Документ.ИзменениеАссортимента
	|Документ.ИнвентаризационнаяОпись.Чтение.Организации
	|Документ.ИнвентаризационнаяОпись.Чтение.Склады
	|Документ.ИнвентаризационнаяОпись.Изменение.Организации
	|Документ.ИнвентаризационнаяОпись.Изменение.Склады
	|Документ.ИнвентаризацияНаличныхДенежныхСредств.Чтение.Организации
	|Документ.ИнвентаризацияНаличныхДенежныхСредств.Изменение.Организации
	|Документ.ИнойДокументПодтвержденияНДС.Чтение.ГруппыПартнеров
	|Документ.ИнойДокументПодтвержденияНДС.Чтение.Организации
	|Документ.ИнойДокументПодтвержденияНДС.Изменение.ГруппыПартнеров
	|Документ.ИнойДокументПодтвержденияНДС.Изменение.Организации
	|Документ.КассоваяСмена.Чтение.Организации
	|Документ.КассоваяСмена.Изменение.Организации
	|Документ.КоммерческоеПредложениеКлиенту.Чтение.ГруппыПартнеров
	|Документ.КоммерческоеПредложениеКлиенту.Чтение.Организации
	|Документ.КоммерческоеПредложениеКлиенту.Изменение.ГруппыПартнеров
	|Документ.КоммерческоеПредложениеКлиенту.Изменение.Организации
	|Документ.КоммерческоеПредложениеПоставщика.Чтение.Организации
	|Документ.КоммерческоеПредложениеПоставщика.Изменение.Организации
	|Документ.КорректировкаВидаДеятельностиНДС.Чтение.Организации
	|Документ.КорректировкаВидаДеятельностиНДС.Изменение.Организации
	|Документ.КорректировкаЗадолженностиПоФинансовымИнструментам.Чтение.ГруппыПартнеров
	|Документ.КорректировкаЗадолженностиПоФинансовымИнструментам.Чтение.Организации
	|Документ.КорректировкаЗадолженностиПоФинансовымИнструментам.Изменение.ГруппыПартнеров
	|Документ.КорректировкаЗадолженностиПоФинансовымИнструментам.Изменение.Организации
	|Документ.КорректировкаИзлишковНедостачПоТоварнымМестам.Чтение.Склады
	|Документ.КорректировкаИзлишковНедостачПоТоварнымМестам.Изменение.Склады
	|Документ.КорректировкаНазначенияТоваров.Чтение.Организации
	|Документ.КорректировкаНазначенияТоваров.Изменение.Организации
	|Документ.КорректировкаНалогообложенияНДСПартийТоваров.Чтение.Организации
	|Документ.КорректировкаНалогообложенияНДСПартийТоваров.Изменение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Чтение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Чтение.Склады
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Изменение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Изменение.Склады
	|Документ.КорректировкаПоОрдеруНаТовары.Чтение.Склады
	|Документ.КорректировкаПоОрдеруНаТовары.Изменение.Склады
	|Документ.КорректировкаПриобретения.Чтение.ГруппыПартнеров
	|Документ.КорректировкаПриобретения.Чтение.Организации
	|Документ.КорректировкаПриобретения.Чтение.Подразделения
	|Документ.КорректировкаПриобретения.Чтение.Склады
	|Документ.КорректировкаПриобретения.Изменение.ГруппыПартнеров
	|Документ.КорректировкаПриобретения.Изменение.Организации
	|Документ.КорректировкаПриобретения.Изменение.Подразделения
	|Документ.КорректировкаПриобретения.Изменение.Склады
	|Документ.КорректировкаРеализации.Чтение.ВнешниеПользователи
	|Документ.КорректировкаРеализации.Чтение.ГруппыПартнеров
	|Документ.КорректировкаРеализации.Чтение.Организации
	|Документ.КорректировкаРеализации.Чтение.Подразделения
	|Документ.КорректировкаРеализации.Чтение.Склады
	|Документ.КорректировкаРеализации.Изменение.ГруппыПартнеров
	|Документ.КорректировкаРеализации.Изменение.Организации
	|Документ.КорректировкаРеализации.Изменение.Подразделения
	|Документ.КорректировкаРеализации.Изменение.Склады
	|Документ.ЛимитыРасходаДенежныхСредств.Чтение.Организации
	|Документ.ЛимитыРасходаДенежныхСредств.Чтение.Подразделения
	|Документ.ЛимитыРасходаДенежныхСредств.Изменение.Организации
	|Документ.ЛимитыРасходаДенежныхСредств.Изменение.Подразделения
	|Документ.ЛистКассовойКниги.Чтение.Организации
	|Документ.ЛистКассовойКниги.Изменение.Организации
	|Документ.МаркировкаТоваровГИСМ.Чтение.Организации
	|Документ.МаркировкаТоваровГИСМ.Чтение.Склады
	|Документ.МаркировкаТоваровГИСМ.Изменение.Организации
	|Документ.МаркировкаТоваровГИСМ.Изменение.Склады
	|Документ.МаркировкаТоваровИСМП.Чтение.Организации
	|Документ.МаркировкаТоваровИСМП.Изменение.Организации
	|Документ.НачисленияКредитовИДепозитов.Чтение.Организации
	|Документ.НачисленияКредитовИДепозитов.Изменение.Организации
	|Документ.ОжидаемоеПоступлениеДенежныхСредств.Чтение.Кассы
	|Документ.ОжидаемоеПоступлениеДенежныхСредств.Чтение.Организации
	|Документ.ОжидаемоеПоступлениеДенежныхСредств.Изменение.Кассы
	|Документ.ОжидаемоеПоступлениеДенежныхСредств.Изменение.Организации
	|Документ.ОперацияПоПлатежнойКарте.Чтение.ГруппыПартнеров
	|Документ.ОперацияПоПлатежнойКарте.Чтение.Организации
	|Документ.ОперацияПоПлатежнойКарте.Чтение.ЭквайринговыеТерминалы
	|Документ.ОперацияПоПлатежнойКарте.Изменение.ГруппыПартнеров
	|Документ.ОперацияПоПлатежнойКарте.Изменение.Организации
	|Документ.ОперацияПоПлатежнойКарте.Изменение.ЭквайринговыеТерминалы
	|Документ.ОперацияПоЯндексКассе.Чтение.ГруппыПартнеров
	|Документ.ОперацияПоЯндексКассе.Чтение.Организации
	|Документ.ОперацияПоЯндексКассе.Изменение.ГруппыПартнеров
	|Документ.ОперацияПоЯндексКассе.Изменение.Организации
	|Документ.ОприходованиеИзлишковТоваров.Чтение.Организации
	|Документ.ОприходованиеИзлишковТоваров.Чтение.Подразделения
	|Документ.ОприходованиеИзлишковТоваров.Чтение.Склады
	|Документ.ОприходованиеИзлишковТоваров.Изменение.Организации
	|Документ.ОприходованиеИзлишковТоваров.Изменение.Подразделения
	|Документ.ОприходованиеИзлишковТоваров.Изменение.Склады
	|Документ.ОрдерНаОтражениеИзлишковТоваров.Чтение.Склады
	|Документ.ОрдерНаОтражениеИзлишковТоваров.Изменение.Склады
	|Документ.ОрдерНаОтражениеНедостачТоваров.Чтение.Склады
	|Документ.ОрдерНаОтражениеНедостачТоваров.Изменение.Склады
	|Документ.ОрдерНаОтражениеПересортицыТоваров.Чтение.Склады
	|Документ.ОрдерНаОтражениеПересортицыТоваров.Изменение.Склады
	|Документ.ОрдерНаОтражениеПорчиТоваров.Чтение.Склады
	|Документ.ОрдерНаОтражениеПорчиТоваров.Изменение.Склады
	|Документ.ОрдерНаПеремещениеТоваров.Чтение.Склады
	|Документ.ОрдерНаПеремещениеТоваров.Изменение.Склады
	|Документ.ОстаткиЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ОстаткиЕГАИС.Чтение.Организации
	|Документ.ОстаткиЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ОстаткиЕГАИС.Изменение.Организации
	|Документ.ОтборРазмещениеТоваров.Чтение.Склады
	|Документ.ОтборРазмещениеТоваров.Изменение.Склады
	|Документ.ОтгрузкаТоваровИСМП.Чтение.Организации
	|Документ.ОтгрузкаТоваровИСМП.Изменение.Организации
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Чтение.Организации
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Изменение.ГруппыФизическихЛиц
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Изменение.Организации
	|Документ.ОтражениеРасхожденийПриИнкассацииДенежныхСредств.Чтение.Организации
	|Документ.ОтражениеРасхожденийПриИнкассацииДенежныхСредств.Изменение.Организации
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Чтение.Организации
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Чтение.Подразделения
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Изменение.Организации
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Изменение.Подразделения
	|Документ.ОтчетЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ОтчетЕГАИС.Чтение.Организации
	|Документ.ОтчетЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ОтчетЕГАИС.Изменение.Организации
	|Документ.ОтчетКомиссионера.Чтение.ВнешниеПользователи
	|Документ.ОтчетКомиссионера.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомиссионера.Чтение.Организации
	|Документ.ОтчетКомиссионера.Чтение.Подразделения
	|Документ.ОтчетКомиссионера.Изменение.ВнешниеПользователи
	|Документ.ОтчетКомиссионера.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомиссионера.Изменение.Организации
	|Документ.ОтчетКомиссионера.Изменение.Подразделения
	|Документ.ОтчетКомиссионераОСписании.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомиссионераОСписании.Чтение.Организации
	|Документ.ОтчетКомиссионераОСписании.Чтение.Подразделения
	|Документ.ОтчетКомиссионераОСписании.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомиссионераОСписании.Изменение.Организации
	|Документ.ОтчетКомиссионераОСписании.Изменение.Подразделения
	|Документ.ОтчетКомитенту.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомитенту.Чтение.Организации
	|Документ.ОтчетКомитенту.Чтение.Подразделения
	|Документ.ОтчетКомитенту.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомитенту.Изменение.Организации
	|Документ.ОтчетКомитенту.Изменение.Подразделения
	|Документ.ОтчетКомитентуОСписании.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомитентуОСписании.Чтение.Организации
	|Документ.ОтчетКомитентуОСписании.Чтение.Подразделения
	|Документ.ОтчетКомитентуОСписании.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомитентуОСписании.Изменение.Организации
	|Документ.ОтчетКомитентуОСписании.Изменение.Подразделения
	|Документ.ОтчетОРозничныхПродажах.Чтение.КассыККМ
	|Документ.ОтчетОРозничныхПродажах.Чтение.Организации
	|Документ.ОтчетОРозничныхПродажах.Чтение.Подразделения
	|Документ.ОтчетОРозничныхПродажах.Чтение.Склады
	|Документ.ОтчетОРозничныхПродажах.Изменение.КассыККМ
	|Документ.ОтчетОРозничныхПродажах.Изменение.Организации
	|Документ.ОтчетОРозничныхПродажах.Изменение.Подразделения
	|Документ.ОтчетОРозничныхПродажах.Изменение.Склады
	|Документ.ОтчетПоКомиссииМеждуОрганизациями.Чтение.ГруппыПартнеров
	|Документ.ОтчетПоКомиссииМеждуОрганизациями.Чтение.Организации
	|Документ.ОтчетПоКомиссииМеждуОрганизациями.Чтение.Подразделения
	|Документ.ОтчетПоКомиссииМеждуОрганизациями.Изменение.ГруппыПартнеров
	|Документ.ОтчетПоКомиссииМеждуОрганизациями.Изменение.Организации
	|Документ.ОтчетПоКомиссииМеждуОрганизациями.Изменение.Подразделения
	|Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании.Чтение.ГруппыПартнеров
	|Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании.Чтение.Организации
	|Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании.Чтение.Подразделения
	|Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании.Изменение.ГруппыПартнеров
	|Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании.Изменение.Организации
	|Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании.Изменение.Подразделения
	|Документ.ПакетОбменСБанками.Чтение.Организации
	|Документ.ПакетЭД.Чтение.Организации
	|Документ.ПервичныйДокумент.Чтение.Организации
	|Документ.ПервичныйДокумент.Изменение.Организации
	|Документ.ПередачаВРегистр2ЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ПередачаВРегистр2ЕГАИС.Чтение.Организации
	|Документ.ПередачаВРегистр2ЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ПередачаВРегистр2ЕГАИС.Изменение.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Чтение.ГруппыПартнеров
	|Документ.ПередачаТоваровМеждуОрганизациями.Чтение.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Чтение.Подразделения
	|Документ.ПередачаТоваровМеждуОрганизациями.Чтение.Склады
	|Документ.ПередачаТоваровМеждуОрганизациями.Изменение.ГруппыПартнеров
	|Документ.ПередачаТоваровМеждуОрганизациями.Изменение.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Изменение.Подразделения
	|Документ.ПередачаТоваровМеждуОрганизациями.Изменение.Склады
	|Документ.ПеремаркировкаТоваровГИСМ.Чтение.Организации
	|Документ.ПеремаркировкаТоваровГИСМ.Чтение.Склады
	|Документ.ПеремаркировкаТоваровГИСМ.Изменение.Организации
	|Документ.ПеремаркировкаТоваровГИСМ.Изменение.Склады
	|Документ.ПеремаркировкаТоваровИСМП.Чтение.Организации
	|Документ.ПеремаркировкаТоваровИСМП.Изменение.Организации
	|Документ.ПеремещениеТоваров.Чтение.Организации
	|Документ.ПеремещениеТоваров.Чтение.Склады
	|Документ.ПеремещениеТоваров.Изменение.Организации
	|Документ.ПеремещениеТоваров.Изменение.Склады
	|Документ.ПересортицаТоваров.Чтение.Организации
	|Документ.ПересортицаТоваров.Чтение.Подразделения
	|Документ.ПересортицаТоваров.Чтение.Склады
	|Документ.ПересортицаТоваров.Изменение.Организации
	|Документ.ПересортицаТоваров.Изменение.Подразделения
	|Документ.ПересортицаТоваров.Изменение.Склады
	|Документ.ПересчетТоваров.Чтение.Склады
	|Документ.ПересчетТоваров.Изменение.Склады
	|Документ.ПисьмоОбменСБанками.Чтение.Организации
	|Документ.ПланЗакупок.Чтение.ГруппыПартнеров
	|Документ.ПланЗакупок.Чтение.Подразделения
	|Документ.ПланЗакупок.Чтение.Склады
	|Документ.ПланЗакупок.Изменение.ГруппыПартнеров
	|Документ.ПланЗакупок.Изменение.Подразделения
	|Документ.ПланЗакупок.Изменение.Склады
	|Документ.ПланОстатков.Чтение.Склады
	|Документ.ПланОстатков.Изменение.Склады
	|Документ.ПланПродаж.Чтение.ВнешниеПользователи
	|Документ.ПланПродаж.Чтение.ГруппыПартнеров
	|Документ.ПланПродаж.Чтение.Подразделения
	|Документ.ПланПродаж.Чтение.Склады
	|Документ.ПланПродаж.Изменение.ВнешниеПользователи
	|Документ.ПланПродаж.Изменение.ГруппыПартнеров
	|Документ.ПланПродаж.Изменение.Подразделения
	|Документ.ПланПродаж.Изменение.Склады
	|Документ.ПланПродажПоКатегориям.Чтение.Подразделения
	|Документ.ПланПродажПоКатегориям.Чтение.Склады
	|Документ.ПланПродажПоКатегориям.Изменение.Подразделения
	|Документ.ПланПродажПоКатегориям.Изменение.Склады
	|Документ.ПоручениеЭкспедитору.Чтение.ГруппыПартнеров
	|Документ.ПоручениеЭкспедитору.Чтение.ГруппыФизическихЛиц
	|Документ.ПоручениеЭкспедитору.Чтение.Подразделения
	|Документ.ПоручениеЭкспедитору.Чтение.Склады
	|Документ.ПоручениеЭкспедитору.Изменение.ГруппыПартнеров
	|Документ.ПоручениеЭкспедитору.Изменение.ГруппыФизическихЛиц
	|Документ.ПоручениеЭкспедитору.Изменение.Подразделения
	|Документ.ПоручениеЭкспедитору.Изменение.Склады
	|Документ.ПорчаТоваров.Чтение.Организации
	|Документ.ПорчаТоваров.Чтение.Подразделения
	|Документ.ПорчаТоваров.Чтение.Склады
	|Документ.ПорчаТоваров.Изменение.Организации
	|Документ.ПорчаТоваров.Изменение.Подразделения
	|Документ.ПорчаТоваров.Изменение.Склады
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Чтение.Организации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Изменение.Организации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.ПоступлениеТоваровНаСклад.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеТоваровНаСклад.Чтение.Организации
	|Документ.ПоступлениеТоваровНаСклад.Чтение.Подразделения
	|Документ.ПоступлениеТоваровНаСклад.Чтение.Склады
	|Документ.ПоступлениеТоваровНаСклад.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеТоваровНаСклад.Изменение.Организации
	|Документ.ПоступлениеТоваровНаСклад.Изменение.Подразделения
	|Документ.ПоступлениеТоваровНаСклад.Изменение.Склады
	|Документ.ПриемкаТоваровИСМП.Чтение.Организации
	|Документ.ПриемкаТоваровИСМП.Изменение.Организации
	|Документ.ПриобретениеТоваровУслуг.Чтение.ГруппыПартнеров
	|Документ.ПриобретениеТоваровУслуг.Чтение.Организации
	|Документ.ПриобретениеТоваровУслуг.Чтение.Подразделения
	|Документ.ПриобретениеТоваровУслуг.Чтение.Склады
	|Документ.ПриобретениеТоваровУслуг.Изменение.ГруппыПартнеров
	|Документ.ПриобретениеТоваровУслуг.Изменение.Организации
	|Документ.ПриобретениеТоваровУслуг.Изменение.Подразделения
	|Документ.ПриобретениеТоваровУслуг.Изменение.Склады
	|Документ.ПриобретениеУслугПрочихАктивов.Чтение.ГруппыПартнеров
	|Документ.ПриобретениеУслугПрочихАктивов.Чтение.Организации
	|Документ.ПриобретениеУслугПрочихАктивов.Чтение.Подразделения
	|Документ.ПриобретениеУслугПрочихАктивов.Изменение.ГруппыПартнеров
	|Документ.ПриобретениеУслугПрочихАктивов.Изменение.Организации
	|Документ.ПриобретениеУслугПрочихАктивов.Изменение.Подразделения
	|Документ.ПриходныйКассовыйОрдер.Чтение.ГруппыПартнеров
	|Документ.ПриходныйКассовыйОрдер.Чтение.ГруппыФизическихЛиц
	|Документ.ПриходныйКассовыйОрдер.Чтение.Кассы
	|Документ.ПриходныйКассовыйОрдер.Чтение.КассыККМ
	|Документ.ПриходныйКассовыйОрдер.Чтение.Организации
	|Документ.ПриходныйКассовыйОрдер.Чтение.ХозяйственныеОперации
	|Документ.ПриходныйКассовыйОрдер.Изменение.ГруппыПартнеров
	|Документ.ПриходныйКассовыйОрдер.Изменение.ГруппыФизическихЛиц
	|Документ.ПриходныйКассовыйОрдер.Изменение.Кассы
	|Документ.ПриходныйКассовыйОрдер.Изменение.КассыККМ
	|Документ.ПриходныйКассовыйОрдер.Изменение.Организации
	|Документ.ПриходныйКассовыйОрдер.Изменение.ХозяйственныеОперации
	|Документ.ПриходныйОрдерНаТовары.Чтение.Склады
	|Документ.ПриходныйОрдерНаТовары.Изменение.Склады
	|Документ.ПрочееОприходованиеТоваров.Чтение.Организации
	|Документ.ПрочееОприходованиеТоваров.Чтение.Подразделения
	|Документ.ПрочееОприходованиеТоваров.Чтение.Склады
	|Документ.ПрочееОприходованиеТоваров.Изменение.Организации
	|Документ.ПрочееОприходованиеТоваров.Изменение.Подразделения
	|Документ.ПрочееОприходованиеТоваров.Изменение.Склады
	|Документ.ПрочиеДоходыРасходы.Чтение.Организации
	|Документ.ПрочиеДоходыРасходы.Изменение.Организации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Чтение.Кассы
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Чтение.Организации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Изменение.Кассы
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Изменение.Организации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.РаспределениеДоходовПоНаправлениямДеятельности.Чтение.Организации
	|Документ.РаспределениеДоходовПоНаправлениямДеятельности.Изменение.Организации
	|Документ.РаспределениеНДС.Чтение.Организации
	|Документ.РаспределениеНДС.Изменение.Организации
	|Документ.РаспределениеРасходовБудущихПериодов.Чтение.Организации
	|Документ.РаспределениеРасходовБудущихПериодов.Изменение.Организации
	|Документ.РасходныйКассовыйОрдер.Чтение.ГруппыПартнеров
	|Документ.РасходныйКассовыйОрдер.Чтение.ГруппыФизическихЛиц
	|Документ.РасходныйКассовыйОрдер.Чтение.Кассы
	|Документ.РасходныйКассовыйОрдер.Чтение.КассыККМ
	|Документ.РасходныйКассовыйОрдер.Чтение.Организации
	|Документ.РасходныйКассовыйОрдер.Чтение.Подразделения
	|Документ.РасходныйКассовыйОрдер.Чтение.ХозяйственныеОперации
	|Документ.РасходныйКассовыйОрдер.Изменение.ГруппыПартнеров
	|Документ.РасходныйКассовыйОрдер.Изменение.ГруппыФизическихЛиц
	|Документ.РасходныйКассовыйОрдер.Изменение.Кассы
	|Документ.РасходныйКассовыйОрдер.Изменение.КассыККМ
	|Документ.РасходныйКассовыйОрдер.Изменение.Организации
	|Документ.РасходныйКассовыйОрдер.Изменение.Подразделения
	|Документ.РасходныйКассовыйОрдер.Изменение.ХозяйственныеОперации
	|Документ.РасходныйОрдерНаТовары.Чтение.Склады
	|Документ.РасходныйОрдерНаТовары.Изменение.Склады
	|Документ.РасчетКурсовыхРазниц.Чтение.Организации
	|Документ.РасчетКурсовыхРазниц.Изменение.Организации
	|Документ.РасчетСебестоимостиТоваров.Чтение.Организации
	|Документ.РасчетСебестоимостиТоваров.Изменение.Организации
	|Документ.РеализацияТоваровУслуг.Чтение.ВнешниеПользователи
	|Документ.РеализацияТоваровУслуг.Чтение.ГруппыПартнеров
	|Документ.РеализацияТоваровУслуг.Чтение.Организации
	|Документ.РеализацияТоваровУслуг.Чтение.Подразделения
	|Документ.РеализацияТоваровУслуг.Чтение.Склады
	|Документ.РеализацияТоваровУслуг.Изменение.ГруппыПартнеров
	|Документ.РеализацияТоваровУслуг.Изменение.Организации
	|Документ.РеализацияТоваровУслуг.Изменение.Подразделения
	|Документ.РеализацияТоваровУслуг.Изменение.Склады
	|Документ.РеализацияУслугПрочихАктивов.Чтение.ГруппыПартнеров
	|Документ.РеализацияУслугПрочихАктивов.Чтение.Организации
	|Документ.РеализацияУслугПрочихАктивов.Чтение.Подразделения
	|Документ.РеализацияУслугПрочихАктивов.Изменение.ГруппыПартнеров
	|Документ.РеализацияУслугПрочихАктивов.Изменение.Организации
	|Документ.РеализацияУслугПрочихАктивов.Изменение.Подразделения
	|Документ.РегистраторГрафикаДвиженияТоваров.Чтение.ГруппыПартнеров
	|Документ.РегистрацияЦенНоменклатурыПоставщика.Чтение.ГруппыПартнеров
	|Документ.РегистрацияЦенНоменклатурыПоставщика.Изменение.ГруппыПартнеров
	|Документ.СборкаТоваров.Чтение.Организации
	|Документ.СборкаТоваров.Чтение.Склады
	|Документ.СборкаТоваров.Изменение.Организации
	|Документ.СборкаТоваров.Изменение.Склады
	|Документ.СверкаВзаиморасчетов.Чтение.ГруппыПартнеров
	|Документ.СверкаВзаиморасчетов.Чтение.Организации
	|Документ.СверкаВзаиморасчетов.Изменение.ГруппыПартнеров
	|Документ.СверкаВзаиморасчетов.Изменение.Организации
	|Документ.СводнаяСправкаНДС.Чтение.Организации
	|Документ.СводнаяСправкаНДС.Изменение.Организации
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Чтение.Организации
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Изменение.ГруппыФизическихЛиц
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Изменение.Организации
	|Документ.СообщениеSMS.Чтение.Объект.Документ.СообщениеSMS
	|Документ.СообщениеSMS.Изменение.Объект.Документ.СообщениеSMS
	|Документ.СообщениеОбменСБанками.Чтение.Организации
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.ГруппыПартнеров
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.ГруппыФизическихЛиц
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.Организации
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.ГруппыПартнеров
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.ГруппыФизическихЛиц
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.Организации
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.СписаниеЗадолженности.Чтение.ГруппыПартнеров
	|Документ.СписаниеЗадолженности.Чтение.Организации
	|Документ.СписаниеЗадолженности.Изменение.ГруппыПартнеров
	|Документ.СписаниеЗадолженности.Изменение.Организации
	|Документ.СписаниеКодовМаркировкиИСМП.Чтение.Организации
	|Документ.СписаниеКодовМаркировкиИСМП.Изменение.Организации
	|Документ.СписаниеНДСНаРасходы.Чтение.Организации
	|Документ.СписаниеНДСНаРасходы.Изменение.Организации
	|Документ.СписаниеНедостачТоваров.Чтение.Организации
	|Документ.СписаниеНедостачТоваров.Чтение.Подразделения
	|Документ.СписаниеНедостачТоваров.Чтение.Склады
	|Документ.СписаниеНедостачТоваров.Изменение.Организации
	|Документ.СписаниеНедостачТоваров.Изменение.Подразделения
	|Документ.СписаниеНедостачТоваров.Изменение.Склады
	|Документ.СправкаОПодтверждающихДокументах.Чтение.Организации
	|Документ.СправкаОПодтверждающихДокументах.Изменение.Организации
	|Документ.СчетНаОплатуКлиенту.Чтение.ВнешниеПользователи
	|Документ.СчетНаОплатуКлиенту.Чтение.ГруппыПартнеров
	|Документ.СчетНаОплатуКлиенту.Чтение.Организации
	|Документ.СчетНаОплатуКлиенту.Изменение.ГруппыПартнеров
	|Документ.СчетНаОплатуКлиенту.Изменение.Организации
	|Документ.СчетФактураВыданный.Чтение.ГруппыПартнеров
	|Документ.СчетФактураВыданный.Чтение.Организации
	|Документ.СчетФактураВыданный.Изменение.ГруппыПартнеров
	|Документ.СчетФактураВыданный.Изменение.Организации
	|Документ.СчетФактураВыданныйАванс.Чтение.Организации
	|Документ.СчетФактураВыданныйАванс.Изменение.Организации
	|Документ.СчетФактураКомиссионеру.Чтение.ГруппыПартнеров
	|Документ.СчетФактураКомиссионеру.Чтение.Организации
	|Документ.СчетФактураКомиссионеру.Изменение.ГруппыПартнеров
	|Документ.СчетФактураКомиссионеру.Изменение.Организации
	|Документ.СчетФактураКомитента.Чтение.Организации
	|Документ.СчетФактураКомитента.Изменение.Организации
	|Документ.СчетФактураНалоговыйАгент.Чтение.Организации
	|Документ.СчетФактураНалоговыйАгент.Изменение.Организации
	|Документ.СчетФактураНаНеподтвержденнуюРеализацию0.Чтение.Организации
	|Документ.СчетФактураНаНеподтвержденнуюРеализацию0.Изменение.Организации
	|Документ.СчетФактураПолученный.Чтение.ГруппыПартнеров
	|Документ.СчетФактураПолученный.Чтение.Организации
	|Документ.СчетФактураПолученный.Изменение.ГруппыПартнеров
	|Документ.СчетФактураПолученный.Изменение.Организации
	|Документ.СчетФактураПолученныйАванс.Чтение.Организации
	|Документ.СчетФактураПолученныйАванс.Изменение.Организации
	|Документ.СчетФактураПолученныйНалоговыйАгент.Чтение.ГруппыПартнеров
	|Документ.СчетФактураПолученныйНалоговыйАгент.Чтение.Организации
	|Документ.СчетФактураПолученныйНалоговыйАгент.Изменение.ГруппыПартнеров
	|Документ.СчетФактураПолученныйНалоговыйАгент.Изменение.Организации
	|Документ.ТаможеннаяДекларацияИмпорт.Чтение.ГруппыПартнеров
	|Документ.ТаможеннаяДекларацияИмпорт.Чтение.Организации
	|Документ.ТаможеннаяДекларацияИмпорт.Чтение.Подразделения
	|Документ.ТаможеннаяДекларацияИмпорт.Изменение.ГруппыПартнеров
	|Документ.ТаможеннаяДекларацияИмпорт.Изменение.Организации
	|Документ.ТаможеннаяДекларацияИмпорт.Изменение.Подразделения
	|Документ.ТелефонныйЗвонок.Чтение.Объект.Документ.ТелефонныйЗвонок
	|Документ.ТелефонныйЗвонок.Изменение.Объект.Документ.ТелефонныйЗвонок
	|Документ.ТранспортнаяНакладная.Чтение.Организации
	|Документ.ТранспортнаяНакладная.Изменение.Организации
	|Документ.ТранспортнаяНакладнаяЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ТранспортнаяНакладнаяЕГАИС.Чтение.Организации
	|Документ.ТранспортнаяНакладнаяЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ТранспортнаяНакладнаяЕГАИС.Изменение.Организации
	|Документ.ТТНВходящаяЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ТТНВходящаяЕГАИС.Чтение.Организации
	|Документ.ТТНВходящаяЕГАИС.Чтение.Склады
	|Документ.ТТНВходящаяЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ТТНВходящаяЕГАИС.Изменение.Организации
	|Документ.ТТНВходящаяЕГАИС.Изменение.Склады
	|Документ.ТТНИсходящаяЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ТТНИсходящаяЕГАИС.Чтение.Организации
	|Документ.ТТНИсходящаяЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ТТНИсходящаяЕГАИС.Изменение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Чтение.ГруппыПартнеров
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Изменение.ГруппыПартнеров
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Чтение.ГруппыПартнеров
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Чтение.Организации
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Изменение.ГруппыПартнеров
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Изменение.Организации
	|Документ.УведомлениеОЗачисленииВалюты.Чтение.Организации
	|Документ.УведомлениеОЗачисленииВалюты.Изменение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Чтение.ГруппыПартнеров
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Изменение.ГруппыПартнеров
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Чтение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Изменение.Организации
	|Документ.УдалитьКассовыйЧекКоррекции.Чтение.Кассы
	|Документ.УдалитьКассовыйЧекКоррекции.Чтение.КассыККМ
	|Документ.УдалитьКассовыйЧекКоррекции.Чтение.Организации
	|Документ.УстановкаБлокировокЯчеек.Чтение.Склады
	|Документ.УстановкаБлокировокЯчеек.Изменение.Склады
	|Документ.УстановкаЦенНоменклатуры.Чтение.Объект.Документ.УстановкаЦенНоменклатуры
	|Документ.УстановкаЦенНоменклатуры.Изменение.Объект.Документ.УстановкаЦенНоменклатуры
	|Документ.ЧекЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ЧекЕГАИС.Чтение.Организации
	|Документ.ЧекЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ЧекЕГАИС.Изменение.Организации
	|Документ.ЧекЕГАИСВозврат.Чтение.ГруппыПартнеров
	|Документ.ЧекЕГАИСВозврат.Чтение.Организации
	|Документ.ЧекЕГАИСВозврат.Изменение.ГруппыПартнеров
	|Документ.ЧекЕГАИСВозврат.Изменение.Организации
	|Документ.ЧекККМ.Чтение.КассыККМ
	|Документ.ЧекККМ.Чтение.Организации
	|Документ.ЧекККМ.Чтение.Склады
	|Документ.ЧекККМ.Изменение.КассыККМ
	|Документ.ЧекККМ.Изменение.Организации
	|Документ.ЧекККМ.Изменение.Склады
	|Документ.ЧекККМВозврат.Чтение.КассыККМ
	|Документ.ЧекККМВозврат.Чтение.Организации
	|Документ.ЧекККМВозврат.Чтение.Склады
	|Документ.ЧекККМВозврат.Изменение.КассыККМ
	|Документ.ЧекККМВозврат.Изменение.Организации
	|Документ.ЧекККМВозврат.Изменение.Склады
	|Документ.ЧекККМКоррекции.Чтение.КассыККМ
	|Документ.ЧекККМКоррекции.Чтение.Организации
	|Документ.ЧекККМКоррекции.Чтение.Склады
	|Документ.ЧекККМКоррекции.Изменение.КассыККМ
	|Документ.ЧекККМКоррекции.Изменение.Организации
	|Документ.ЧекККМКоррекции.Изменение.Склады
	|Документ.ЭлектронноеПисьмоВходящее.Чтение.Объект.Документ.ЭлектронноеПисьмоВходящее
	|Документ.ЭлектронноеПисьмоВходящее.Изменение.Объект.Документ.ЭлектронноеПисьмоВходящее
	|Документ.ЭлектронноеПисьмоИсходящее.Чтение.Объект.Документ.ЭлектронноеПисьмоИсходящее
	|Документ.ЭлектронноеПисьмоИсходящее.Изменение.Объект.Документ.ЭлектронноеПисьмоИсходящее
	|Документ.ЭлектронныйДокументВходящий.Чтение.Организации
	|Документ.ЭлектронныйДокументИсходящий.Чтение.Организации
	|ЖурналДокументов.Взаимодействия.Чтение.Объект.Документ.Встреча
	|ЖурналДокументов.Взаимодействия.Чтение.Объект.Документ.ЗапланированноеВзаимодействие
	|ЖурналДокументов.Взаимодействия.Чтение.Объект.Документ.СообщениеSMS
	|ЖурналДокументов.Взаимодействия.Чтение.Объект.Документ.ТелефонныйЗвонок
	|ЖурналДокументов.Взаимодействия.Чтение.Объект.Документ.ЭлектронноеПисьмоВходящее
	|ЖурналДокументов.Взаимодействия.Чтение.Объект.Документ.ЭлектронноеПисьмоИсходящее
	|ЖурналДокументов.КорректировкиНДС.Чтение.Организации
	|ЖурналДокументов.ОтчетыКомиссионеров.Чтение.ГруппыПартнеров
	|ЖурналДокументов.ОтчетыКомиссионеров.Чтение.Организации
	|ЖурналДокументов.ОтчетыКомиссионеров.Чтение.Подразделения
	|ЖурналДокументов.ОтчетыКомитентам.Чтение.ГруппыПартнеров
	|ЖурналДокументов.ОтчетыКомитентам.Чтение.Организации
	|ЖурналДокументов.ОтчетыКомитентам.Чтение.Подразделения
	|ЖурналДокументов.РегламентныеДокументы.Чтение.Организации
	|ЖурналДокументов.СкладскиеОрдера.Чтение.Склады
	|ЖурналДокументов.СкладскиеОрдераНаИзлишкиНедостачиПорчи.Чтение.Склады
	|ЖурналДокументов.ЧекиККМ.Чтение.КассыККМ
	|ЖурналДокументов.ЧекиККМ.Чтение.Организации
	|ЖурналДокументов.ЧекиККМ.Чтение.Склады
	|ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Чтение.ДополнительныеСведения
	|РегистрСведений.ABCXYZКлассификацияКлиентов.Чтение.ГруппыПартнеров
	|РегистрСведений.ABCXYZКлассификацияКлиентов.Изменение.ГруппыПартнеров
	|РегистрСведений.ABCXYZКлассификацияНоменклатуры.Изменение.ГруппыНоменклатуры
	|РегистрСведений.ВариантыОбеспеченияТоварами.Чтение.Склады
	|РегистрСведений.ВариантыОбеспеченияТоварами.Изменение.Склады
	|РегистрСведений.ГрафикПлатежей.Чтение.Организации
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.Задание
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеЗакупки
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеЗаявкиНаВозвратТоваровОтКлиента
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеПродажи
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеЦенНоменклатуры
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ТиповаяПродажа
	|РегистрСведений.ДанныеОснованийСчетовФактур.Чтение.Организации
	|РегистрСведений.ДанныеПервичныхДокументов.Чтение.Организации
	|РегистрСведений.ДатыПередачиТоваровНаКомиссию.Чтение.Организации
	|РегистрСведений.ДокументыФизическихЛиц.Чтение.ГруппыПартнеров
	|РегистрСведений.ДокументыФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДокументыФизическихЛиц.Изменение.ГруппыПартнеров
	|РегистрСведений.ДокументыФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ДополнительныеСведения.Чтение.ДополнительныеСведения
	|РегистрСведений.ДополнительныеСведения.Изменение.ДополнительныеСведения
	|РегистрСведений.ДоступностьТоваровДляВнешнихПользователей.Чтение.Склады
	|РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений.Чтение.Склады
	|РегистрСведений.ЖурналУчетаСчетовФактур.Чтение.Организации
	|РегистрСведений.ЗаданияКРаспределениюРасчетовСКлиентами.Чтение.ГруппыПартнеров
	|РегистрСведений.ЗаданияКРаспределениюРасчетовСКлиентами.Чтение.Организации
	|РегистрСведений.ЗаданияКРаспределениюРасчетовСПоставщиками.Чтение.ГруппыПартнеров
	|РегистрСведений.ЗаданияКРаспределениюРасчетовСПоставщиками.Чтение.Организации
	|РегистрСведений.ИсточникиПервичногоИнтереса.Чтение.ГруппыПартнеров
	|РегистрСведений.КорзинаПокупателя.Чтение.ВнешниеПользователи
	|РегистрСведений.НастройкаКонтроляОбеспечения.Чтение.Склады
	|РегистрСведений.НастройкаКонтроляОбеспечения.Изменение.Склады
	|РегистрСведений.НастройкаПередачиТоваровМеждуОрганизациями.Чтение.Организации
	|РегистрСведений.НастройкиАдресныхСкладов.Чтение.Склады
	|РегистрСведений.НастройкиАдресныхСкладов.Изменение.Склады
	|РегистрСведений.НастройкиВнутреннегоЭДО.Чтение.Организации
	|РегистрСведений.НастройкиОбменаСУЗ.Чтение.Организации
	|РегистрСведений.НастройкиУчетныхЗаписейЭлектроннойПочты.Чтение.Пользователи
	|РегистрСведений.НастройкиУчетныхЗаписейЭлектроннойПочты.Чтение.УчетныеЗаписиЭлектроннойПочты
	|РегистрСведений.НДССостояниеРеализации0.Чтение.Организации
	|РегистрСведений.НДССостояниеРеализации0.Изменение.Организации
	|РегистрСведений.НеОтправленныеПрикладныеОбъектыEDI.Чтение.ГруппыПартнеров
	|РегистрСведений.НеОтправленныеПрикладныеОбъектыEDI.Чтение.Организации
	|РегистрСведений.ОстаткиНаБанковскихСчетахПоДаннымВыписок.Чтение.Организации
	|РегистрСведений.ОчередьСообщенийИСМП.Чтение.Организации
	|РегистрСведений.ОчередьФормированияКорректировокИзлишковИНедостачПоТоварнымМестам.Чтение.Склады
	|РегистрСведений.ОшибкиРасчетаПартийИСебестоимости.Чтение.Организации
	|РегистрСведений.ОшибочныеРеквизитыКонтрагентов.Чтение.Организации
	|РегистрСведений.ПартнерыСегмента.Чтение.ВнешниеПользователи
	|РегистрСведений.ПартнерыСегмента.Чтение.ГруппыПартнеров
	|РегистрСведений.ПартнерыСегмента.Изменение.ГруппыПартнеров
	|РегистрСведений.ПодтверждениеОплатыНДСВБюджет.Чтение.Организации
	|РегистрСведений.ПодтверждениеОплатыНДСВБюджет.Изменение.Организации
	|РегистрСведений.ПравилаРазмещенияТоваровВЯчейках.Чтение.Склады
	|РегистрСведений.ПравилаРазмещенияТоваровВЯчейках.Изменение.Склады
	|РегистрСведений.ПредметыПапкиВзаимодействий.Изменение.Объект.Документ.Встреча
	|РегистрСведений.ПредметыПапкиВзаимодействий.Изменение.Объект.Документ.ЗапланированноеВзаимодействие
	|РегистрСведений.ПредметыПапкиВзаимодействий.Изменение.Объект.Документ.СообщениеSMS
	|РегистрСведений.ПредметыПапкиВзаимодействий.Изменение.Объект.Документ.ТелефонныйЗвонок
	|РегистрСведений.ПредметыПапкиВзаимодействий.Изменение.Объект.Документ.ЭлектронноеПисьмоВходящее
	|РегистрСведений.ПредметыПапкиВзаимодействий.Изменение.Объект.Документ.ЭлектронноеПисьмоИсходящее
	|РегистрСведений.ПримененияЕНВД.Чтение.Организации
	|РегистрСведений.ПримененияЕНВД.Чтение.Склады
	|РегистрСведений.ПримененияЕНВД.Изменение.Организации
	|РегистрСведений.ПримененияЕНВД.Изменение.Склады
	|РегистрСведений.ПрогнозыРасходаУпаковок.Чтение.Склады
	|РегистрСведений.ПрогнозыРасходаУпаковок.Изменение.Склады
	|РегистрСведений.ПулКодовМаркировкиСУЗ.Чтение.Организации
	|РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.Чтение.Склады
	|РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.Изменение.Склады
	|РегистрСведений.РегистрацииВНалоговомОргане.Чтение.Организации
	|РегистрСведений.РегистрацииВНалоговомОргане.Чтение.Подразделения
	|РегистрСведений.РеестрДокументов.Чтение.ГруппыПартнеров
	|РегистрСведений.РеестрДокументов.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РеестрДокументов.Чтение.Кассы
	|РегистрСведений.РеестрДокументов.Чтение.Организации
	|РегистрСведений.РеестрДокументов.Чтение.Подразделения
	|РегистрСведений.РеестрДокументов.Чтение.Склады
	|РегистрСведений.РеестрДокументов.Чтение.ХозяйственныеОперации
	|РегистрСведений.СвязиМеждуПартнерами.Чтение.ГруппыПартнеров
	|РегистрСведений.СвязиМеждуПартнерами.Изменение.ГруппыПартнеров
	|РегистрСведений.СогласияНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СогласияНаОбработкуПерсональныхДанных.Чтение.Организации
	|РегистрСведений.СоставыГруппПользователей.Чтение.ВнешниеПользователи
	|РегистрСведений.СоставыГруппПользователей.Чтение.Пользователи
	|РегистрСведений.СостоянияБлокировкиВычетаНДСПоСчетамФактурам.Чтение.Организации
	|РегистрСведений.СостоянияВыгрузкиНоменклатуры.Чтение.Организации
	|РегистрСведений.СостоянияВыгрузкиНоменклатуры.Изменение.Организации
	|РегистрСведений.СостоянияДокументовEDI.Чтение.Организации
	|РегистрСведений.СостоянияДокументовEDI.Чтение.ТипыДокументовEDI
	|РегистрСведений.СостоянияИРеквизитыДоставки.Чтение.Склады
	|РегистрСведений.СостоянияЭД.Чтение.Организации
	|РегистрСведений.СтатусОбменовСЯндексКассой.Чтение.Организации
	|РегистрСведений.СтатусОбменовСЯндексКассой.Изменение.Организации
	|РегистрСведений.СтоимостьТоваров.Чтение.Организации
	|РегистрСведений.СубъектыДляСкрытияПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СхемыОбеспечения.Чтение.Склады
	|РегистрСведений.СхемыОбеспечения.Изменение.Склады
	|РегистрСведений.СчетаФактурыКомиссионерамКОформлению.Чтение.ГруппыПартнеров
	|РегистрСведений.СчетаФактурыКомиссионерамКОформлению.Чтение.Организации
	|РегистрСведений.СчетаФактурыКомитентовКРегистрации.Чтение.Организации
	|РегистрСведений.ТоварныеОграничения.Чтение.Склады
	|РегистрСведений.ТоварныеОграничения.Изменение.Склады
	|РегистрСведений.УчетнаяПолитикаОрганизаций.Чтение.Организации
	|РегистрСведений.ФИОФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ФИОФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЦеныНоменклатуры.Чтение.ВидыЦен
	|РегистрСведений.ЦеныНоменклатурыПоставщиков.Чтение.ГруппыПартнеров
	|РегистрСведений.ШтрихкодыНоменклатуры.Изменение.ГруппыНоменклатуры
	|РегистрНакопления.ВыручкаИСебестоимостьПродаж.Чтение.ГруппыПартнеров
	|РегистрНакопления.ВыручкаИСебестоимостьПродаж.Чтение.Организации
	|РегистрНакопления.ВыручкаИСебестоимостьПродаж.Чтение.Подразделения
	|РегистрНакопления.ГрафикОтгрузкиТоваров.Чтение.Склады
	|РегистрНакопления.ГрафикПоступленияТоваров.Чтение.Склады
	|РегистрНакопления.ДвижениеТоваров.Чтение.Склады
	|РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы.Чтение.Кассы
	|РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы.Чтение.КассыККМ
	|РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы.Чтение.Организации
	|РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы.Чтение.Подразделения
	|РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент.Чтение.ГруппыПартнеров
	|РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент.Чтение.Кассы
	|РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент.Чтение.КассыККМ
	|РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент.Чтение.Организации
	|РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент.Чтение.Подразделения
	|РегистрНакопления.ДвиженияДенежныхСредств.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДвиженияДенежныхСредств.Чтение.Кассы
	|РегистрНакопления.ДвиженияДенежныхСредств.Чтение.КассыККМ
	|РегистрНакопления.ДвиженияДенежныхСредств.Чтение.Организации
	|РегистрНакопления.ДвиженияДенежныхСредств.Чтение.Подразделения
	|РегистрНакопления.ДвиженияДоходыРасходыПрочиеАктивыПассивы.Чтение.Организации
	|РегистрНакопления.ДвиженияДоходыРасходыПрочиеАктивыПассивы.Чтение.Подразделения
	|РегистрНакопления.ДвиженияКонтрагентДоходыРасходы.Чтение.ГруппыПартнеров
	|РегистрНакопления.ДвиженияКонтрагентДоходыРасходы.Чтение.Организации
	|РегистрНакопления.ДвиженияКонтрагентДоходыРасходы.Чтение.Подразделения
	|РегистрНакопления.ДвиженияКонтрагентКонтрагент.Чтение.ГруппыПартнеров
	|РегистрНакопления.ДвиженияКонтрагентКонтрагент.Чтение.Организации
	|РегистрНакопления.ДвиженияКонтрагентКонтрагент.Чтение.Подразделения
	|РегистрНакопления.ДвиженияНоменклатураДоходыРасходы.Чтение.Организации
	|РегистрНакопления.ДвиженияНоменклатураНоменклатура.Чтение.Организации
	|РегистрНакопления.ДвиженияСерийТоваров.Чтение.Склады
	|РегистрНакопления.ДенежныеСредстваБезналичные.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваВКассахККМ.Чтение.КассыККМ
	|РегистрНакопления.ДенежныеСредстваВКассахККМ.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваВПути.Чтение.Кассы
	|РегистрНакопления.ДенежныеСредстваВПути.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваКВыплате.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваНаличные.Чтение.Кассы
	|РегистрНакопления.ДенежныеСредстваНаличные.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Чтение.Организации
	|РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН.Чтение.Организации
	|РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4.Чтение.Организации
	|РегистрНакопления.ЗаказыКлиентов.Чтение.ВнешниеПользователи
	|РегистрНакопления.ЗаказыКлиентов.Чтение.ГруппыПартнеров
	|РегистрНакопления.ЗаказыКлиентов.Чтение.Организации
	|РегистрНакопления.ЗаказыКлиентов.Чтение.Склады
	|РегистрНакопления.ЗаказыНаВнутреннееПотребление.Чтение.Организации
	|РегистрНакопления.ЗаказыНаВнутреннееПотребление.Чтение.Подразделения
	|РегистрНакопления.ЗаказыНаВнутреннееПотребление.Чтение.Склады
	|РегистрНакопления.ЗаказыНаПеремещение.Чтение.Организации
	|РегистрНакопления.ЗаказыНаПеремещение.Чтение.Склады
	|РегистрНакопления.ЗаказыНаСборку.Чтение.Организации
	|РегистрНакопления.ЗаказыНаСборку.Чтение.Склады
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.ГруппыПартнеров
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.Организации
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.Склады
	|РегистрНакопления.Закупки.Чтение.ГруппыПартнеров
	|РегистрНакопления.Закупки.Чтение.Организации
	|РегистрНакопления.Закупки.Чтение.Подразделения
	|РегистрНакопления.Закупки.Чтение.Склады
	|РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов.Чтение.ГруппыПартнеров
	|РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов.Чтение.Организации
	|РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов.Чтение.Склады
	|РегистрНакопления.ЛимитыРасходаДенежныхСредств.Чтение.Организации
	|РегистрНакопления.ЛимитыРасходаДенежныхСредств.Чтение.Подразделения
	|РегистрНакопления.МатериалыИРаботыВПроизводстве.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПокупок.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПродаж.Чтение.Организации
	|РегистрНакопления.НДСПредъявленный.Чтение.Организации
	|РегистрНакопления.ОбеспечениеЗаказов.Чтение.Склады
	|РегистрНакопления.ПартииЗатратНаВыпуск.Чтение.Организации
	|РегистрНакопления.ПартииНДСКРаспределению.Чтение.Организации
	|РегистрНакопления.ПартииПроизводственныхЗатрат.Чтение.Организации
	|РегистрНакопления.ПартииПрочихРасходов.Чтение.Организации
	|РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров.Чтение.Организации
	|РегистрНакопления.ПартииТоваровОрганизаций.Чтение.Организации
	|РегистрНакопления.ПартииТоваровПереданныеНаКомиссию.Чтение.Организации
	|РегистрНакопления.ПереданнаяВозвратнаяТара.Чтение.ГруппыПартнеров
	|РегистрНакопления.ПереданнаяВозвратнаяТара.Чтение.Организации
	|РегистрНакопления.ПереданнаяВозвратнаяТара.Чтение.Склады
	|РегистрНакопления.ПринятаяВозвратнаяТара.Чтение.ГруппыПартнеров
	|РегистрНакопления.ПринятаяВозвратнаяТара.Чтение.Организации
	|РегистрНакопления.ПринятаяВозвратнаяТара.Чтение.Склады
	|РегистрНакопления.ПрочиеАктивыПассивы.Чтение.Организации
	|РегистрНакопления.ПрочиеДоходы.Чтение.Организации
	|РегистрНакопления.ПрочиеДоходы.Чтение.Подразделения
	|РегистрНакопления.ПрочиеРасходы.Чтение.Организации
	|РегистрНакопления.ПрочиеРасходы.Чтение.Подразделения
	|РегистрНакопления.РасчетыПоФинансовымИнструментам.Чтение.Организации
	|РегистрНакопления.РасчетыПоЭквайрингу.Чтение.Организации
	|РегистрНакопления.РасчетыПоЭквайрингу.Чтение.ЭквайринговыеТерминалы
	|РегистрНакопления.РасчетыСКлиентами.Чтение.ВнешниеПользователи
	|РегистрНакопления.РасчетыСКлиентами.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСКлиентами.Чтение.Организации
	|РегистрНакопления.РасчетыСКлиентамиПланОплат.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСКлиентамиПланОплат.Чтение.Организации
	|РегистрНакопления.РасчетыСКлиентамиПланОтгрузок.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСКлиентамиПланОтгрузок.Чтение.Организации
	|РегистрНакопления.РасчетыСКлиентамиПоДокументам.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСКлиентамиПоДокументам.Чтение.Организации
	|РегистрНакопления.РасчетыСКлиентамиПоСрокам.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСКлиентамиПоСрокам.Чтение.Организации
	|РегистрНакопления.РасчетыСПоставщиками.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСПоставщиками.Чтение.Организации
	|РегистрНакопления.РасчетыСПоставщикамиПланОплат.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСПоставщикамиПланОплат.Чтение.Организации
	|РегистрНакопления.РасчетыСПоставщикамиПланПоставок.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСПоставщикамиПланПоставок.Чтение.Организации
	|РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Чтение.Организации
	|РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Чтение.Организации
	|РегистрНакопления.РезервыТоваровОрганизаций.Чтение.Организации
	|РегистрНакопления.СвободныеОстатки.Чтение.Склады
	|РегистрНакопления.СебестоимостьТоваров.Чтение.Организации
	|РегистрНакопления.ТМЦВЭксплуатации.Чтение.Организации
	|РегистрНакопления.ТМЦВЭксплуатации.Чтение.Подразделения
	|РегистрНакопления.ТоварныеМестаКОтражениюИзлишковНедостач.Чтение.Склады
	|РегистрНакопления.ТоварыВЯчейках.Чтение.Склады
	|РегистрНакопления.ТоварыКОтгрузке.Чтение.Склады
	|РегистрНакопления.ТоварыКОформлениюИзлишковНедостач.Чтение.Склады
	|РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту.Чтение.ГруппыПартнеров
	|РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту.Чтение.Организации
	|РегистрНакопления.ТоварыКОформлениюТаможенныхДеклараций.Чтение.ГруппыПартнеров
	|РегистрНакопления.ТоварыКОформлениюТаможенныхДеклараций.Чтение.Организации
	|РегистрНакопления.ТоварыКПоступлению.Чтение.Склады
	|РегистрНакопления.ТоварыНаСкладах.Чтение.Склады
	|РегистрНакопления.ТоварыОрганизаций.Чтение.Организации
	|РегистрНакопления.ТоварыОрганизацийКПередаче.Чтение.Организации
	|РегистрНакопления.ТоварыПереданныеНаКомиссию.Чтение.Организации
	|РегистрНакопления.УслугиКОформлениюОтчетовПринципалу.Чтение.ГруппыПартнеров
	|РегистрНакопления.УслугиКОформлениюОтчетовПринципалу.Чтение.Организации
	|РегистрНакопления.ФинансовыеРезультаты.Чтение.Организации
	|РегистрНакопления.ФинансовыеРезультаты.Чтение.Подразделения
	|БизнесПроцесс.Задание.Чтение.Пользователи
	|БизнесПроцесс.Задание.Изменение.Пользователи
	|БизнесПроцесс.СогласованиеЦенНоменклатуры.Изменение.Пользователи
	|БизнесПроцесс.ТиповаяПродажа.Чтение.ГруппыПартнеров
	|БизнесПроцесс.ТиповаяПродажа.Чтение.Пользователи
	|БизнесПроцесс.ТиповаяПродажа.Изменение.ГруппыПартнеров
	|БизнесПроцесс.ТиповаяПродажа.Изменение.Пользователи
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.Задание
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеЗакупки
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеЗаявкиНаВозвратТоваровОтКлиента
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеПродажи
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеЦенНоменклатуры
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ТиповаяПродажа
	|Задача.ЗадачаИсполнителя.Чтение.Пользователи
	|Задача.ЗадачаИсполнителя.Изменение.Пользователи
	|";

КонецПроцедуры

// Позволяет реализовать перезапись зависимых наборов значений доступа других объектов.
//
// Вызывается из процедур
//  УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа,
//  УправлениеДоступомСлужебный.ЗаписатьЗависимыеНаборыЗначенийДоступа.
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - ссылка на объект, для которого записываются наборы значений доступа.
//
//  СсылкиНаЗависимыеОбъекты - Массив - массив элементов типа СправочникСсылка, ДокументСсылка и т. п.
//                 Содержит ссылки на объекты с зависимыми наборами значений доступа.
//                 Начальное значение - пустой массив.
//
Процедура ПриИзмененииНаборовЗначенийДоступа(Ссылка, СсылкиНаЗависимыеОбъекты) Экспорт
	
	//++ НЕ ГОСИС
	УправлениеДоступомУТ.ПриИзмененииНаборовЗначенийДоступа(Ссылка, СсылкиНаЗависимыеОбъекты);
	//-- НЕ ГОСИС
	
КонецПроцедуры

#КонецОбласти