// В процедуре нужно реализовать заполнение параметров формирования текста запроса на основании ссылки на документ.
//
// Параметры:
// 	Параметры
// 	ДокументСсылка
Процедура ЗаполнитьПараметрыФормированияТекстаЗапросаВложенныхШтрихкодов(Параметры, ДокументСсылка) Экспорт
	
	//++ НЕ ГОСИС
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЧекККМ")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
		
		Параметры.ИспользоватьИдентификаторСтроки = Истина;
		Параметры.ИмяПоляАлкогольнаяПродукция     = "НоменклатураЕГАИС";
		
	КонецЕсли;
	//-- НЕ ГОСИС
	
КонецПроцедуры