#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокВыбора = Параметры.СписокВыбора;
	
	Для Каждого ЗначениеВыбора Из СписокВыбора Цикл
		
		ИмяКнопки = XMLСтрока(ЗначениеВыбора.Значение);
		
		КомандаФормы  = Команды.Добавить(ИмяКнопки);
		КомандаФормы.Действие = "ОбработкаВыбораЗначения";
		
		Кнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), Элементы.ГруппаКнопок);
		Кнопка.Заголовок  = ЗначениеВыбора.Значение;
		Кнопка.ВысотаЗаголовка = 2;
		Кнопка.ИмяКоманды = ИмяКнопки;
		Кнопка.Высота     = 3;
		Кнопка.Ширина     = 20;
		
	КонецЦикла
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЗначения(Команда)
	Результат = СписокВыбора.НайтиПоЗначению(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС."+Команда.Имя));
	Закрыть(Результат);
КонецПроцедуры

#КонецОбласти

