////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интеграция с 1С:Документооборотом"
// Модуль ИнтеграцияС1СДокументооборотВызовСервераПереопределяемый: сервер, вызов сервера
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Создает правила интеграции для указанного типа объекта ИС.
//
// Параметры:
//   ИмяТипаОбъекта - Строка, ЛюбаяСсылка - полное имя типа объекта ИС, как в метаданных,
//     или ссылка на объект.
//
// Возвращаемое значение:
//   Массив из СправочникСсылка.ПравилаИнтеграцииС1СДокументооборотом
//
// Пример реализации:
//
//   Если ИмяТипаОбъекта = "Документ.ПоступлениеТоваровУслуг" Тогда
//     // Создаем правила интеграции и добавляем в массив
//     СозданныеПравила = НачатьАвтоматическуюНастройкуИнтеграцииПоступлениеТоваровУслуг();
//   ИначеЕсли ИмяТипаОбъекта = "Документ.ЗаявкаНаРасходованиеДенежныхСредств" Тогда
//     // Создаем правила интеграции и добавляем в массив
//     СозданныеПравила = НачатьАвтоматическуюНастройкуИнтеграцииЗаявкаНаОперацию();
//   КонецЕсли;
//
Функция СоздатьПравилаИнтеграцииАвтоматически(Знач ИмяТипаОбъекта) Экспорт
	
	СозданныеПравила = Новый Массив;
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗНЧ(ИмяТипаОбъекта)) Тогда
		ИмяТипаОбъекта = ИмяТипаОбъекта.Метаданные().ПолноеИмя();
	КонецЕсли;
	
	Возврат СозданныеПравила;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти