#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	УправлениеДоступомИСПереопределяемый.ПриЗаполненииОграниченияДоступа(
		Метаданные.РегистрыСведений.НастройкиОбменаСУЗ, Ограничение);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПроизводственныйОбъектПолучитьСписокВыбора(Организация, ПроизводственныйОбъект = Неопределено) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	
	ТекстЗапросаСписок =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 11
	|	НастройкиОбменаСУЗ.ПроизводственныйОбъект КАК ПроизводственныйОбъект,
	|	ПРЕДСТАВЛЕНИЕ(НастройкиОбменаСУЗ.ПроизводственныйОбъект) КАК Представление,
	|	НастройкиОбменаСУЗ.ПроизводственныйОбъектАдресСтрокой КАК АдресОбъекта
	|ИЗ
	|	РегистрСведений.НастройкиОбменаСУЗ КАК НастройкиОбменаСУЗ
	|ГДЕ
	|	НастройкиОбменаСУЗ.Организация = &Организация
	|	И (НЕ НастройкиОбменаСУЗ.ПроизводственныйОбъект.Ссылка ЕСТЬ NULL
	|	ИЛИ ТИПЗНАЧЕНИЯ(НастройкиОбменаСУЗ.ПроизводственныйОбъект) = ТИП(Строка)
	|	И НастройкиОбменаСУЗ.ПроизводственныйОбъект <> """");";
	
	Если ПроизводственныйОбъект = Неопределено Тогда
		ТекстЗапросаОбъект = "";
	Иначе
		ТекстЗапросаОбъект =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	1 КАК Поле1
		|ИЗ
		|	РегистрСведений.НастройкиОбменаСУЗ КАК НастройкиОбменаСУЗ
		|ГДЕ
		|	НастройкиОбменаСУЗ.Организация = &Организация
		|	И НастройкиОбменаСУЗ.ПроизводственныйОбъект = &ПроизводственныйОбъект";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",            Организация);
	Запрос.УстановитьПараметр("ПроизводственныйОбъект", ПроизводственныйОбъект);
	Запрос.Текст = ТекстЗапросаСписок + ТекстЗапросаОбъект;
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
	
	// Список выбора формируем, если всего имеется не более 10 записей
	Если Выборка.Количество() < 11 Тогда
		Пока Выборка.Следующий() Цикл
			Представление = Выборка.Представление;
			Если ЗначениеЗаполнено(Выборка.АдресОбъекта) Тогда
				Представление = Представление + " (" + Выборка.АдресОбъекта + ")";
			КонецЕсли;
			СписокВыбора.Добавить(Выборка.ПроизводственныйОбъект, Представление);
		КонецЦикла;
	КонецЕсли;
	
	Если ПроизводственныйОбъект <> Неопределено Тогда
		Если РезультатЗапроса[1].Пустой() Тогда
			ПроизводственныйОбъект = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СписокВыбора;
	
КонецФункции

Функция ПолучитьАдресПроизводственногоОбъекта(Организация, ПроизводственныйОбъект) Экспорт
	
	ДанныеАдреса = Новый Структура("ПроизводственныйОбъектАдрес, ПроизводственныйОбъектАдресСтрокой");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",            Организация);
	Запрос.УстановитьПараметр("ПроизводственныйОбъект", ПроизводственныйОбъект);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиОбменаСУЗ.ПроизводственныйОбъектАдрес КАК ПроизводственныйОбъектАдрес,
	|	НастройкиОбменаСУЗ.ПроизводственныйОбъектАдресСтрокой КАК ПроизводственныйОбъектАдресСтрокой
	|ИЗ
	|	РегистрСведений.НастройкиОбменаСУЗ КАК НастройкиОбменаСУЗ
	|ГДЕ
	|	НастройкиОбменаСУЗ.Организация = &Организация
	|	И НастройкиОбменаСУЗ.ПроизводственныйОбъект = &ПроизводственныйОбъект";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеАдреса, Выборка);
	КонецЕсли;
	
	Возврат ДанныеАдреса;
	
КонецФункции

#КонецОбласти

#КонецЕсли