#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("ИдентификаторСоединения");
	МассивНепроверяемыхРеквизитов.Добавить("Токен");
	МассивНепроверяемыхРеквизитов.Добавить("ПроизводственныйОбъект");
	МассивНепроверяемыхРеквизитов.Добавить("ПроизводственныйОбъектАдресСтрокой");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецЕсли
