#Область СлужебныйПрограммныйИнтерфейс

//Предназначена переопределения имени обработки обмена с контрагентами.
//
//Параметры:
//   Имя - Строка - имя обработки в метаданных.
//
Процедура ПриОпределенииИмениОбработкиОбменаПоЭДО(Имя) Экспорт
	
	Возврат;
	
КонецПроцедуры

//Предназначена переопределения имени основной формы обработки обмена с контрагентами.
//
//Параметры:
//   Имя - Строка - имя формы в метаданных.
//
Процедура ПриОпределенииИмениФормыОбработкиОбменаПоЭДО(Имя) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти