#Область СлужебныйПрограммныйИнтерфейс

// См. УчетНДСКлиентСервер.ТипыНалогообложенияСкрывающиеРеквизитыНДС
Процедура ДополнитьТипыНалогообложенияСкрывающиеРеквизитыНДС(Массив) Экспорт
	
	//++ Локализация
	Массив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД"));
	Массив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС"));
	Массив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя"));
	Массив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт"));
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти
