
#Область СлужебныйПрограммныйИнтерфейс

// Определяет соответствие документа типу "Акт о расхождениях после отгрузки",
// результат возвращает через второй параметр.
//
// Параметры:
//  Контекст - ДокументСсылка - Контекст для определения типа документа.
//  ЭтоАктОРасхождениях - Булево - исходящий признак соответствия документа типу "Акт о расхождениях".
Процедура ЭтоАктОРасхождениях(Контекст, ЭтоАктОРасхождениях) Экспорт
	
	//++ НЕ ГОСИС
	Если ИнтеграцияИСУТКлиентСервер.ЭтоДокументПоНаименованию(Контекст, "АктОРасхожденияхПослеОтгрузки") Тогда
		ЭтоАктОРасхождениях = Истина;
	КонецЕсли;
	//-- НЕ ГОСИС
	
КонецПроцедуры

#КонецОбласти