////////////////////////////////////////////////////////////////////////////////
// Модуль "СобытияФормКлиентСерверЛокализация" содержит процедуры и функции, работающие на клиенте и сервер
// для событий формы.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// КлиентСерверная переопределяемая процедура, вызываемая из обработчика события элемента.
//
// Параметры:
//   Форма                   - ФормаКлиентскогоПриложения - форма, из которой происходит вызов процедуры.
//   Элемент                 - Строка           - имя элемента-источника события "При изменении".
//   ДополнительныеПараметры - Структура        - значения дополнительных параметров влияющих на обработку.
//
Процедура ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры = Неопределено) Экспорт
	
	//++ Локализация
	Если Форма.ИмяФормы = "Документ.АктОРасхожденияхПослеОтгрузки.Форма.ФормаДокумента"
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыИнтеграцииГосИС")
		И Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП") <> Неопределено
		И Элемент = "ОформитьДокументы"
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ТребуетсяОбработкаКодовМаркировки")
		И Форма.ТребуетсяОбработкаКодовМаркировки Тогда
			ИнтеграцияИСМПУТКлиентСервер.ДополнитьНадписьСпособаОтраженияРасхождений(
				ТипЗнч(Форма.Объект.Ссылка),
				Форма.Элементы.НадписьРасхождения,
				Форма.Элементы.ОформитьДокументы);
	КонецЕсли;
	//-- Локализация
	Возврат;
	
КонецПроцедуры

#КонецОбласти