#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ОтветыНаЗапросы() Экспорт
	
	Результат = Новый Массив;
	
	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.ВидыОперацийИСМП.ЗначенияПеречисления Цикл 
		Если СтрНачинаетсяС(ЗначениеПеречисления.Имя, "ОтветНаЗапрос") Тогда 
			Результат.Добавить(Перечисления.ВидыОперацийИСМП[ЗначениеПеречисления.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолученныеРезультатыЗапросов() Экспорт
	
	Результат = Новый Массив;
	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.ВидыОперацийИСМП.ЗначенияПеречисления Цикл 
		Если СтрНачинаетсяС(ЗначениеПеречисления.Имя, "Получение") Тогда 
			Результат.Добавить(Перечисления.ВидыОперацийИСМП[ЗначениеПеречисления.Имя]);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли