
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = ОблачныеКлассификаторыКлиент.ПараметрыВызоваФормыОКПД2();
	ПараметрыФормы.ОткрытиеЧерезОбщуюКоманду = Истина;
	ПараметрыФормы.ЗагружатьСИерархией = Истина;

	ОткрытьФорму("Обработка.РаботаСОблачнымиКлассификаторами.Форма.КлассификаторОКПД2", ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти

