
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Сервис доставки".
// ОбщийМодуль.СервисДоставкиПереопределяемый.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ЗаполнениеПараметровОтбора

// Заполняет параметры отбора для формы выбора адреса организации.
//
// Параметры:
//  ПараметрыОтбора - Структура - параметры отбора для формы выбора.
//  Организация     - ОпределяемыйТип.ОрганизацияСервисДоставки - ссылка на организацию.
//
Процедура ЗаполнитьПараметрыОтбораАдресаОрганизации(ПараметрыОтбора, Организация) Экспорт
	
КонецПроцедуры

// Заполняет параметры отбора для формы выбора адреса контрагента.
//
// Параметры:
//  ПараметрыОтбора - Структура - параметры отбора для формы выбора.
//  Контрагент      - ОпределяемыйТип.КонтрагентСервисДоставки - ссылка на контрагента.
//
Процедура ЗаполнитьПараметрыОтбораАдресаКонтрагента(ПараметрыОтбора, Контрагент) Экспорт
	
	ПараметрыОтбора.Вставить("Контрагент", Контрагент);
	
КонецПроцедуры

// Заполняет параметры отбора для формы выбора контактного лица организации.
//
// Параметры:
//  ПараметрыОтбора - Структура - параметры отбора для формы выбора.
//  Организация     - ОпределяемыйТип.ОрганизацияСервисДоставки - ссылка на организацию.
//
Процедура ЗаполнитьПараметрыОтбораКонтактногоЛицаОрганизации(ПараметрыОтбора, Организация) Экспорт
	
КонецПроцедуры

// Заполняет параметры отбора для формы выбора контактного лица контрагента.
//
// Параметры:
//  ПараметрыОтбора - Структура - параметры отбора для формы выбора.
//  Контрагент      - ОпределяемыйТип.КонтрагентСервисДоставки - ссылка на контрагента.
//
Процедура ЗаполнитьПараметрыОтбораКонтактногоЛицаКонтрагента(ПараметрыОтбора, Контрагент) Экспорт
	
	Партнер = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, Новый Структура("Партнер")).Партнер;
	СписокПартнеров = ПартнерыИКонтрагенты.ПолучитьНижестоящихПартнеров(Партнер);
	
	ПараметрыОтбора.Вставить("Владелец", СписокПартнеров);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеПараметровДаннымиИзУчетнойСистемы

// Заполняет параметры заказа на доставку данными из объекта-основания заказа.
//
// Параметры:
//  Параметры - Структура - см. СервисДоставки.НовыйПараметрыЗаказаНаДоставку()
//
Процедура ЗаполнитьПараметрыЗаказаНаДоставку(Параметры) Экспорт
	
	ДокументОснование = Параметры.ДокументОснование;
	
	ТекстЗапроса = "";
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		ТекстЗапроса = ТекстЗапросДляЗаказаНаДостакуПоЗаказуКлиента();
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		ТекстЗапроса = ТекстЗапросДляЗаказаНаДостакуПоРеализациииТоваровУслуг();
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		
		ТекстЗапроса = ТекстЗапросДляЗаказаНаДостакуПоЗаявкеНаВозвратТоваровОтКлиента();
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		ТекстЗапроса = ТекстЗапросДляЗаказаНаДостакуПоЗаказуПоставщику();
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		
		ТекстЗапроса = ТекстЗапросДляЗаказаНаДостакуПоПриобретениюТоваровУслуг();
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		
		ТекстЗапроса = ТекстЗапросДляЗаказаНаДостакуПоВозвратуТоваровПоставщику();
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		
		ТекстЗапроса = ТекстЗапросДляЗаказаНаДостакуПоЗаказуНаПеремещение();
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		
		ТекстЗапроса = ТекстЗапросДляЗаказаНаДостакуПоПеремещениюТоваров();
		
	КонецЕсли;
	
	Если ТекстЗапроса = "" Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() 
	+ "ВЫБРАТЬ
	  |	ШапкаДокумента.ДокументОснование КАК ДокументОснование,
	  |	ШапкаДокумента.ОрганизацияБизнесСетиСсылка КАК ОрганизацияБизнесСетиСсылка,
	  |	ШапкаДокумента.ФормаОплаты КАК ФормаОплаты,
	  |	ШапкаДокумента.ГрузоперевозчикИдентификатор КАК ГрузоперевозчикИдентификатор,
	  |	ШапкаДокумента.ГрузоперевозчикНаименование КАК ГрузоперевозчикНаименование,
	  |	ШапкаДокумента.ГрузоперевозчикТелефон КАК ГрузоперевозчикТелефон,
	  |	ШапкаДокумента.ТарифНаименование КАК ТарифНаименование,
	  |	ШапкаДокумента.ТарифИдентификатор КАК ТарифИдентификатор,
	  |	ШапкаДокумента.ТарифНеГабарит КАК ТарифНеГабарит,
	  |	ШапкаДокумента.ДатаОтгрузки КАК ДатаОтгрузки,
	  |	ШапкаДокумента.ДатаДоставки КАК ДатаДоставки,
	  |	ШапкаДокумента.ВремяОтгрузкиС КАК ВремяОтгрузкиС,
	  |	ШапкаДокумента.ВремяОтгрузкиПо КАК ВремяОтгрузкиПо,
	  |	ШапкаДокумента.ВремяДоставкиС КАК ВремяДоставкиС,
	  |	ШапкаДокумента.ВремяДоставкиПо КАК ВремяДоставкиПо,
	  |	ШапкаДокумента.СпособОтгрузки КАК СпособОтгрузки,
	  |	ШапкаДокумента.СпособДоставки КАК СпособДоставки,
	  |	ШапкаДокумента.ОтправительКонтрагентСсылка КАК ОтправительКонтрагентСсылка,
	  |	ШапкаДокумента.ОтправительКонтрагентИНН КАК ОтправительКонтрагентИНН,
	  |	ШапкаДокумента.ОтправительКонтрагентКПП КАК ОтправительКонтрагентКПП,
	  |	ШапкаДокумента.ОтправительКонтрагентНаименование КАК ОтправительКонтрагентНаименование,
	  |	ШапкаДокумента.ОтправительКонтрагентЮрФизЛицо КАК ОтправительКонтрагентЮрФизЛицо,
	  |	ШапкаДокумента.ОтправительКонтрагентЭтоОрганизация КАК ОтправительКонтрагентЭтоОрганизация,
	  |	ШапкаДокумента.ОтправительКонтрагентЮридическийАдресВладелец КАК ОтправительКонтрагентЮридическийАдресВладелец,
	  |	ШапкаДокумента.ОтправительАдресВладелец КАК ОтправительАдресВладелец,
	  |	ШапкаДокумента.ОтправительАдресВладелецНаименование КАК ОтправительАдресВладелецНаименование,
	  |	ШапкаДокумента.ОтправительАдресПредставление КАК ОтправительАдресПредставление,
	  |	ШапкаДокумента.ОтправительАдресЗначенияПолей КАК ОтправительАдресЗначенияПолей,
	  |	ШапкаДокумента.ОтправительАдресЗначение КАК ОтправительАдресЗначение,
	  |	ШапкаДокумента.ОтправительКонтактноеЛицоСсылка КАК ОтправительКонтактноеЛицоСсылка,
	  |	ШапкаДокумента.ОтправительКонтактноеЛицоНаименование КАК ОтправительКонтактноеЛицоНаименование,
	  |	ШапкаДокумента.ОтправительКонтактноеЛицоТелефонПредставление КАК ОтправительКонтактноеЛицоТелефонПредставление,
	  |	ШапкаДокумента.ОтправительКонтактноеЛицоТелефонЗначение КАК ОтправительКонтактноеЛицоТелефонЗначение,
	  |	ШапкаДокумента.ПолучательКонтрагентСсылка КАК ПолучательКонтрагентСсылка,
	  |	ШапкаДокумента.ПолучательКонтрагентИНН КАК ПолучательКонтрагентИНН,
	  |	ШапкаДокумента.ПолучательКонтрагентКПП КАК ПолучательКонтрагентКПП,
	  |	ШапкаДокумента.ПолучательКонтрагентНаименование КАК ПолучательКонтрагентНаименование,
	  |	ШапкаДокумента.ПолучательКонтрагентЮрФизЛицо КАК ПолучательКонтрагентЮрФизЛицо,
	  |	ШапкаДокумента.ПолучательКонтрагентЭтоОрганизация КАК ПолучательКонтрагентЭтоОрганизация,
	  |	ШапкаДокумента.ПолучательКонтрагентЮридическийАдресВладелец КАК ПолучательКонтрагентЮридическийАдресВладелец,
	  |	ШапкаДокумента.ПолучательАдресВладелец КАК ПолучательАдресВладелец,
	  |	ШапкаДокумента.ПолучательАдресВладелецНаименование КАК ПолучательАдресВладелецНаименование,
	  |	ШапкаДокумента.ПолучательАдресПредставление КАК ПолучательАдресПредставление,
	  |	ШапкаДокумента.ПолучательАдресЗначенияПолей КАК ПолучательАдресЗначенияПолей,
	  |	ШапкаДокумента.ПолучательАдресЗначение КАК ПолучательАдресЗначение,
	  |	ШапкаДокумента.ПолучательКонтактноеЛицоСсылка КАК ПолучательКонтактноеЛицоСсылка,
	  |	ШапкаДокумента.ПолучательКонтактноеЛицоНаименование КАК ПолучательКонтактноеЛицоНаименование,
	  |	ШапкаДокумента.ПолучательКонтактноеЛицоТелефонПредставление КАК ПолучательКонтактноеЛицоТелефонПредставление,
	  |	ШапкаДокумента.ПолучательКонтактноеЛицоТелефонЗначение КАК ПолучательКонтактноеЛицоТелефонЗначение,
	  |	ШапкаДокумента.ПлательщикКонтрагентСсылка КАК ПлательщикКонтрагентСсылка,
	  |	ШапкаДокумента.ПлательщикКонтрагентИНН КАК ПлательщикКонтрагентИНН,
	  |	ШапкаДокумента.ПлательщикКонтрагентКПП КАК ПлательщикКонтрагентКПП,
	  |	ШапкаДокумента.ПлательщикКонтрагентНаименование КАК ПлательщикКонтрагентНаименование,
	  |	ШапкаДокумента.ПлательщикКонтрагентЮрФизЛицо КАК ПлательщикКонтрагентЮрФизЛицо,
	  |	ШапкаДокумента.ПлательщикКонтрагентЭтоОрганизация КАК ПлательщикКонтрагентЭтоОрганизация,
	  |	ШапкаДокумента.ПлательщикКонтрагентЮридическийАдресВладелец КАК ПлательщикКонтрагентЮридическийАдресВладелец,
	  |	ШапкаДокумента.ПлательщикКонтактноеЛицоСсылка КАК ПлательщикКонтактноеЛицоСсылка,
	  |	ШапкаДокумента.ПлательщикКонтактноеЛицоНаименование КАК ПлательщикКонтактноеЛицоНаименование,
	  |	ШапкаДокумента.ПлательщикКонтактноеЛицоТелефонПредставление КАК ПлательщикКонтактноеЛицоТелефонПредставление,
	  |	ШапкаДокумента.ПлательщикКонтактноеЛицоТелефонЗначение КАК ПлательщикКонтактноеЛицоТелефонЗначение,
	  |	ШапкаДокумента.ПлательщикРоль КАК ПлательщикРоль,
	  |	ШапкаДокумента.ВалютаКоэффициент КАК ВалютаКоэффициент
	  |ИЗ
	  |	ШапкаДокумента КАК ШапкаДокумента
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	  |	ТаблицаТовары.Упаковка КАК Упаковка,
	  |	ТаблицаТовары.Количество КАК Количество,
	  |	ТаблицаТовары.ВидНоменклатуры КАК ВидНоменклатуры,
	  |	ТаблицаТовары.Сумма * ШапкаДокумента.ВалютаКоэффициент КАК Сумма,
	  |	ТаблицаТовары.Цена * ШапкаДокумента.ВалютаКоэффициент КАК Цена
	  |ПОМЕСТИТЬ ВременнаяТаблицаТовары
	  |ИЗ
	  |	ШапкаДокумента КАК ШапкаДокумента
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК ТаблицаТовары
	  |		ПО (ТаблицаТовары.Ссылка = ШапкаДокумента.ДокументОснование)
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	СправочникНоменклатура.Наименование КАК Наименование,
	  |	УпаковкиЕдиницыИзмерения.Наименование КАК ЕдиницаИзмерения,
	  |	Товары.Количество КАК Количество,
	  |	Товары.Цена КАК Цена,
	  |	Товары.Сумма КАК Сумма,
	  |	Товары.Упаковка КАК Упаковка,
	  |	&ТекстЗапросаВесУпаковки КАК Вес,
	  |	&ТекстЗапросаОбъемУпаковки КАК Объем,
	  |	ВЫБОР
	  |		КОГДА УпаковкиЕдиницыИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	  |				И ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.Знаменатель, 0) <> 0
	  |			ТОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) * (ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.Числитель, 0) / ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.Знаменатель, 1)) КАК ЧИСЛО(15, 7))) * 100
	  |		ИНАЧЕ 0
	  |	КОНЕЦ КАК Высота,
	  |	ВЫБОР
	  |		КОГДА УпаковкиЕдиницыИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	  |				И ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.Знаменатель, 0) <> 0
	  |			ТОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) * (ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.Числитель, 0) / ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.Знаменатель, 1)) КАК ЧИСЛО(15, 7))) * 100
	  |		ИНАЧЕ 0
	  |	КОНЕЦ КАК Ширина,
	  |	ВЫБОР
	  |		КОГДА &ТекстЗапросаДлинаУпаковки <> 0
	  |			ТОГДА &ТекстЗапросаДлинаУпаковки
	  |		КОГДА УпаковкиЕдиницыИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	  |				И ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.Знаменатель, 0) <> 0
	  |			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) * (ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.Числитель, 0) / ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.Знаменатель, 1)) КАК ЧИСЛО(15, 7))
	  |		ИНАЧЕ 0
	  |	КОНЕЦ * 100 КАК Длина,
	  |	ВЫБОР
	  |		КОГДА СправочникВидыНоменклатуры.ИспользоватьИндивидуальноеНаименованиеПриПечати
	  |			ТОГДА ЕСТЬNULL(СправочникВидыНоменклатуры.НаименованиеДляПечати, """")
	  |		КОГДА &НаименованиеДляПечатиВидовНоменклатуры <> """"
	  |			ТОГДА &НаименованиеДляПечатиВидовНоменклатуры
	  |		ИНАЧЕ СправочникВидыНоменклатуры.Наименование
	  |	КОНЕЦ КАК НаименованиеДляПечати
	  |ПОМЕСТИТЬ Товары
	  |ИЗ
	  |	ВременнаяТаблицаТовары КАК Товары
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК СправочникВидыНоменклатуры
	  |		ПО Товары.ВидНоменклатуры = СправочникВидыНоменклатуры.Ссылка
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	  |		ПО Товары.Номенклатура = СправочникНоменклатура.Ссылка
	  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	  |		ПО (ВЫБОР
	  |				КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	  |					ТОГДА СправочникНоменклатура.ЕдиницаИзмерения = УпаковкиЕдиницыИзмерения.Ссылка
	  |				ИНАЧЕ Товары.Упаковка = УпаковкиЕдиницыИзмерения.Ссылка
	  |			КОНЕЦ)
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	Товары.НаименованиеДляПечати КАК ТоварНаименование,
	  |	СУММА(Товары.Количество * Товары.Вес) КАК Вес,
	  |	СУММА(Товары.Количество * Товары.Объем) КАК Объем,
	  |	СУММА(Товары.Сумма) КАК Сумма
	  |ИЗ
	  |	Товары КАК Товары
	  |
	  |СГРУППИРОВАТЬ ПО
	  |	Товары.НаименованиеДляПечати";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВесУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("УпаковкиЕдиницыИзмерения", "СправочникНоменклатура", Ложь));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаОбъемУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки("УпаковкиЕдиницыИзмерения", "СправочникНоменклатура", Ложь));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаДлинаУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаДлинаУпаковки("УпаковкиЕдиницыИзмерения", "СправочникНоменклатура", Ложь));
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДатаСеанса()));
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос.УстановитьПараметр("НаименованиеДляПечатиВидовНоменклатуры", Константы.НаименованиеДляПечатиВидовНоменклатуры.Получить());
	Результаты = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	РезультатПоШапке = Результаты[2];
	
	Если РезультатПоШапке.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПоДокументу = РезультатПоШапке.Выгрузить();
	ДанныеПоДокументу = ТаблицаПоДокументу[0];
	
	СервисДоставкиКлиентСервер.ЗаполнитьСтруктуруПоЛинейнымДанным(Параметры, ДанныеПоДокументу, ТаблицаПоДокументу.Колонки);
	
	Параметры.Вставить("ОрганизацияБизнесСетиСсылка", ДанныеПоДокументу.ОрганизацияБизнесСетиСсылка);
	
	//Заполним значения адресов
	СервисДоставки.ЗаполнитьАдресПоПараметрам(Параметры.Отправитель.Адрес);
	СервисДоставки.ЗаполнитьАдресПоПараметрам(Параметры.Получатель.Адрес);
	СервисДоставки.ЗаполнитьАдресПоПараметрам(Параметры.Отправитель.Контрагент.ЮридическийАдрес);
	СервисДоставки.ЗаполнитьАдресПоПараметрам(Параметры.Получатель.Контрагент.ЮридическийАдрес);
	
	//Заполним телефоны контактных лиц
	ЗаполнитьТелефонКонтактногоЛица(Параметры.Отправитель.КонтактноеЛицо);
	ЗаполнитьТелефонКонтактногоЛица(Параметры.Получатель.КонтактноеЛицо);
	
	//Заполним параметры грузовых мест
	Параметры.Груз.КоличествоГрузовыхМест = 1;
	Параметры.Груз.Вес = 0;
	Параметры.Груз.Объем = 0;
	Параметры.Груз.Стоимость = 0;
	Параметры.Груз.Содержимое = "";
	
	РезультатПоТаблицеТовары = Результаты[5];
	
	// Заполним параметры грузовых мест
	
	Если Не РезультатПоТаблицеТовары.Пустой() Тогда
		
		ВыборкаПоТоварам = РезультатПоТаблицеТовары.Выбрать();
		
		Пока ВыборкаПоТоварам.Следующий() Цикл
			Параметры.Груз.Стоимость = Параметры.Груз.Стоимость + ВыборкаПоТоварам.Сумма;
			Параметры.Груз.Вес = Параметры.Груз.Вес + ВыборкаПоТоварам.Вес;
			Параметры.Груз.Объем = Параметры.Груз.Объем + ВыборкаПоТоварам.Объем;
			Если ЗначениеЗаполнено(СокрЛП(ВыборкаПоТоварам.ТоварНаименование)) Тогда 
				Параметры.Груз.Содержимое = Параметры.Груз.Содержимое + ?(Параметры.Груз.Содержимое <> "", ", ", "") + ВыборкаПоТоварам.ТоварНаименование;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	РезультатПоТоварнымПозициям = Запрос.МенеджерВременныхТаблиц.Таблицы[3].ПолучитьДанные();
	
	Если Не РезультатПоТоварнымПозициям.Пустой() Тогда
		
		ВыборкаПоПозиции = РезультатПоТоварнымПозициям.Выбрать();
		
		Пока ВыборкаПоПозиции.Следующий() Цикл
			
			НоваяСтрокаПозиции = Параметры.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПозиции, ВыборкаПоПозиции);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет параметры контрагента данными по ссылке, указанной в Параметры.
//
// Параметры:
//  Параметры - Структура - см. СервисДоставки.ПараметрыКонтрагента()
//
Процедура ЗаполнитьПараметрыКонтрагента(Параметры) Экспорт
	
	ИмяСправочника = Неопределено;
	ВидЮридическогоАдреса = Неопределено;
	Если ТипЗнч(Параметры.Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		ИмяСправочника = "Организации";
		ИмяРеквизитаНаименование = "НаименованиеСокращенное";
		ЭтоОрганизация = Истина;
	ИначеЕСли ТипЗнч(Параметры.Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		ИмяСправочника = "Контрагенты";
		ИмяРеквизитаНаименование = "НаименованиеПолное";
		ЭтоОрганизация = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ОсновнаяТаблица.Ссылка КАК Ссылка,
	               |	ОсновнаяТаблица.ИНН КАК ИНН,
	               |	ОсновнаяТаблица.КПП КАК КПП,
	               |	ОсновнаяТаблица.Наименование КАК Наименование,
	               |	ВЫБОР
	               |		КОГДА ОсновнаяТаблица.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ОсновнаяТаблица.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ОсновнаяТаблица.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЮрФизЛицо
	               |ИЗ
	               |	&ТаблицаДляЗапроса КАК ОсновнаяТаблица
	               |ГДЕ
	               |	ОсновнаяТаблица.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Параметры.Ссылка);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаДляЗапроса", "Справочник." + ИмяСправочника);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ОсновнаяТаблица.Наименование", "ОсновнаяТаблица." + ИмяРеквизитаНаименование);
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(Параметры, РезультатЗапроса.Выгрузить()[0]);
		
		Если Параметры.ЮрФизЛицо <> 2 Тогда
			
			Параметры.ЮридическийАдрес.Владелец = Параметры.Ссылка;
			СервисДоставкиСлужебный.ЗаполнитьАдресПоПараметрам(Параметры.ЮридическийАдрес);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет параметры контактного лица данными по ссылке, указанной в Параметры.
//
// Параметры:
//  Параметры - Структура - см. СервисДоставки.НовыйПараметрыКонтрагента()
//
Процедура ЗаполнитьПараметрыКонтактногоЛица(Параметры) Экспорт
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Ссылка, "Наименование");
	Параметры.Наименование = ЗначенияРеквизитов.Наименование;
	ЗаполнитьТелефонКонтактногоЛица(Параметры);
	
КонецПроцедуры

// Заполняет параметры телефона контактной информацией по владельцу, указанному в Параметры.
//
// Параметры:
//  Параметры - Структура - см. СервисДоставки.НовыйПараметрыКонтактногоЛица().
//
Процедура ЗаполнитьТелефонКонтактногоЛица(Параметры) Экспорт
	
	ВидКонтактнойИнформации = Неопределено;
	Если ТипЗнч(Параметры.Ссылка) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица;
	ИначеЕСли ТипЗнч(Параметры.Ссылка) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
	КонецЕсли;
	
	Если ВидКонтактнойИнформации <> Неопределено Тогда
		КонтактнаяИнформацияТаблица = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Параметры.Ссылка, 
																								ВидКонтактнойИнформации,
																		,
																		Ложь);
		Если КонтактнаяИнформацияТаблица.Количество() Тогда
			КонтактнаяИнформация = КонтактнаяИнформацияТаблица[0];
			Параметры.Телефон.Представление = КонтактнаяИнформация.Представление;
			Параметры.Телефон.Значение = КонтактнаяИнформация.Значение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет параметры валюты.
//
// Параметры:
//  Параметры - Структура - см. СервисДоставки.НовыйПараметрыВалюты().
//
Процедура ЗаполнитьПараметрыВалюты(Параметры) Экспорт
	
	Если (Не Параметры.Свойство("Код"))
		ИЛИ (Не ЗначениеЗаполнено(Параметры.Код)) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("Ссылка", Справочники.Валюты.НайтиПоКоду(Параметры.Код));
	
	Если ЗначениеЗаполнено(Параметры.Ссылка) Тогда
		Параметры.Вставить("Наименование", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Ссылка, "Наименование"));
	Иначе
		Параметры.Вставить("Наименование", "RUB");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВидыКонтактнойИнформации

// Получает вид контактной информации для адреса по переданному владельцу.
//
// Параметры:
//  Владелец  - СправочникСсылка, ОбъектСсылка - владелец адреса.
//  ВидКонтактнойИнформации - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации.
//  ТипАдреса - Строка - тип адреса, доступны: АдресДоставки, Юридический, Фактический.
//
Процедура ПолучитьЗначениеВидаКонтактнойИнформацииДляАдресаПоВладельцу(Владелец, ВидКонтактнойИнформации, ТипАдреса = "АдресДоставки") Экспорт
	
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.Склады") Тогда
		ПолучитьЗначениеВидаКонтактнойИнформацииДляАдресаДоставкиСкладаОрганизации(ВидКонтактнойИнформации);
	ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.Организации") Тогда
		ПолучитьЗначениеВидаКонтактнойИнформацииДляЮридическогоАдресаОрганизации(ВидКонтактнойИнформации);
	ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.Партнеры") 
		И ТипАдреса = "АдресДоставки" Тогда
		ПолучитьЗначениеВидаКонтактнойИнформацииДляАдресаДоставкиСкладаКонтрагента(ВидКонтактнойИнформации);
	ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.Контрагенты") 
		И ТипАдреса = "Юридический" Тогда
		ПолучитьЗначениеВидаКонтактнойИнформацииДляЮридическогоАдресаКонтрагента(ВидКонтактнойИнформации);
	КонецЕсли;
	
КонецПроцедуры

// Получает вид контактной информации для адреса доставки организации.
//
// Параметры:
//  ВидКонтактнойИнформации - СправочникСсылка.ВидыКонтактнойИнформации,Неопределено - вид контактной информации.
//
Процедура ПолучитьЗначениеВидаКонтактнойИнформацииДляАдресаДоставкиСкладаОрганизации(ВидКонтактнойИнформации) Экспорт
	
	ВидКонтактнойИнформации = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресСклада");
	
КонецПроцедуры

// Получает вид контактной информации для юридического адреса организации.
//
// Параметры:
//  ВидКонтактнойИнформации - СправочникСсылка.ВидыКонтактнойИнформации,Неопределено - вид контактной информации.
//
Процедура ПолучитьЗначениеВидаКонтактнойИнформацииДляЮридическогоАдресаОрганизации(ВидКонтактнойИнформации) Экспорт
	
	ВидКонтактнойИнформации = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации");
	
КонецПроцедуры

// Получает вид контактной информации для адреса доставки контрагента.
//
// Параметры:
//  ВидКонтактнойИнформации - СправочникСсылка.ВидыКонтактнойИнформации,Неопределено - вид контактной информации.
//
Процедура ПолучитьЗначениеВидаКонтактнойИнформацииДляАдресаДоставкиСкладаКонтрагента(ВидКонтактнойИнформации) Экспорт
	
	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Адрес доставки");
	
	Если Не ЗначениеЗаполнено(ВидКонтактнойИнформации) Тогда
		ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
	КонецЕсли;
	
КонецПроцедуры

// Получает вид контактной информации для юридического адреса доставки.
//
// Параметры:
//  ВидКонтактнойИнформации - СправочникСсылка.ВидыКонтактнойИнформации,Неопределено - вид контактной информации.
//
Процедура ПолучитьЗначениеВидаКонтактнойИнформацииДляЮридическогоАдресаКонтрагента(ВидКонтактнойИнформации) Экспорт
	
	ВидКонтактнойИнформации = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента");
	
КонецПроцедуры

// Получает вид контактной информации для телефона контактного лица контрагента.
//
// Параметры:
//  ВидКонтактнойИнформации - СправочникСсылка.ВидыКонтактнойИнформации,Неопределено - вид контактной информации.
//
Процедура ПолучитьЗначениеВидаКонтактнойИнформацииДляТелефонаКонтактногоЛицаКонтрагента(ВидКонтактнойИнформации) Экспорт
	
	ВидКонтактнойИнформации = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица");
	
КонецПроцедуры

// Получает вид контактной информации для телефона контактного лица организации.
//
// Параметры:
//  ВидКонтактнойИнформации - СправочникСсылка.ВидыКонтактнойИнформации,Неопределено - вид контактной информации.
//
Процедура ПолучитьЗначениеВидаКонтактнойИнформацииДляТелефонаКонтактногоЛицаОрганизации(ВидКонтактнойИнформации) Экспорт
	
	ВидКонтактнойИнформации = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица");
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

// Получение доступности функционала доставки в прикладном решении.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма панели настроек, в которой необходимо установить доступность.
//
Процедура УстановитьДоступностьНастройкиСервисаДоставки(Форма) Экспорт
	
	ИспользоватьУправлениеДоставкой = Константы["ИспользоватьУправлениеДоставкой"].Получить();
	ЭтоПолнаяВерсия = Не СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации();
	
	Элементы = Форма.Элементы;
	
	Если ЭтоПолнаяВерсия 
		И Не ИспользоватьУправлениеДоставкой Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"Константа_ИспользоватьСервис1СДоставка", "Доступность", Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"Константа_ИспользоватьСервис1СКурьер", "Доступность", Ложь);
		
		ТекстЗаголовка = НСтр("ru='Невозможно включение интеграции с сервисами, потому что отключена работа с доставкой. 
									|Включить работу с доставкой можно в разделе ""Склад и доставка""'");
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"КомментарийИспользоватьСервис1СДоставка", "Заголовок", ТекстЗаголовка);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаКомментарийИспользоватьСервис1СДоставка", "Видимость", ЭтоПолнаяВерсия И Не ИспользоватьУправлениеДоставкой);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаНастройкиБизнесСетьСервисДоставки", "Видимость", ЭтоПолнаяВерсия);
	
КонецПроцедуры

// Добавление команды поиска торговых предложений в формах.
//
// Параметры:
//  КомандыСозданияНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании.
//
Процедура ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Использование", Метаданные.Обработки.СервисДоставки) Тогда
		
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "СервисДоставкиКлиентПереопределяемый.ЗаказНаДоставкуСоздатьНаОсновании";
		КомандаСоздатьНаОсновании.Идентификатор = "СоздатьНовыйЗаказНаДоставку";
		КомандаСоздатьНаОсновании.Представление = НСтр("ru='Заказ на доставку в 1С:Доставка'");
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьСервис1СДоставка";
		
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "СервисДоставкиКлиентПереопределяемый.ЗаказНаДоставкуСоздатьНаОсновании";
		КомандаСоздатьНаОсновании.Идентификатор = "СоздатьНовыйЗаказНаКурьерскуюДоставку";
		КомандаСоздатьНаОсновании.Представление = НСтр("ru='Заказ на доставку в 1С:Курьер'");
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьСервис1СКурьер";
		
	КонецЕсли;
	
КонецПроцедуры

// Обработка создания библиотечной формы.
//
// Параметры:
//  Форма - УправляемаяФорма - создаваемая форма;
//  Отказ - Булево - флаг отказа от создания формы;
//  СтандартнаяОбработка - Булево - флаг стандартной обработки формы.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

// Заполняет шаблон формы оплаты для параметров заказа на доставку.
// Например, когда Форма оплаты определена перечислением "ФормыОплаты":
//    Если ФормаОплаты = Перечисления.ФормыОплаты.Наличная Тогда
//      СвойстваФормыОплаты.Вставить("ФормаОплаты", 2);
//      СвойстваФормыОплаты.Вставить("ФормаОплатыПредставление", НСтр("ru='Наличная'"));
//    Иначе
//      СвойстваФормыОплаты.Вставить("ФормаОплаты", 1);
//      СвойстваФормыОплаты.Вставить("ФормаОплатыПредставление", НСтр("ru='Безналичная'"));
//    КонецЕсли;
//
// Параметры:
//  ФормаОплаты - ОпределяемыйТип.ФормаОплатыСервисДоставки - форма оплаты заказа на доставку;
//  СвойстваФормыОплаты - Структура - содержит:
//    ФормаОплаты - Число - 1 - безналичная, 2 - наличная, по умолчанию 2;
//    ФормаОплатыПредставление - Строка - "Безналичная", "Наличная", по умолчанию "Наличная".
//
Процедура ОпределитьПараметрыЗаказаФормаОплаты(ФормаОплаты, СвойстваФормыОплаты) Экспорт
	
КонецПроцедуры

// Определяет можно ли использовать сервис доставки в текущей конфигурации.
//
// Параметры:
//  Результат - Булево - Признак возможности использовать сервис доставки.
//
Процедура ПроверитьДоступностьСервисаДоставки(Результат) Экспорт
	
	Результат = Результат И (Не ПолучитьФункциональнуюОпцию("БазоваяВерсия"));
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросДляЗаказаНаДостакуПоЗаказуКлиента()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ШапкаДокумента.Ссылка КАК ДокументОснование,
	               |	ОрганизацииБизнесСеть.Организация КАК ОрганизацияБизнесСетиСсылка,
	               |	1 КАК ФормаОплаты,
	               |	"""" КАК ГрузоперевозчикИдентификатор,
	               |	"""" КАК ГрузоперевозчикНаименование,
	               |	"""" КАК ГрузоперевозчикТелефон,
	               |	"""" КАК ТарифНаименование,
	               |	"""" КАК ТарифИдентификатор,
	               |	"""" КАК ТарифНеГабарит,
	               |	ШапкаДокумента.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДоставки,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиС
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяОтгрузкиС,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиПо
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяОтгрузкиПо,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиС
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяДоставкиС,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиПо
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяДоставкиПо,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СпособОтгрузки,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СпособДоставки,
	               |	ШапкаДокумента.Организация КАК ОтправительКонтрагентСсылка,
	               |	ШапкаДокумента.Организация.ИНН КАК ОтправительКонтрагентИНН,
	               |	ШапкаДокумента.Организация.КПП КАК ОтправительКонтрагентКПП,
	               |	ШапкаДокумента.Организация.НаименованиеСокращенное КАК ОтправительКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОтправительКонтрагентЮрФизЛицо,
	               |	ИСТИНА КАК ОтправительКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Организация КАК ОтправительКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Склад КАК ОтправительАдресВладелец,
	               |	ШапкаДокумента.Склад.Наименование КАК ОтправительАдресВладелецНаименование,
	               |	"""" КАК ОтправительАдресПредставление,
	               |	"""" КАК ОтправительАдресЗначенияПолей,
	               |	"""" КАК ОтправительАдресЗначение,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо КАК ОтправительКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо.Наименование КАК ОтправительКонтактноеЛицоНаименование,
	               |	"""" КАК ОтправительКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ОтправительКонтактноеЛицоТелефонЗначение,
	               |	ШапкаДокумента.Контрагент КАК ПолучательКонтрагентСсылка,
	               |	ШапкаДокумента.Контрагент.ИНН КАК ПолучательКонтрагентИНН,
	               |	ШапкаДокумента.Контрагент.КПП КАК ПолучательКонтрагентКПП,
	               |	ШапкаДокумента.Контрагент.НаименованиеПолное КАК ПолучательКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПолучательКонтрагентЮрФизЛицо,
	               |	ЛОЖЬ КАК ПолучательКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Контрагент КАК ПолучательКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Партнер КАК ПолучательАдресВладелец,
	               |	ШапкаДокумента.Партнер.Наименование КАК ПолучательАдресВладелецНаименование,
	               |	ШапкаДокумента.АдресДоставки КАК ПолучательАдресПредставление,
	               |	ШапкаДокумента.АдресДоставкиЗначенияПолей КАК ПолучательАдресЗначенияПолей,
	               |	"""" КАК ПолучательАдресЗначение,
	               |	ШапкаДокумента.КонтактноеЛицо КАК ПолучательКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.КонтактноеЛицо.Наименование КАК ПолучательКонтактноеЛицоНаименование,
	               |	"""" КАК ПолучательКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ПолучательКонтактноеЛицоТелефонЗначение,
	               |	ШапкаДокумента.Организация КАК ПлательщикКонтрагентСсылка,
	               |	ШапкаДокумента.Организация.ИНН КАК ПлательщикКонтрагентИНН,
	               |	ШапкаДокумента.Организация.КПП КАК ПлательщикКонтрагентКПП,
	               |	ШапкаДокумента.Организация.НаименованиеСокращенное КАК ПлательщикКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПлательщикКонтрагентЮрФизЛицо,
	               |	ИСТИНА КАК ПлательщикКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Организация КАК ПлательщикКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо КАК ПлательщикКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо.Наименование КАК ПлательщикКонтактноеЛицоНаименование,
	               |	"""" КАК ПлательщикКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ПлательщикКонтактноеЛицоТелефонЗначение,
	               |	1 КАК ПлательщикРоль,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(КурсыВалюты.Кратность, 0) > 0
	               |				И ЕСТЬNULL(КурсыВалюты.Курс, 0) > 0
	               |			ТОГДА КурсыВалюты.Курс / КурсыВалюты.Кратность
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ВалютаКоэффициент
	               |ПОМЕСТИТЬ ШапкаДокумента
	               |ИЗ
	               |	Документ.ЗаказКлиента КАК ШапкаДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть
	               |		ПО ШапкаДокумента.Организация = ОрганизацииБизнесСеть.Организация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалюты
	               |		ПО ШапкаДокумента.Валюта = КурсыВалюты.Валюта
	               |ГДЕ
	               |	ШапкаДокумента.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТовары.Ссылка КАК Ссылка,
	               |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	СправочникНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ТаблицаТовары.Упаковка КАК Упаковка,
	               |	ТаблицаТовары.КоличествоУпаковок КАК Количество,
	               |	ТаблицаТовары.СуммаСНДС КАК Сумма,
	               |	ТаблицаТовары.Цена КАК Цена
	               |ПОМЕСТИТЬ ТаблицаТовары
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ТаблицаТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО ТаблицаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	               |ГДЕ
	               |	ТаблицаТовары.Ссылка = &Ссылка
	               |	И НЕ СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	               |	И НЕ ТаблицаТовары.Отменено";
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросДляЗаказаНаДостакуПоЗаказуПоставщику()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ШапкаДокумента.Ссылка КАК ДокументОснование,
	               |	ОрганизацииБизнесСеть.Организация КАК ОрганизацияБизнесСетиСсылка,
	               |	1 КАК ФормаОплаты,
	               |	"""" КАК ГрузоперевозчикИдентификатор,
	               |	"""" КАК ГрузоперевозчикНаименование,
	               |	"""" КАК ГрузоперевозчикТелефон,
	               |	"""" КАК ТарифНаименование,
	               |	"""" КАК ТарифИдентификатор,
	               |	"""" КАК ТарифНеГабарит,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузки,
	               |	ШапкаДокумента.ДатаПоступления КАК ДатаДоставки,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиС
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяОтгрузкиС,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиПо
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяОтгрузкиПо,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиС
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяДоставкиС,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиПо
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяДоставкиПо,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПоставщикаДоНашегоСклада)
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СпособОтгрузки,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПоставщикаДоНашегоСклада)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СпособДоставки,
	               |	ШапкаДокумента.Контрагент КАК ОтправительКонтрагентСсылка,
	               |	ШапкаДокумента.Контрагент.ИНН КАК ОтправительКонтрагентИНН,
	               |	ШапкаДокумента.Контрагент.КПП КАК ОтправительКонтрагентКПП,
	               |	ШапкаДокумента.Контрагент.НаименованиеПолное КАК ОтправительКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОтправительКонтрагентЮрФизЛицо,
	               |	ЛОЖЬ КАК ОтправительКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Контрагент КАК ОтправительКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Партнер КАК ОтправительАдресВладелец,
	               |	ШапкаДокумента.Партнер.Наименование КАК ОтправительАдресВладелецНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.АдресДоставки
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ОтправительАдресПредставление,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.АдресДоставкиЗначенияПолей
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ОтправительАдресЗначенияПолей,
	               |	"""" КАК ОтправительАдресЗначение,
	               |	ШапкаДокумента.КонтактноеЛицо КАК ОтправительКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.КонтактноеЛицо.Наименование КАК ОтправительКонтактноеЛицоНаименование,
	               |	"""" КАК ОтправительКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ОтправительКонтактноеЛицоТелефонЗначение,
	               |	ШапкаДокумента.Организация КАК ПолучательКонтрагентСсылка,
	               |	ШапкаДокумента.Организация.ИНН КАК ПолучательКонтрагентИНН,
	               |	ШапкаДокумента.Организация.КПП КАК ПолучательКонтрагентКПП,
	               |	ШапкаДокумента.Организация.НаименованиеСокращенное КАК ПолучательКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПолучательКонтрагентЮрФизЛицо,
	               |	ИСТИНА КАК ПолучательКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Организация КАК ПолучательКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Склад КАК ПолучательАдресВладелец,
	               |	ШапкаДокумента.Склад.Наименование КАК ПолучательАдресВладелецНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.АдресДоставкиДляПоставщика
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ПолучательАдресПредставление,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.АдресДоставкиЗначенияПолей
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ПолучательАдресЗначенияПолей,
	               |	"""" КАК ПолучательАдресЗначение,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо КАК ПолучательКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо.Наименование КАК ПолучательКонтактноеЛицоНаименование,
	               |	"""" КАК ПолучательКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ПолучательКонтактноеЛицоТелефонЗначение,
	               |	ШапкаДокумента.Организация КАК ПлательщикКонтрагентСсылка,
	               |	ШапкаДокумента.Организация.ИНН КАК ПлательщикКонтрагентИНН,
	               |	ШапкаДокумента.Организация.КПП КАК ПлательщикКонтрагентКПП,
	               |	ШапкаДокумента.Организация.НаименованиеСокращенное КАК ПлательщикКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПлательщикКонтрагентЮрФизЛицо,
	               |	ИСТИНА КАК ПлательщикКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Организация КАК ПлательщикКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо КАК ПлательщикКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо.Наименование КАК ПлательщикКонтактноеЛицоНаименование,
	               |	"""" КАК ПлательщикКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ПлательщикКонтактноеЛицоТелефонЗначение,
	               |	2 КАК ПлательщикРоль,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(КурсыВалюты.Кратность, 0) > 0
	               |				И ЕСТЬNULL(КурсыВалюты.Курс, 0) > 0
	               |			ТОГДА КурсыВалюты.Курс / КурсыВалюты.Кратность
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ВалютаКоэффициент
	               |ПОМЕСТИТЬ ШапкаДокумента
	               |ИЗ
	               |	Документ.ЗаказПоставщику КАК ШапкаДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть
	               |		ПО ШапкаДокумента.Организация = ОрганизацииБизнесСеть.Организация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалюты
	               |		ПО ШапкаДокумента.Валюта = КурсыВалюты.Валюта
	               |ГДЕ
	               |	ШапкаДокумента.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТовары.Ссылка КАК Ссылка,
	               |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	СправочникНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ТаблицаТовары.Упаковка КАК Упаковка,
	               |	ТаблицаТовары.КоличествоУпаковок КАК Количество,
	               |	ТаблицаТовары.СуммаСНДС КАК Сумма,
	               |	ТаблицаТовары.Цена КАК Цена
	               |ПОМЕСТИТЬ ТаблицаТовары
	               |ИЗ
	               |	Документ.ЗаказПоставщику.Товары КАК ТаблицаТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО ТаблицаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	               |ГДЕ
	               |	ТаблицаТовары.Ссылка = &Ссылка
	               |	И НЕ СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	               |	И НЕ ТаблицаТовары.Отменено";
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросДляЗаказаНаДостакуПоРеализациииТоваровУслуг()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ШапкаДокумента.Ссылка КАК ДокументОснование,
	               |	ОрганизацииБизнесСеть.Организация КАК ОрганизацияБизнесСетиСсылка,
	               |	1 КАК ФормаОплаты,
	               |	"""" КАК ГрузоперевозчикИдентификатор,
	               |	"""" КАК ГрузоперевозчикНаименование,
	               |	"""" КАК ГрузоперевозчикТелефон,
	               |	"""" КАК ТарифНаименование,
	               |	"""" КАК ТарифИдентификатор,
	               |	"""" КАК ТарифНеГабарит,
	               |	ШапкаДокумента.Дата КАК ДатаОтгрузки,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДоставки,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиС
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяОтгрузкиС,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиПо
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяОтгрузкиПо,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиС
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяДоставкиС,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиПо
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяДоставкиПо,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СпособОтгрузки,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СпособДоставки,
	               |	ШапкаДокумента.Организация КАК ОтправительКонтрагентСсылка,
	               |	ШапкаДокумента.Организация.ИНН КАК ОтправительКонтрагентИНН,
	               |	ШапкаДокумента.Организация.КПП КАК ОтправительКонтрагентКПП,
	               |	ШапкаДокумента.Организация.НаименованиеСокращенное КАК ОтправительКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОтправительКонтрагентЮрФизЛицо,
	               |	ИСТИНА КАК ОтправительКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Организация КАК ОтправительКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Склад КАК ОтправительАдресВладелец,
	               |	ШапкаДокумента.Склад.Наименование КАК ОтправительАдресВладелецНаименование,
	               |	"""" КАК ОтправительАдресПредставление,
	               |	"""" КАК ОтправительАдресЗначенияПолей,
	               |	"""" КАК ОтправительАдресЗначение,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо КАК ОтправительКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо.Наименование КАК ОтправительКонтактноеЛицоНаименование,
	               |	"""" КАК ОтправительКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ОтправительКонтактноеЛицоТелефонЗначение,
	               |	ШапкаДокумента.Контрагент КАК ПолучательКонтрагентСсылка,
	               |	ШапкаДокумента.Контрагент.ИНН КАК ПолучательКонтрагентИНН,
	               |	ШапкаДокумента.Контрагент.КПП КАК ПолучательКонтрагентКПП,
	               |	ШапкаДокумента.Контрагент.НаименованиеПолное КАК ПолучательКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПолучательКонтрагентЮрФизЛицо,
	               |	ЛОЖЬ КАК ПолучательКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Контрагент КАК ПолучательКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Партнер КАК ПолучательАдресВладелец,
	               |	ШапкаДокумента.Партнер.Наименование КАК ПолучательАдресВладелецНаименование,
	               |	ШапкаДокумента.АдресДоставки КАК ПолучательАдресПредставление,
	               |	ШапкаДокумента.АдресДоставкиЗначенияПолей КАК ПолучательАдресЗначенияПолей,
	               |	"""" КАК ПолучательАдресЗначение,
	               |	ШапкаДокумента.КонтактноеЛицо КАК ПолучательКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.КонтактноеЛицо.Наименование КАК ПолучательКонтактноеЛицоНаименование,
	               |	"""" КАК ПолучательКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ПолучательКонтактноеЛицоТелефонЗначение,
	               |	ШапкаДокумента.Организация КАК ПлательщикКонтрагентСсылка,
	               |	ШапкаДокумента.Организация.ИНН КАК ПлательщикКонтрагентИНН,
	               |	ШапкаДокумента.Организация.КПП КАК ПлательщикКонтрагентКПП,
	               |	ШапкаДокумента.Организация.НаименованиеСокращенное КАК ПлательщикКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПлательщикКонтрагентЮрФизЛицо,
	               |	ИСТИНА КАК ПлательщикКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Организация КАК ПлательщикКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо КАК ПлательщикКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо.Наименование КАК ПлательщикКонтактноеЛицоНаименование,
	               |	"""" КАК ПлательщикКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ПлательщикКонтактноеЛицоТелефонЗначение,
	               |	1 КАК ПлательщикРоль,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(КурсыВалюты.Кратность, 0) > 0
	               |				И ЕСТЬNULL(КурсыВалюты.Курс, 0) > 0
	               |			ТОГДА КурсыВалюты.Курс / КурсыВалюты.Кратность
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ВалютаКоэффициент
	               |ПОМЕСТИТЬ ШапкаДокумента
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК ШапкаДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть
	               |		ПО ШапкаДокумента.Организация = ОрганизацииБизнесСеть.Организация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалюты
	               |		ПО ШапкаДокумента.Валюта = КурсыВалюты.Валюта
	               |ГДЕ
	               |	ШапкаДокумента.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТовары.Ссылка КАК Ссылка,
	               |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	СправочникНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ТаблицаТовары.Упаковка КАК Упаковка,
	               |	ТаблицаТовары.КоличествоУпаковок КАК Количество,
	               |	ТаблицаТовары.СуммаСНДС КАК Сумма,
	               |	ТаблицаТовары.Цена КАК Цена
	               |ПОМЕСТИТЬ ТаблицаТовары
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО ТаблицаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	               |ГДЕ
	               |	ТаблицаТовары.Ссылка = &Ссылка
	               |	И НЕ СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))";
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросДляЗаказаНаДостакуПоПриобретениюТоваровУслуг()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ШапкаДокумента.Ссылка КАК ДокументОснование,
	               |	ОрганизацииБизнесСеть.Организация КАК ОрганизацияБизнесСетиСсылка,
	               |	1 КАК ФормаОплаты,
	               |	"""" КАК ГрузоперевозчикИдентификатор,
	               |	"""" КАК ГрузоперевозчикНаименование,
	               |	"""" КАК ГрузоперевозчикТелефон,
	               |	"""" КАК ТарифНаименование,
	               |	"""" КАК ТарифИдентификатор,
	               |	"""" КАК ТарифНеГабарит,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузки,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДоставки,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиС
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяОтгрузкиС,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиПо
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяОтгрузкиПо,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиС
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяДоставкиС,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиПо
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяДоставкиПо,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПоставщикаДоНашегоСклада)
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СпособОтгрузки,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПоставщикаДоНашегоСклада)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СпособДоставки,
	               |	ШапкаДокумента.Контрагент КАК ОтправительКонтрагентСсылка,
	               |	ШапкаДокумента.Контрагент.ИНН КАК ОтправительКонтрагентИНН,
	               |	ШапкаДокумента.Контрагент.КПП КАК ОтправительКонтрагентКПП,
	               |	ШапкаДокумента.Контрагент.НаименованиеПолное КАК ОтправительКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОтправительКонтрагентЮрФизЛицо,
	               |	ЛОЖЬ КАК ОтправительКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Контрагент КАК ОтправительКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Партнер КАК ОтправительАдресВладелец,
	               |	ШапкаДокумента.Партнер.Наименование КАК ОтправительАдресВладелецНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.АдресДоставки
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ОтправительАдресПредставление,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.АдресДоставкиЗначенияПолей
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ОтправительАдресЗначенияПолей,
	               |	"""" КАК ОтправительАдресЗначение,
	               |	ШапкаДокумента.ЗаказПоставщику.КонтактноеЛицо КАК ОтправительКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.ЗаказПоставщику.КонтактноеЛицо.Наименование КАК ОтправительКонтактноеЛицоНаименование,
	               |	"""" КАК ОтправительКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ОтправительКонтактноеЛицоТелефонЗначение,
	               |	ШапкаДокумента.Организация КАК ПолучательКонтрагентСсылка,
	               |	ШапкаДокумента.Организация.ИНН КАК ПолучательКонтрагентИНН,
	               |	ШапкаДокумента.Организация.КПП КАК ПолучательКонтрагентКПП,
	               |	ШапкаДокумента.Организация.НаименованиеСокращенное КАК ПолучательКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПолучательКонтрагентЮрФизЛицо,
	               |	ИСТИНА КАК ПолучательКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Организация КАК ПолучательКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Склад КАК ПолучательАдресВладелец,
	               |	ШапкаДокумента.Склад.Наименование КАК ПолучательАдресВладелецНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.АдресДоставки
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ПолучательАдресПредставление,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.АдресДоставкиЗначенияПолей
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ПолучательАдресЗначенияПолей,
	               |	"""" КАК ПолучательАдресЗначение,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо КАК ПолучательКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо.Наименование КАК ПолучательКонтактноеЛицоНаименование,
	               |	"""" КАК ПолучательКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ПолучательКонтактноеЛицоТелефонЗначение,
	               |	ШапкаДокумента.Организация КАК ПлательщикКонтрагентСсылка,
	               |	ШапкаДокумента.Организация.ИНН КАК ПлательщикКонтрагентИНН,
	               |	ШапкаДокумента.Организация.КПП КАК ПлательщикКонтрагентКПП,
	               |	ШапкаДокумента.Организация.НаименованиеСокращенное КАК ПлательщикКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПлательщикКонтрагентЮрФизЛицо,
	               |	ИСТИНА КАК ПлательщикКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Организация КАК ПлательщикКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо КАК ПлательщикКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо.Наименование КАК ПлательщикКонтактноеЛицоНаименование,
	               |	"""" КАК ПлательщикКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ПлательщикКонтактноеЛицоТелефонЗначение,
	               |	2 КАК ПлательщикРоль,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(КурсыВалюты.Кратность, 0) > 0
	               |				И ЕСТЬNULL(КурсыВалюты.Курс, 0) > 0
	               |			ТОГДА КурсыВалюты.Курс / КурсыВалюты.Кратность
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ВалютаКоэффициент
	               |ПОМЕСТИТЬ ШапкаДокумента
	               |ИЗ
	               |	Документ.ПриобретениеТоваровУслуг КАК ШапкаДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть
	               |		ПО ШапкаДокумента.Организация = ОрганизацииБизнесСеть.Организация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалюты
	               |		ПО ШапкаДокумента.Валюта = КурсыВалюты.Валюта
	               |ГДЕ
	               |	ШапкаДокумента.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТовары.Ссылка КАК Ссылка,
	               |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	СправочникНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ТаблицаТовары.Упаковка КАК Упаковка,
	               |	ТаблицаТовары.КоличествоУпаковок КАК Количество,
	               |	ТаблицаТовары.СуммаСНДС КАК Сумма,
	               |	ТаблицаТовары.Цена КАК Цена
	               |ПОМЕСТИТЬ ТаблицаТовары
	               |ИЗ
	               |	Документ.ПриобретениеТоваровУслуг.Товары КАК ТаблицаТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО ТаблицаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	               |ГДЕ
	               |	ТаблицаТовары.Ссылка = &Ссылка
	               |	И НЕ СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))";
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросДляЗаказаНаДостакуПоЗаказуНаПеремещение()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ШапкаДокумента.Ссылка КАК ДокументОснование,
	               |	ОрганизацииБизнесСеть.Организация КАК ОрганизацияБизнесСетиСсылка,
	               |	1 КАК ФормаОплаты,
	               |	"""" КАК ГрузоперевозчикИдентификатор,
	               |	"""" КАК ГрузоперевозчикНаименование,
	               |	"""" КАК ГрузоперевозчикТелефон,
	               |	"""" КАК ТарифНаименование,
	               |	"""" КАК ТарифИдентификатор,
	               |	"""" КАК ТарифНеГабарит,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузки,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДоставки,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиС
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяОтгрузкиС,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиПо
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяОтгрузкиПо,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиС
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяДоставкиС,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиПо
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяДоставкиПо,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СпособОтгрузки,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СпособДоставки,
	               |	ШапкаДокумента.Организация КАК ОтправительКонтрагентСсылка,
	               |	ШапкаДокумента.Организация.ИНН КАК ОтправительКонтрагентИНН,
	               |	ШапкаДокумента.Организация.КПП КАК ОтправительКонтрагентКПП,
	               |	ШапкаДокумента.Организация.НаименованиеСокращенное КАК ОтправительКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОтправительКонтрагентЮрФизЛицо,
	               |	ИСТИНА КАК ОтправительКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Организация КАК ОтправительКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.СкладОтправитель КАК ОтправительАдресВладелец,
	               |	ШапкаДокумента.СкладОтправитель.Наименование КАК ОтправительАдресВладелецНаименование,
	               |	"""" КАК ОтправительАдресПредставление,
	               |	"""" КАК ОтправительАдресЗначенияПолей,
	               |	"""" КАК ОтправительАдресЗначение,
	               |	ШапкаДокумента.Ответственный.ФизическоеЛицо КАК ОтправительКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.Ответственный.ФизическоеЛицо.Наименование КАК ОтправительКонтактноеЛицоНаименование,
	               |	"""" КАК ОтправительКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ОтправительКонтактноеЛицоТелефонЗначение,
	               |	ЕСТЬNULL(СправочникОрганизации.Ссылка, ШапкаДокумента.Организация) КАК ПолучательКонтрагентСсылка,
	               |	ЕСТЬNULL(СправочникОрганизации.ИНН, ШапкаДокумента.Организация.ИНН) КАК ПолучательКонтрагентИНН,
	               |	ЕСТЬNULL(СправочникОрганизации.КПП, ШапкаДокумента.Организация.КПП) КАК ПолучательКонтрагентКПП,
	               |	ЕСТЬNULL(СправочникОрганизации.НаименованиеСокращенное, ШапкаДокумента.Организация.НаименованиеСокращенное) КАК ПолучательКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(СправочникОрганизации.ЮрФизЛицо, ШапкаДокумента.Организация.ЮрФизЛицо) = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ЕСТЬNULL(СправочникОрганизации.ЮрФизЛицо, ШапкаДокумента.Организация.ЮрФизЛицо) = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ЕСТЬNULL(СправочникОрганизации.ЮрФизЛицо, ШапкаДокумента.Организация.ЮрФизЛицо) = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПолучательКонтрагентЮрФизЛицо,
	               |	ИСТИНА КАК ПолучательКонтрагентЭтоОрганизация,
	               |	ЕСТЬNULL(СправочникОрганизации.Ссылка, ШапкаДокумента.Организация) КАК ПолучательКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.СкладПолучатель КАК ПолучательАдресВладелец,
	               |	ШапкаДокумента.СкладПолучатель.Наименование КАК ПолучательАдресВладелецНаименование,
	               |	ШапкаДокумента.АдресДоставки КАК ПолучательАдресПредставление,
	               |	ШапкаДокумента.АдресДоставкиЗначенияПолей КАК ПолучательАдресЗначенияПолей,
	               |	"""" КАК ПолучательАдресЗначение,
	               |	ШапкаДокумента.Ответственный.ФизическоеЛицо КАК ПолучательКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.Ответственный.ФизическоеЛицо.Наименование КАК ПолучательКонтактноеЛицоНаименование,
	               |	"""" КАК ПолучательКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ПолучательКонтактноеЛицоТелефонЗначение,
	               |	ШапкаДокумента.Организация КАК ПлательщикКонтрагентСсылка,
	               |	ШапкаДокумента.Организация.ИНН КАК ПлательщикКонтрагентИНН,
	               |	ШапкаДокумента.Организация.КПП КАК ПлательщикКонтрагентКПП,
	               |	ШапкаДокумента.Организация.НаименованиеСокращенное КАК ПлательщикКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПлательщикКонтрагентЮрФизЛицо,
	               |	ИСТИНА КАК ПлательщикКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Организация КАК ПлательщикКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Ответственный.ФизическоеЛицо КАК ПлательщикКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.Ответственный.ФизическоеЛицо.Наименование КАК ПлательщикКонтактноеЛицоНаименование,
	               |	"""" КАК ПлательщикКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ПлательщикКонтактноеЛицоТелефонЗначение,
	               |	1 КАК ПлательщикРоль,
	               |	1 КАК ВалютаКоэффициент
	               |ПОМЕСТИТЬ ШапкаДокумента
	               |ИЗ
	               |	Документ.ЗаказНаПеремещение КАК ШапкаДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть
	               |		ПО ШапкаДокумента.Организация = ОрганизацииБизнесСеть.Организация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК СправочникОрганизации
	               |		ПО ШапкаДокумента.ОрганизацияПолучатель = СправочникОрганизации.Ссылка
	               |ГДЕ
	               |	ШапкаДокумента.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТовары.Ссылка КАК Ссылка,
	               |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	СправочникНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ТаблицаТовары.Упаковка КАК Упаковка,
	               |	ТаблицаТовары.КоличествоУпаковок КАК Количество,
	               |	0 КАК Сумма,
	               |	0 КАК Цена
	               |ПОМЕСТИТЬ ТаблицаТовары
	               |ИЗ
	               |	Документ.ЗаказНаПеремещение.Товары КАК ТаблицаТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО ТаблицаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	               |ГДЕ
	               |	ТаблицаТовары.Ссылка = &Ссылка
	               |	И НЕ СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	               |	И НЕ ТаблицаТовары.Отменено";
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросДляЗаказаНаДостакуПоПеремещениюТоваров()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ШапкаДокумента.Ссылка КАК ДокументОснование,
	               |	ОрганизацииБизнесСеть.Организация КАК ОрганизацияБизнесСетиСсылка,
	               |	1 КАК ФормаОплаты,
	               |	"""" КАК ГрузоперевозчикИдентификатор,
	               |	"""" КАК ГрузоперевозчикНаименование,
	               |	"""" КАК ГрузоперевозчикТелефон,
	               |	"""" КАК ТарифНаименование,
	               |	"""" КАК ТарифИдентификатор,
	               |	"""" КАК ТарифНеГабарит,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузки,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДоставки,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиС
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяОтгрузкиС,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиПо
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяОтгрузкиПо,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиС
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяДоставкиС,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиПо
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяДоставкиПо,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СпособОтгрузки,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СпособДоставки,
	               |	ШапкаДокумента.Организация КАК ОтправительКонтрагентСсылка,
	               |	ШапкаДокумента.Организация.ИНН КАК ОтправительКонтрагентИНН,
	               |	ШапкаДокумента.Организация.КПП КАК ОтправительКонтрагентКПП,
	               |	ШапкаДокумента.Организация.НаименованиеСокращенное КАК ОтправительКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОтправительКонтрагентЮрФизЛицо,
	               |	ИСТИНА КАК ОтправительКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Организация КАК ОтправительКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.СкладОтправитель КАК ОтправительАдресВладелец,
	               |	ШапкаДокумента.СкладОтправитель.Наименование КАК ОтправительАдресВладелецНаименование,
	               |	"""" КАК ОтправительАдресПредставление,
	               |	"""" КАК ОтправительАдресЗначенияПолей,
	               |	"""" КАК ОтправительАдресЗначение,
	               |	ШапкаДокумента.Ответственный.ФизическоеЛицо КАК ОтправительКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.Ответственный.ФизическоеЛицо.Наименование КАК ОтправительКонтактноеЛицоНаименование,
	               |	"""" КАК ОтправительКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ОтправительКонтактноеЛицоТелефонЗначение,
	               |	ЕСТЬNULL(СправочникОрганизации.Ссылка, ШапкаДокумента.Организация) КАК ПолучательКонтрагентСсылка,
	               |	ЕСТЬNULL(СправочникОрганизации.ИНН, ШапкаДокумента.Организация.ИНН) КАК ПолучательКонтрагентИНН,
	               |	ЕСТЬNULL(СправочникОрганизации.КПП, ШапкаДокумента.Организация.КПП) КАК ПолучательКонтрагентКПП,
	               |	ЕСТЬNULL(СправочникОрганизации.НаименованиеСокращенное, ШапкаДокумента.Организация.НаименованиеСокращенное) КАК ПолучательКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(СправочникОрганизации.ЮрФизЛицо, ШапкаДокумента.Организация.ЮрФизЛицо) = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ЕСТЬNULL(СправочникОрганизации.ЮрФизЛицо, ШапкаДокумента.Организация.ЮрФизЛицо) = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ЕСТЬNULL(СправочникОрганизации.ЮрФизЛицо, ШапкаДокумента.Организация.ЮрФизЛицо) = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПолучательКонтрагентЮрФизЛицо,
	               |	ИСТИНА КАК ПолучательКонтрагентЭтоОрганизация,
	               |	ЕСТЬNULL(СправочникОрганизации.Ссылка, ШапкаДокумента.Организация) КАК ПолучательКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.СкладПолучатель КАК ПолучательАдресВладелец,
	               |	ШапкаДокумента.СкладПолучатель.Наименование КАК ПолучательАдресВладелецНаименование,
	               |	ШапкаДокумента.АдресДоставки КАК ПолучательАдресПредставление,
	               |	ШапкаДокумента.АдресДоставкиЗначенияПолей КАК ПолучательАдресЗначенияПолей,
	               |	"""" КАК ПолучательАдресЗначение,
	               |	ШапкаДокумента.Ответственный.ФизическоеЛицо КАК ПолучательКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.Ответственный.ФизическоеЛицо.Наименование КАК ПолучательКонтактноеЛицоНаименование,
	               |	"""" КАК ПолучательКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ПолучательКонтактноеЛицоТелефонЗначение,
	               |	ШапкаДокумента.Организация КАК ПлательщикКонтрагентСсылка,
	               |	ШапкаДокумента.Организация.ИНН КАК ПлательщикКонтрагентИНН,
	               |	ШапкаДокумента.Организация.КПП КАК ПлательщикКонтрагентКПП,
	               |	ШапкаДокумента.Организация.НаименованиеСокращенное КАК ПлательщикКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПлательщикКонтрагентЮрФизЛицо,
	               |	ИСТИНА КАК ПлательщикКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Организация КАК ПлательщикКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Ответственный.ФизическоеЛицо КАК ПлательщикКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.Ответственный.ФизическоеЛицо.Наименование КАК ПлательщикКонтактноеЛицоНаименование,
	               |	"""" КАК ПлательщикКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ПлательщикКонтактноеЛицоТелефонЗначение,
	               |	1 КАК ПлательщикРоль,
	               |	1 КАК ВалютаКоэффициент
	               |ПОМЕСТИТЬ ШапкаДокумента
	               |ИЗ
	               |	Документ.ПеремещениеТоваров КАК ШапкаДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть
	               |		ПО ШапкаДокумента.Организация = ОрганизацииБизнесСеть.Организация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК СправочникОрганизации
	               |		ПО ШапкаДокумента.ОрганизацияПолучатель = СправочникОрганизации.Ссылка
	               |ГДЕ
	               |	ШапкаДокумента.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТовары.Ссылка КАК Ссылка,
	               |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	СправочникНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ТаблицаТовары.Упаковка КАК Упаковка,
	               |	ТаблицаТовары.КоличествоУпаковок КАК Количество,
	               |	0 КАК Сумма,
	               |	0 КАК Цена
	               |ПОМЕСТИТЬ ТаблицаТовары
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК ТаблицаТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО ТаблицаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	               |ГДЕ
	               |	ТаблицаТовары.Ссылка = &Ссылка
	               |	И НЕ СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))";
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросДляЗаказаНаДостакуПоЗаявкеНаВозвратТоваровОтКлиента()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ШапкаДокумента.Ссылка КАК ДокументОснование,
	               |	ОрганизацииБизнесСеть.Организация КАК ОрганизацияБизнесСетиСсылка,
	               |	1 КАК ФормаОплаты,
	               |	"""" КАК ГрузоперевозчикИдентификатор,
	               |	"""" КАК ГрузоперевозчикНаименование,
	               |	"""" КАК ГрузоперевозчикТелефон,
	               |	"""" КАК ТарифНаименование,
	               |	"""" КАК ТарифИдентификатор,
	               |	"""" КАК ТарифНеГабарит,
	               |	ШапкаДокумента.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДоставки,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиС
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяОтгрузкиС,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиПо
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяОтгрузкиПо,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиС
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяДоставкиС,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиПо
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяДоставкиПо,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СпособОтгрузки,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СпособДоставки,
	               |	ШапкаДокумента.Организация КАК ОтправительКонтрагентСсылка,
	               |	ШапкаДокумента.Организация.ИНН КАК ОтправительКонтрагентИНН,
	               |	ШапкаДокумента.Организация.КПП КАК ОтправительКонтрагентКПП,
	               |	ШапкаДокумента.Организация.НаименованиеСокращенное КАК ОтправительКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОтправительКонтрагентЮрФизЛицо,
	               |	ИСТИНА КАК ОтправительКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Организация КАК ОтправительКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Склад КАК ОтправительАдресВладелец,
	               |	ШапкаДокумента.Склад.Наименование КАК ОтправительАдресВладелецНаименование,
	               |	"""" КАК ОтправительАдресПредставление,
	               |	"""" КАК ОтправительАдресЗначенияПолей,
	               |	"""" КАК ОтправительАдресЗначение,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо КАК ОтправительКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо.Наименование КАК ОтправительКонтактноеЛицоНаименование,
	               |	"""" КАК ОтправительКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ОтправительКонтактноеЛицоТелефонЗначение,
	               |	ШапкаДокумента.Контрагент КАК ПолучательКонтрагентСсылка,
	               |	ШапкаДокумента.Контрагент.ИНН КАК ПолучательКонтрагентИНН,
	               |	ШапкаДокумента.Контрагент.КПП КАК ПолучательКонтрагентКПП,
	               |	ШапкаДокумента.Контрагент.НаименованиеПолное КАК ПолучательКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПолучательКонтрагентЮрФизЛицо,
	               |	ЛОЖЬ КАК ПолучательКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Контрагент КАК ПолучательКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Партнер КАК ПолучательАдресВладелец,
	               |	ШапкаДокумента.Партнер.Наименование КАК ПолучательАдресВладелецНаименование,
	               |	ШапкаДокумента.АдресДоставки КАК ПолучательАдресПредставление,
	               |	ШапкаДокумента.АдресДоставкиЗначенияПолей КАК ПолучательАдресЗначенияПолей,
	               |	"""" КАК ПолучательАдресЗначение,
	               |	ШапкаДокумента.КонтактноеЛицо КАК ПолучательКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.КонтактноеЛицо.Наименование КАК ПолучательКонтактноеЛицоНаименование,
	               |	"""" КАК ПолучательКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ПолучательКонтактноеЛицоТелефонЗначение,
	               |	ШапкаДокумента.Организация КАК ПлательщикКонтрагентСсылка,
	               |	ШапкаДокумента.Организация.ИНН КАК ПлательщикКонтрагентИНН,
	               |	ШапкаДокумента.Организация.КПП КАК ПлательщикКонтрагентКПП,
	               |	ШапкаДокумента.Организация.НаименованиеСокращенное КАК ПлательщикКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПлательщикКонтрагентЮрФизЛицо,
	               |	ИСТИНА КАК ПлательщикКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Организация КАК ПлательщикКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо КАК ПлательщикКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо.Наименование КАК ПлательщикКонтактноеЛицоНаименование,
	               |	"""" КАК ПлательщикКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ПлательщикКонтактноеЛицоТелефонЗначение,
	               |	1 КАК ПлательщикРоль,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(КурсыВалюты.Кратность, 0) > 0
	               |				И ЕСТЬNULL(КурсыВалюты.Курс, 0) > 0
	               |			ТОГДА КурсыВалюты.Курс / КурсыВалюты.Кратность
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ВалютаКоэффициент
	               |ПОМЕСТИТЬ ШапкаДокумента
	               |ИЗ
	               |	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ШапкаДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть
	               |		ПО ШапкаДокумента.Организация = ОрганизацииБизнесСеть.Организация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалюты
	               |		ПО ШапкаДокумента.Валюта = КурсыВалюты.Валюта
	               |ГДЕ
	               |	ШапкаДокумента.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТовары.Ссылка КАК Ссылка,
	               |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	СправочникНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ТаблицаТовары.Упаковка КАК Упаковка,
	               |	ТаблицаТовары.КоличествоУпаковок КАК Количество,
	               |	ТаблицаТовары.СуммаСНДС КАК Сумма,
	               |	ТаблицаТовары.Цена КАК Цена
	               |ПОМЕСТИТЬ ТаблицаТовары
	               |ИЗ
	               |	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ТаблицаТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО ТаблицаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	               |ГДЕ
	               |	ТаблицаТовары.Ссылка = &Ссылка
	               |	И НЕ СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	               |	И НЕ ТаблицаТовары.Отменено";
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросДляЗаказаНаДостакуПоВозвратуТоваровПоставщику()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ШапкаДокумента.Ссылка КАК ДокументОснование,
	               |	ОрганизацииБизнесСеть.Организация КАК ОрганизацияБизнесСетиСсылка,
	               |	1 КАК ФормаОплаты,
	               |	"""" КАК ГрузоперевозчикИдентификатор,
	               |	"""" КАК ГрузоперевозчикНаименование,
	               |	"""" КАК ГрузоперевозчикТелефон,
	               |	"""" КАК ТарифНаименование,
	               |	"""" КАК ТарифИдентификатор,
	               |	"""" КАК ТарифНеГабарит,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузки,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДоставки,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиС
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяОтгрузкиС,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиПо
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяОтгрузкиПо,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиС
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяДоставкиС,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки)
	               |			ТОГДА ШапкаДокумента.ВремяДоставкиПо
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ВремяДоставкиПо,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз)
	               |				ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СпособОтгрузки,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СпособДоставки,
	               |	ШапкаДокумента.Организация КАК ОтправительКонтрагентСсылка,
	               |	ШапкаДокумента.Организация.ИНН КАК ОтправительКонтрагентИНН,
	               |	ШапкаДокумента.Организация.КПП КАК ОтправительКонтрагентКПП,
	               |	ШапкаДокумента.Организация.НаименованиеСокращенное КАК ОтправительКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОтправительКонтрагентЮрФизЛицо,
	               |	ИСТИНА КАК ОтправительКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Организация КАК ОтправительКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Склад КАК ОтправительАдресВладелец,
	               |	ШапкаДокумента.Склад.Наименование КАК ОтправительАдресВладелецНаименование,
	               |	"""" КАК ОтправительАдресПредставление,
	               |	"""" КАК ОтправительАдресЗначенияПолей,
	               |	"""" КАК ОтправительАдресЗначение,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо КАК ОтправительКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо.Наименование КАК ОтправительКонтактноеЛицоНаименование,
	               |	"""" КАК ОтправительКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ОтправительКонтактноеЛицоТелефонЗначение,
	               |	ШапкаДокумента.Контрагент КАК ПолучательКонтрагентСсылка,
	               |	ШапкаДокумента.Контрагент.ИНН КАК ПолучательКонтрагентИНН,
	               |	ШапкаДокумента.Контрагент.КПП КАК ПолучательКонтрагентКПП,
	               |	ШапкаДокумента.Контрагент.НаименованиеПолное КАК ПолучательКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПолучательКонтрагентЮрФизЛицо,
	               |	ЛОЖЬ КАК ПолучательКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Контрагент КАК ПолучательКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Партнер КАК ПолучательАдресВладелец,
	               |	ШапкаДокумента.Партнер.Наименование КАК ПолучательАдресВладелецНаименование,
	               |	ШапкаДокумента.АдресДоставки КАК ПолучательАдресПредставление,
	               |	ШапкаДокумента.АдресДоставкиЗначенияПолей КАК ПолучательАдресЗначенияПолей,
	               |	"""" КАК ПолучательАдресЗначение,
	               |	ШапкаДокумента.КонтактноеЛицо КАК ПолучательКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.КонтактноеЛицо.Наименование КАК ПолучательКонтактноеЛицоНаименование,
	               |	"""" КАК ПолучательКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ПолучательКонтактноеЛицоТелефонЗначение,
	               |	ШапкаДокумента.Организация КАК ПлательщикКонтрагентСсылка,
	               |	ШапкаДокумента.Организация.ИНН КАК ПлательщикКонтрагентИНН,
	               |	ШапкаДокумента.Организация.КПП КАК ПлательщикКонтрагентКПП,
	               |	ШапкаДокумента.Организация.НаименованиеСокращенное КАК ПлательщикКонтрагентНаименование,
	               |	ВЫБОР
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА 1
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |			ТОГДА 2
	               |		КОГДА ШапкаДокумента.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПлательщикКонтрагентЮрФизЛицо,
	               |	ИСТИНА КАК ПлательщикКонтрагентЭтоОрганизация,
	               |	ШапкаДокумента.Организация КАК ПлательщикКонтрагентЮридическийАдресВладелец,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо КАК ПлательщикКонтактноеЛицоСсылка,
	               |	ШапкаДокумента.Менеджер.ФизическоеЛицо.Наименование КАК ПлательщикКонтактноеЛицоНаименование,
	               |	"""" КАК ПлательщикКонтактноеЛицоТелефонПредставление,
	               |	"""" КАК ПлательщикКонтактноеЛицоТелефонЗначение,
	               |	1 КАК ПлательщикРоль,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(КурсыВалюты.Кратность, 0) > 0
	               |				И ЕСТЬNULL(КурсыВалюты.Курс, 0) > 0
	               |			ТОГДА КурсыВалюты.Курс / КурсыВалюты.Кратность
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ВалютаКоэффициент
	               |ПОМЕСТИТЬ ШапкаДокумента
	               |ИЗ
	               |	Документ.ВозвратТоваровПоставщику КАК ШапкаДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть
	               |		ПО ШапкаДокумента.Организация = ОрганизацииБизнесСеть.Организация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалюты
	               |		ПО ШапкаДокумента.Валюта = КурсыВалюты.Валюта
	               |ГДЕ
	               |	ШапкаДокумента.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТовары.Ссылка КАК Ссылка,
	               |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	СправочникНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ТаблицаТовары.Упаковка КАК Упаковка,
	               |	ТаблицаТовары.КоличествоУпаковок КАК Количество,
	               |	ТаблицаТовары.СуммаСНДС КАК Сумма,
	               |	ТаблицаТовары.Цена КАК Цена
	               |ПОМЕСТИТЬ ТаблицаТовары
	               |ИЗ
	               |	Документ.ВозвратТоваровПоставщику.Товары КАК ТаблицаТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО ТаблицаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	               |ГДЕ
	               |	ТаблицаТовары.Ссылка = &Ссылка
	               |	И НЕ СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))";
		
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Обработка_результатов_запросов_документов

// Обрабатывает результат создания заказа на доставку в сервисе 1С:Доставка.
//
// Параметры:
//  Результат - Структура - содержит результат выполнения запроса в сервис;
//  ДокументОснование - ОпределяемыйТип.ОснованиеЗаказаСервисДоставки, Неопределено - документ, основание заказа на доставку.
//
Процедура ОбработатьРезультатСозданияЗаказаНаДоставку(Результат, ДокументОснование = Неопределено) Экспорт
	
КонецПроцедуры

// Обрабатывает результат оформления заказа на доставку в сервисе 1С:Доставка.
//
// Параметры:
//  Результат - Структура - содержит результат выполнения запроса в сервис;
//  ДокументОснование - ОпределяемыйТип.ОснованиеЗаказаСервисДоставки, Неопределено - документ, основание заказа на доставку.
//
Процедура ОбработатьРезультатОформленияЗаказаНаДоставку(Результат, ДокументОснование = Неопределено) Экспорт
	
КонецПроцедуры

// Обрабатывает результат отмены заказа на доставку в сервисе 1С:Доставка.
//
// Параметры:
//  Результат - Структура - содержит результат выполнения запроса в сервис;
//  ДокументОснование - ОпределяемыйТип.ОснованиеЗаказаСервисДоставки, Неопределено - документ, основание заказа на доставку.
//
Процедура ОбработатьРезультатОтменыЗаказаНаДоставку(Результат, ДокументОснование = Неопределено) Экспорт
	
КонецПроцедуры

// Обрабатывает результат обновления заказа на доставку в сервисе 1С:Доставка.
//
// Параметры:
//  Результат - Структура - содержит результат выполнения запроса в сервис;
//  ДокументОснование - ОпределяемыйТип.ОснованиеЗаказаСервисДоставки, Неопределено - документ, основание заказа на доставку.
//
Процедура ОбработатьРезультатОбновленияЗаказаНаДоставку(Результат, ДокументОснование = Неопределено) Экспорт
	
КонецПроцедуры

// Обрабатывает результат запроса состояния заказа на доставку в сервисе 1С:Доставка.
//
// Параметры:
//  ИнформацияОЗаказе - Структура - содержит информацию о состоянии заказа в сервисе;
//
Процедура ОбработатьРезультатСостоянияЗаказаНаДоставку(ИнформацияОЗаказе) Экспорт
	
КонецПроцедуры

// Обрабатывает результат получения заказа на доставку из сервиса 1С:Доставка.
//
// Параметры:
//  Результат - Структура - содержит результат выполнения запроса в сервис;
//  ДокументОснование - ОпределяемыйТип.ОснованиеЗаказаСервисДоставки, Неопределено - документ, основание заказа на доставку.
//
Процедура ОбработатьРезультатПолученияЗаказаНаДоставку(Результат, ДокументОснование = Неопределено) Экспорт
	
КонецПроцедуры

#КонецОбласти

