#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РассылкаЭлектронныхЧеков.ПриСозданииСпискаОчереди(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РассылкаЭлектронныхЧековКлиент.ПриОткрытииСпискаОчереди(ЭтотОбъект, Список);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПоОшибкамПриИзменении(Элемент)
	
	РассылкаЭлектронныхЧековКлиент.ПриОткрытииСпискаОчереди(ЭтотОбъект, Список);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отправить(Команда)
	
	ОтправитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	УдалитьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

&НаСервере
Процедура УдалитьНаСервере()
	
	МассивСтрок = МассивВыделенныхСтрок();
	РассылкаЭлектронныхЧеков.УдалитьСообщенияМассива(МассивСтрок);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	
	МассивСтрок = МассивВыделенныхСтрок();
	РассылкаЭлектронныхЧеков.ОтправитьСообщенияМассива(МассивСтрок);
	
КонецПроцедуры

&НаСервере
Функция МассивВыделенныхСтрок()
	
	МассивСтрок = Новый Массив;
		
	Для каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		
		СтруктураСтроки = ПолучитьСтруктуруСтроки();
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, ВыделеннаяСтрока);
		МассивСтрок.Добавить(СтруктураСтроки.Ссылка);
		
	КонецЦикла;
	
	Возврат МассивСтрок;
КонецФункции


// Возвращает структуру строки.
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * Ссылка - СправочникСсылка.ОчередьЭлектронныхЧековКОтправке - .
&НаСервере
Функция ПолучитьСтруктуруСтроки()

	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("Ссылка");

	Возврат СтруктураСтроки;

КонецФункции
#КонецОбласти
