
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Договор") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг);
		ДанныеВыбора.Добавить(Перечисления.ТипыСуммГрафикаКредитовИДепозитов.Проценты);
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Отбор.Договор, "ТипКомиссии")
			<> Перечисления.ТипыКомиссииКредитовИДепозитов.Нет Тогда
			ДанныеВыбора.Добавить(Перечисления.ТипыСуммГрафикаКредитовИДепозитов.Комиссия);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли