
#Область ПрограммныйИнтерфейс

// Определяет список планов обмена, которые используют функционал подсистемы обмена данными.
//
// см. ОбменДаннымиПереопределяемый.ПолучитьПланыОбмена()
//
Процедура ПолучитьПланыОбмена(ПланыОбменаПодсистемы) Экспорт
	
	//++ Локализация
	ОбменДаннымиУТУП.СписокПлановОбмена(ПланыОбменаПодсистемы);
	//-- Локализация
	
КонецПроцедуры

// Обработчик регистрации изменений для начальной выгрузки данных.
// 
// см. ОбменДаннымиПереопределяемый.РегистрацияИзмененийНачальнойВыгрузкиДанных()
//
Процедура РегистрацияИзмененийНачальнойВыгрузкиДанных(Знач Получатель, СтандартнаяОбработка, Отбор) Экспорт
	
	//++ Локализация
	ОбменДаннымиУТУП.РегистрацияИзмененияДляНачальнойВыгрузки(Получатель, СтандартнаяОбработка, Отбор);
	//-- Локализация
	
КонецПроцедуры

// Получает доступные для использования версии универсального формата EnterpriseData.
//
// см. ОбменДаннымиПереопределяемый.ПриПолученииДоступныхВерсийФормата()
//
Процедура ПриПолученииДоступныхВерсийФормата(ВерсииФормата) Экспорт
	
	//++ Локализация
	ОбменДаннымиУТ.ДоступныеВерсииУниверсальногоФормата(ВерсииФормата);
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти