
#Область ПрограммныйИнтерфейс

#Область Проведение

#КонецОбласти

#Область ОбработчикиСобытий

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый документ.
//  Отказ - Булево - Признак проведения документа.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то проведение документа выполнено не будет.
//  РежимПроведения - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
Процедура ОбработкаПроведения(Объект, Отказ, РежимПроведения) Экспорт
	
	Движения = Объект.Движения;
	ДополнительныеСвойства = Объект.ДополнительныеСвойства;
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то будет выполнен отказ от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Объект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект.
//  ДанныеЗаполнения - Произвольный - Значение, которое используется как основание для заполнения.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаЗаполнения(Объект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//
Процедура ОбработкаУдаленияПроведения(Объект, Отказ) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//  РежимЗаписи - РежимЗаписиДокумента - В параметр передается текущий режим записи документа. Позволяет определить в теле процедуры режим записи.
//  РежимПроведения - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
Процедура ПередЗаписью(Объект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина, то запись выполнена не будет и будет вызвано исключение.
//
Процедура ПриЗаписи(Объект, Отказ) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  ОбъектКопирования - ДокументОбъект.<Имя документа> - Исходный документ, который является источником копирования.
//
Процедура ПриКопировании(Объект, ОбъектКопирования) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	
КонецПроцедуры

// Добавляет команду создания документа "Авансовый отчет".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт


КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	//++ Локализация
	ДобавитьКомандуТОРГ1(КомандыПечати, "ПодменюПечать");
	ДобавитьКомандуТОРГ2(КомандыПечати, "ПодменюПечать");
	ДобавитьКомандуТОРГ3(КомандыПечати, "ПодменюПечать");
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНоменклатуруПартнеров") Тогда
		
		// ТОРГ-1
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.ПечатьАктыОРасхождениях";
		КомандаПечати.Идентификатор = "ТОРГ1";
		КомандаПечати.Представление = НСтр("ru = 'ТОРГ-1 (в номенклатуре поставщика)'");
		КомандаПечати.ДополнительныеПараметры.Вставить("ПечатьВНоменклатуреПоставщика", Истина);
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		
		ДобавитьУсловиеВидимостиКомандыПечати(КомандаПечати);
		
		// ТОРГ-2 (в номенклатуре поставщика)
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.ПечатьАктыОРасхождениях";
		КомандаПечати.Идентификатор = "ТОРГ2";
		КомандаПечати.Представление = НСтр("ru = 'ТОРГ-2 (в номенклатуре поставщика)'");
		КомандаПечати.ДополнительныеПараметры.Вставить("ПечатьВНоменклатуреПоставщика", Истина);
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		
		ДобавитьУсловиеВидимостиКомандыПечати(КомандаПечати);
		
		// ТОРГ-3 (в номенклатуре поставщика)
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.ПечатьАктыОРасхождениях";
		КомандаПечати.Идентификатор = "ТОРГ3";
		КомандаПечати.Представление = НСтр("ru = 'ТОРГ-3 (в номенклатуре поставщика)'");
		КомандаПечати.ДополнительныеПараметры.Вставить("ПечатьВНоменклатуреПоставщика", Истина);
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		
		ДобавитьУсловиеВидимостиКомандыПечати(КомандаПечати);
		
	КонецЕсли;
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область Печать

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
КонецПроцедуры

//++ Локализация
Процедура ДобавитьУсловиеВидимостиКомандыПечати(КомандаПечати)
	
	ТипыАктовОРасхождениях = Новый Массив;
	ТипыАктовОРасхождениях.Добавить(Перечисления.ТипыОснованияАктаОРасхождении.ВозвратТоваровОтКлиента);
	
	УправлениеПечатью.ДобавитьУсловиеВидимостиКоманды(КомандаПечати,
							"ТипОснованияАктаОРасхождении",
							ТипыАктовОРасхождениях,
							ВидСравнения.НеРавно);
	
КонецПроцедуры

Процедура ДобавитьКомандуТОРГ1(КомандыПечати, МестоРазмещения)
	
	// ТОРГ-1
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьАктыОРасхождениях";
	КомандаПечати.Идентификатор = "ТОРГ1";
	КомандаПечати.Представление = НСтр("ru = 'ТОРГ-1'");
	КомандаПечати.ДополнительныеПараметры.Вставить("ПечатьВНоменклатуреПоставщика", Ложь); 
	КомандаПечати.МестоРазмещения = МестоРазмещения;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

Процедура ДобавитьКомандуТОРГ2(КомандыПечати, МестоРазмещения)
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьАктыОРасхождениях";
	КомандаПечати.Идентификатор = "ТОРГ2";
	КомандаПечати.Представление = НСтр("ru = 'ТОРГ-2'");
	КомандаПечати.ДополнительныеПараметры.Вставить("ПечатьВНоменклатуреПоставщика", Ложь);
	КомандаПечати.МестоРазмещения = МестоРазмещения;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

Процедура ДобавитьКомандуТОРГ3(КомандыПечати, МестоРазмещения)
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьАктыОРасхождениях";
	КомандаПечати.Идентификатор = "ТОРГ3";
	КомандаПечати.Представление = НСтр("ru = 'ТОРГ-3'");
	КомандаПечати.ДополнительныеПараметры.Вставить("ПечатьВНоменклатуреПоставщика", Ложь);
	КомандаПечати.МестоРазмещения = МестоРазмещения;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

Функция ПолучитьДанныеДляПечатнойФормыТОРГ1(ПараметрыПечати, МассивОбъектов) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст ="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АктОРасхожденияхПослеПриемкиТовары.ДокументОснование КАК ДокументОснование,
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка            КАК АктОРасхождениях
	|ПОМЕСТИТЬ ДокументыОснованияАкта
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////1
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыОснованияАкта.АктОРасхождениях КАК ДокументОснование,
	|	СтрокиОснований.ДокументОснование       КАК ДокументОснованиеРеализация,
	|	СчетФактураПолученный.НомерИсправления  КАК НомерИсправления,
	|	СчетФактураПолученный.Номер             КАК НомерСчетаФактуры,
	|	СчетФактураПолученный.Дата              КАК ДатаСчетаФактуры
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СтрокиОснований
	|		ПО СтрокиОснований.Ссылка = СчетФактураПолученный.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыОснованияАкта КАК ДокументыОснованияАкта
	|		ПО (ДокументыОснованияАкта.ДокументОснование = СтрокиОснований.ДокументОснование)
	|ГДЕ
	|	НЕ СчетФактураПолученный.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыОснованияАкта.АктОРасхождениях КАК ДокументОснование,
	|	СтрокиОснований.ДокументОснование       КАК ДокументОснованиеРеализация,
	|	СчетФактураПолученный.НомерИсправления  КАК НомерИсправления,
	|	СчетФактураПолученный.Номер             КАК НомерСчетаФактуры,
	|	СчетФактураПолученный.Дата              КАК ДатаСчетаФактуры
	|ИЗ
	|	Документ.СчетФактураПолученныйНалоговыйАгент КАК СчетФактураПолученный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученныйНалоговыйАгент.ДокументыОснования КАК СтрокиОснований
	|		ПО СтрокиОснований.Ссылка = СчетФактураПолученный.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыОснованияАкта КАК ДокументыОснованияАкта
	|		ПО (ДокументыОснованияАкта.ДокументОснование = СтрокиОснований.ДокументОснование)
	|ГДЕ
	|	НЕ СчетФактураПолученный.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетФактураПолученный.НомерИсправления УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////2
	|
	|ВЫБРАТЬ
	|	АктОРасхожденияхПослеПриемки.Ссылка                                                            КАК Ссылка,
	|	АктОРасхожденияхПослеПриемки.Номер                                                             КАК НомерДокумента,
	|	АктОРасхожденияхПослеПриемки.Дата                                                              КАК ДатаДокумента,
	|	АктОРасхожденияхПослеПриемки.Организация                                                       КАК Организация,
	|	АктОРасхожденияхПослеПриемки.Организация.Префикс                                               КАК Префикс,
	|	АктОРасхожденияхПослеПриемки.Организация.КодПоОКПО                                             КАК ОрганизацияПоОКПО,
	|	ПРЕДСТАВЛЕНИЕ(АктОРасхожденияхПослеПриемки.Подразделение)                                      КАК ПредставлениеПодразделения,
	|	АктОРасхожденияхПослеПриемки.Руководитель                                                      КАК Руководитель,
	|	АктОРасхожденияхПослеПриемки.ДолжностьРуководителя                                             КАК ДолжностьРуководителя,
	|	АктОРасхожденияхПослеПриемки.ГлавныйБухгалтер                                                  КАК ГлавныйБухгалтер,
	|	АктОРасхожденияхПослеПриемки.МестоПриемкиТовара                                                КАК МестоПриемкиТовара,
	|	АктОРасхожденияхПослеПриемки.ОснованиеДляСоставленияАкта                                       КАК ОснованиеДляСоставленияАкта,
	|	АктОРасхожденияхПослеПриемки.НомерОснования                                                    КАК НомерОснования,
	|	АктОРасхожденияхПослеПриемки.ДатаОснования                                                     КАК ДатаОснования,
	|	АктОРасхожденияхПослеПриемки.ДатаДоставкиТоваров                                               КАК ДатаДоставкиТоваров,
	|	АктОРасхожденияхПослеПриемки.ДатаОтправленияТоваров                                            КАК ДатаОтправленияТоваров,
	|	АктОРасхожденияхПослеПриемки.ТемператураВТолщеМясаРыбы                                         КАК ТемператураВТолщеМясаРыбы,
	|	АктОРасхожденияхПослеПриемки.ПереченьСопроводительныхДокументов                                КАК ПереченьСопроводительныхДокументов,
	|	АктОРасхожденияхПослеПриемки.ВызываемыйПредставительПартнера                                   КАК ВызываемыйПредставительПартнера,
	|	АктОРасхожденияхПослеПриемки.ВидДокументаВызоваПредставителяПартнера                           КАК ВидДокументаОВызовеПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.НомерДокументаОВызовеПредставителяПартнера                        КАК НомерДокументаОВызовеПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.ДатаДокументаОВызовеПредставителяПартнера                         КАК ДатаДокументаОВызовеПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.Грузоотправитель                                                  КАК Грузоотправитель,
	|	АктОРасхожденияхПослеПриемки.Производитель                                                     КАК Производитель,
	|	АктОРасхожденияхПослеПриемки.Контрагент                                                        КАК Поставщик,
	|	АктОРасхожденияхПослеПриемки.КонтрагентСтраховойКомпании                                       КАК СтраховаяКомпания,
	|	АктОРасхожденияхПослеПриемки.НомерДоговораПоставки                                             КАК НомерДоговораПоставки,
	|	АктОРасхожденияхПослеПриемки.ДатаДоговораПоставки                                              КАК ДатаДоговораПоставки,
	|	АктОРасхожденияхПослеПриемки.НомерКоммерческогоАкта                                            КАК НомерКоммерческогоАкта,
	|	АктОРасхожденияхПослеПриемки.ДатаКоммерческогоАкта                                             КАК ДатаКоммерческогоАкта,
	|	АктОРасхожденияхПослеПриемки.НомерВетеринарногоСвидетельства                                   КАК НомерВетеринарногоСвидетельства,
	|	АктОРасхожденияхПослеПриемки.ДатаВетеринарногоСвидетельства                                    КАК ДатаВетеринарногоСвидетельства,
	|	АктОРасхожденияхПослеПриемки.НомерЖелезнодорожнойНакладной                                     КАК НомерЖелезнодорожнойНакладной,
	|	АктОРасхожденияхПослеПриемки.ДатаЖелезнодорожнойНакладной                                      КАК ДатаЖелезнодорожнойНакладной,
	|	АктОРасхожденияхПослеПриемки.СпособДоставки                                                    КАК СпособДоставки,
	|	АктОРасхожденияхПослеПриемки.НомерТранспортногоСредства                                        КАК НомерТранспортногоСредства,
	|	АктОРасхожденияхПослеПриемки.ДатаОтправленияТоваров                                            КАК ДатаОтправленияТовара,
	|	АктОРасхожденияхПослеПриемки.ПунктОтправления                                                  КАК ПунктОтправления,
	|	АктОРасхожденияхПослеПриемки.СкладОтправителяТовара                                            КАК СкладОтправителяТовара,
	|	АктОРасхожденияхПослеПриемки.СпособОпределенияКоличества                                       КАК СпособОпределенияКоличестваТовара,
	|	АктОРасхожденияхПослеПриемки.ЗаключениеКомиссии                                                КАК ЗаключениеКомиссии,
	|	АктОРасхожденияхПослеПриемки.Приложение                                                        КАК Приложение,
	|	АктОРасхожденияхПослеПриемки.ДокументУдостоверяющийПолномочияПредставителяПартнера             КАК ДокументУдостоверяющийПолномочияПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.НомерДокументаУдостоверяющегоПолномочияПредставителяПартнера      КАК НомерДокументаУдостоверяющегоПолномочияПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.ДатаВыдачиДокументаУдостоверяющегоПолномочияПредставителяПартнера КАК ДатаВыдачиДокументаУдостоверяющегоПолномочияПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.КоличествоЛистовПриложения КАК КоличествоЛистовПриложения,
	|	АктОРасхожденияхПослеПриемки.РешениеРуководителя                                               КАК РешениеРуководителя,
	|	АктОРасхожденияхПослеПриемки.КладовщикПринявшийТовар                                           КАК КладовщикПринявшийТовар,
	|	АктОРасхожденияхПослеПриемки.ПредседательКомиссии                                              КАК ПредседательКомиссии,
	|	АктОРасхожденияхПослеПриемки.ДолжностьПредседателяКомиссии                                     КАК ДолжностьПредседателяКомиссии,
	|	АктОРасхожденияхПослеПриемки.ЧленКомиссии1                                                     КАК ЧленКомиссии1,
	|	АктОРасхожденияхПослеПриемки.ДолжностьЧленаКомиссии1                                           КАК ДолжностьЧленаКомиссии1,
	|	АктОРасхожденияхПослеПриемки.ЧленКомиссии2                                                     КАК ЧленКомиссии2,
	|	АктОРасхожденияхПослеПриемки.ДолжностьЧленаКомиссии2                                           КАК ДолжностьЧленаКомиссии2,
	|	АктОРасхожденияхПослеПриемки.ЧленКомиссии3                                                     КАК ЧленКомиссии3,
	|	АктОРасхожденияхПослеПриемки.ДолжностьЧленаКомиссии3                                           КАК ДолжностьЧленаКомиссии3,
	|	АктОРасхожденияхПослеПриемки.ПриемкаТоваров.(
	|		НомерСтроки КАК НомерСтроки,
	|		ДатаПрибытияВПунктНазначения КАК ДатаПрибытия,
	|		ДатаНачалаПриемки КАК ДатаНачалаПриемки,
	|		ДатаПриостановленияПриемки КАК ДатаПриостановленияПриемки,
	|		ДатаВозобновленияПриемки КАК ДатаВозобновленияПриемки,
	|		ДатаОкончанияПриемки КАК ДатаОкончанияПриемки
	|	)                                                                                              КАК ТаблицаПриемкиТоваров,
	|	АктОРасхожденияхПослеПриемки.СостояниеТарыИУпаковки                                            КАК СостояниеТовараВМоментОсмотра,
	|	АктОРасхожденияхПослеПриемки.МестоОпределенияКоличества                                        КАК ЗаключениеОПричинахОбразованияНедостачи
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки КАК АктОРасхожденияхПослеПриемки
	|ГДЕ
	|	АктОРасхожденияхПослеПриемки.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////3
	|ВЫБРАТЬ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка                                                                КАК Ссылка,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура                                                          КАК Номенклатура,
	|	АктОРасхожденияхПослеПриемкиТовары.НоменклатураПартнера                                                  КАК НоменклатураПартнера,
	|	АктОРасхожденияхПослеПриемкиТовары.Характеристика                                                        КАК Характеристика,
	|	АктОРасхожденияхПослеПриемкиТовары.Упаковка                                                              КАК Упаковка,
	|	АктОРасхожденияхПослеПриемкиТовары.Цена                                                                  КАК Цена,
	|	АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу                                                 КАК КоличествоПоДокументам,
	|	АктОРасхожденияхПослеПриемкиТовары.СуммаПоДокументу                                                      КАК СуммаПоДокументам,
	|	АктОРасхожденияхПослеПриемкиТовары.СтавкаНДС                                                             КАК СтавкаНДС,
	|	АктОРасхожденияхПослеПриемкиТовары.СуммаНДСПоДокументу                                                   КАК СуммаНДСПоДокументам,
	|	АктОРасхожденияхПослеПриемкиТовары.Количество                                                            КАК КоличествоПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.Сумма                                                                 КАК СуммаПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.СуммаНДС                                                              КАК СуммаНДСПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.Код                                                      КАК Код,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.Артикул                                                  КАК Артикул,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.ЕдиницаИзмерения                                         КАК ЕдиницаИзмерения,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.ЕдиницаИзмерения.Код                                     КАК КодПоОКЕИ,
	|	АктОРасхожденияхПослеПриемкиТовары.Количество - АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу КАК КоличествоОтклонение,
	|	АктОРасхожденияхПослеПриемкиТовары.Сумма - АктОРасхожденияхПослеПриемкиТовары.СуммаПоДокументу           КАК СуммаОтклонение,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.НаименованиеПолное                                       КАК НоменклатураНаименование,
	|	АктОРасхожденияхПослеПриемкиТовары.Характеристика.НаименованиеПолное                                     КАК ХарактеристикаНаименование,
	|	ВЫБОР
	|		КОГДА АктОРасхожденияхПослеПриемкиТовары.Ссылка.ЦенаВключаетНДС
	|			ТОГДА АктОРасхожденияхПослеПриемкиТовары.Сумма
	|		ИНАЧЕ АктОРасхожденияхПослеПриемкиТовары.Сумма + АктОРасхожденияхПослеПриемкиТовары.СуммаНДС
	|	КОНЕЦ                                                                                                    КАК СуммаСНДСПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка.ЦенаВключаетНДС                                                КАК ЦенаВключаетНДСПоДокументам,
	|	АктОРасхожденияхПослеПриемкиТовары.НомерСтроки                                                           КАК НомерСтроки,
	|	""""                                                                                                     КАК ТекстовоеОписание
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////4
	|ВЫБРАТЬ
	|	ПериодыКурсовВалютДокументов.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПериодыКурсовВалютДокументов.Ссылка.Валюта = КурсыВалют.Валюта
	|				ТОГДА ЕСТЬNULL(КурсыВалют.Курс, 1)
	|		КОНЕЦ) КАК КурсВалютыДокумента,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПериодыКурсовВалютДокументов.Ссылка.Валюта = КурсыВалют.Валюта
	|				ТОГДА ЕСТЬNULL(КурсыВалют.Кратность, 1)
	|		КОНЕЦ) КАК КратностьВалютыДокумента,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА &ВалютаРегламентированногоУчета = КурсыВалют.Валюта
	|				ТОГДА ЕСТЬNULL(КурсыВалют.Курс, 1)
	|		КОНЕЦ) КАК КурсВалютыРегламентированногоУчета,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА &ВалютаРегламентированногоУчета = КурсыВалют.Валюта
	|				ТОГДА ЕСТЬNULL(КурсыВалют.Кратность, 1)
	|		КОНЕЦ) КАК КратностьВалютыРегламентированногоУчета,
	|	ВЫБОР
	|		КОГДА &ВалютаРегламентированногоУчета = ПериодыКурсовВалютДокументов.Ссылка.Валюта
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПересчетНеТребуется
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеДокумента.Ссылка КАК Ссылка,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ДанныеДокумента.Валюта = КурсыВалют.Валюта
	|					ТОГДА КурсыВалют.Период
	|			КОНЕЦ) КАК ПериодВалютаДокумента,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА &ВалютаРегламентированногоУчета = КурсыВалют.Валюта
	|					ТОГДА КурсыВалют.Период
	|			КОНЕЦ) КАК ПериодВалютаРегламентированногоУчета
	|	ИЗ
	|		Документ.АктОРасхожденияхПослеПриемки КАК ДанныеДокумента
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|			ПО ДанныеДокумента.Дата >= КурсыВалют.Период
	|				И (ДанныеДокумента.Валюта = КурсыВалют.Валюта
	|					ИЛИ &ВалютаРегламентированногоУчета = КурсыВалют.Валюта)
	|	ГДЕ
	|		ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеДокумента.Ссылка) КАК ПериодыКурсовВалютДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО (ПериодыКурсовВалютДокументов.Ссылка.Валюта = КурсыВалют.Валюта
	|					И ПериодыКурсовВалютДокументов.ПериодВалютаДокумента = КурсыВалют.Период
	|				ИЛИ &ВалютаРегламентированногоУчета = КурсыВалют.Валюта
	|					И ПериодыКурсовВалютДокументов.ПериодВалютаРегламентированногоУчета = КурсыВалют.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодыКурсовВалютДокументов.Ссылка,
	|	ВЫБОР
	|		КОГДА &ВалютаРегламентированногоУчета = ПериодыКурсовВалютДокументов.Ссылка.Валюта
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());

	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДанныхПечати = Новый Структура;
	СтруктураДанныхПечати.Вставить("ДанныеСчетовФактур", ПакетРезультатов[1]);
	СтруктураДанныхПечати.Вставить("ДанныеПечати",       ПакетРезультатов[2]);
	СтруктураДанныхПечати.Вставить("ДанныеТоваров",      ПакетРезультатов[3]);
	СтруктураДанныхПечати.Вставить("ДанныеКурсовВалют",  ПакетРезультатов[4]);
	
	Возврат СтруктураДанныхПечати;
	
КонецФункции

// Возвращает данные, необходимые для печатной формы "Акты о расхождениях".
// 
// Параметры:
// 	ПараметрыПечати - Структура - дополнительные настройки печати
// 	МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать
// 	
// Возвращаемое значение:
// 	Структура - Содержит в себе данные документа:
// 	* ДанныеСчетовФактур          - РезультатЗапроса - 
// 	* ДанныеПечати                - РезультатЗапроса - 
// 	* ДанныеТовары                - РезультатЗапроса - 
// 	* ДанныеТоваровПоДокументам   - РезультатЗапроса - 
// 	* ДанныеКурсовВалют           - РезультатЗапроса - 
//
Функция ПолучитьДанныеДляПечатнойФормыТОРГ2(ПараметрыПечати, МассивОбъектов) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст ="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АктОРасхожденияхПослеПриемкиТовары.ДокументОснование КАК ДокументОснование,
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка            КАК АктОРасхождениях
	|ПОМЕСТИТЬ ДокументыОснованияАкта
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////1
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА АктОРасхожденияхПослеПриемкиТовары.Количество - АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу <> 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ)                                КАК ЕстьРасхождения,
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка КАК АктОРасхождениях
	|ПОМЕСТИТЬ ЕстьРасхожденияПоДокументам
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка В (&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////////2
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА АктОРасхожденияхПослеПриемкиШтрихкодыУпаковокРасхождения.ЗначениеШтрихкода = """"
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)                                                              КАК ЕстьРасхождения,
	|	АктОРасхожденияхПослеПриемкиШтрихкодыУпаковокРасхождения.Номенклатура   КАК Номенклатура,
	|	АктОРасхожденияхПослеПриемкиШтрихкодыУпаковокРасхождения.Характеристика КАК Характеристика,
	|	АктОРасхожденияхПослеПриемкиШтрихкодыУпаковокРасхождения.Ссылка         КАК АктОРасхождениях
	|ПОМЕСТИТЬ ЕстьРасхожденияПоКодамМаркировки
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.ШтрихкодыУпаковокРасхождения КАК АктОРасхожденияхПослеПриемкиШтрихкодыУпаковокРасхождения
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиШтрихкодыУпаковокРасхождения.Ссылка В (&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	АктОРасхожденияхПослеПриемкиШтрихкодыУпаковокРасхождения.Ссылка,
	|	АктОРасхожденияхПослеПриемкиШтрихкодыУпаковокРасхождения.Номенклатура,
	|	АктОРасхожденияхПослеПриемкиШтрихкодыУпаковокРасхождения.Характеристика
	|;
	|////////////////////////////////////////////////////////////////////////////////3
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыОснованияАкта.АктОРасхождениях КАК ДокументОснование,
	|	СтрокиОснований.ДокументОснование       КАК ДокументОснованиеРеализация,
	|	СчетФактураПолученный.НомерИсправления  КАК НомерИсправления,
	|	СчетФактураПолученный.Номер             КАК НомерСчетаФактуры,
	|	СчетФактураПолученный.Дата              КАК ДатаСчетаФактуры
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СтрокиОснований
	|		ПО СтрокиОснований.Ссылка = СчетФактураПолученный.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыОснованияАкта КАК ДокументыОснованияАкта
	|		ПО (ДокументыОснованияАкта.ДокументОснование = СтрокиОснований.ДокументОснование)
	|ГДЕ
	|	НЕ СчетФактураПолученный.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыОснованияАкта.АктОРасхождениях КАК ДокументОснование,
	|	СтрокиОснований.ДокументОснование       КАК ДокументОснованиеРеализация,
	|	СчетФактураПолученный.НомерИсправления  КАК НомерИсправления,
	|	СчетФактураПолученный.Номер             КАК НомерСчетаФактуры,
	|	СчетФактураПолученный.Дата              КАК ДатаСчетаФактуры
	|ИЗ
	|	Документ.СчетФактураПолученныйНалоговыйАгент КАК СчетФактураПолученный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученныйНалоговыйАгент.ДокументыОснования КАК СтрокиОснований
	|		ПО СтрокиОснований.Ссылка = СчетФактураПолученный.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыОснованияАкта КАК ДокументыОснованияАкта
	|		ПО (ДокументыОснованияАкта.ДокументОснование = СтрокиОснований.ДокументОснование)
	|ГДЕ
	|	НЕ СчетФактураПолученный.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетФактураПолученный.НомерИсправления УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////4
	|ВЫБРАТЬ
	|	АктОРасхожденияхПослеПриемки.Ссылка                                                            КАК Ссылка,
	|	АктОРасхожденияхПослеПриемки.Номер                                                             КАК НомерДокумента,
	|	АктОРасхожденияхПослеПриемки.Дата                                                              КАК ДатаДокумента,
	|	АктОРасхожденияхПослеПриемки.Организация                                                       КАК Организация,
	|	АктОРасхожденияхПослеПриемки.Организация.Префикс                                               КАК Префикс,
	|	АктОРасхожденияхПослеПриемки.Организация.КодПоОКПО                                             КАК ОрганизацияПоОКПО,
	|	ПРЕДСТАВЛЕНИЕ(АктОРасхожденияхПослеПриемки.Подразделение)                                      КАК ПредставлениеПодразделения,
	|	АктОРасхожденияхПослеПриемки.Руководитель                                                      КАК Руководитель,
	|	АктОРасхожденияхПослеПриемки.ДолжностьРуководителя                                             КАК ДолжностьРуководителя,
	|	АктОРасхожденияхПослеПриемки.ГлавныйБухгалтер                                                  КАК ГлавныйБухгалтер,
	|	АктОРасхожденияхПослеПриемки.МестоПриемкиТовара                                                КАК МестоПриемкиТовара,
	|	АктОРасхожденияхПослеПриемки.Валюта                                                            КАК Валюта,
	|	АктОРасхожденияхПослеПриемки.ОснованиеДляСоставленияАкта                                       КАК ОснованиеДляСоставленияАкта,
	|	АктОРасхожденияхПослеПриемки.НомерОснования                                                    КАК НомерОснования,
	|	АктОРасхожденияхПослеПриемки.ДатаОснования                                                     КАК ДатаОснования,
	|	АктОРасхожденияхПослеПриемки.ДатаДоставкиТоваров                                               КАК ДатаДоставкиТоваров,
	|	АктОРасхожденияхПослеПриемки.ДатаОтправленияТоваров                                            КАК ДатаОтправленияТоваров,
	|	АктОРасхожденияхПослеПриемки.ПереченьСопроводительныхДокументов                                КАК ПереченьСопроводительныхДокументов,
	|	АктОРасхожденияхПослеПриемки.ВызываемыйПредставительПартнера                                   КАК ВызываемыйПредставительПартнера,
	|	АктОРасхожденияхПослеПриемки.ВидДокументаВызоваПредставителяПартнера                           КАК ВидДокументаОВызовеПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.НомерДокументаОВызовеПредставителяПартнера                        КАК НомерДокументаОВызовеПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.ДатаДокументаОВызовеПредставителяПартнера                         КАК ДатаДокументаОВызовеПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.Грузоотправитель                                                  КАК Грузоотправитель,
	|	АктОРасхожденияхПослеПриемки.Производитель                                                     КАК Производитель,
	|	АктОРасхожденияхПослеПриемки.Контрагент                                                        КАК Поставщик,
	|	АктОРасхожденияхПослеПриемки.КонтрагентСтраховойКомпании                                       КАК СтраховаяКомпания,
	|	АктОРасхожденияхПослеПриемки.НомерДоговораПоставки                                             КАК НомерДоговораПоставки,
	|	АктОРасхожденияхПослеПриемки.ДатаДоговораПоставки                                              КАК ДатаДоговораПоставки,
	|	АктОРасхожденияхПослеПриемки.НомерКоммерческогоАкта                                            КАК НомерКоммерческогоАкта,
	|	АктОРасхожденияхПослеПриемки.ДатаКоммерческогоАкта                                             КАК ДатаКоммерческогоАкта,
	|	АктОРасхожденияхПослеПриемки.НомерУдостоверенияОКачестве                                       КАК НомерУдостоверенияОКачестве,
	|	АктОРасхожденияхПослеПриемки.ДатаУдостоверенияОКачестве                                        КАК ДатаУдостоверенияОКачестве,
	|	АктОРасхожденияхПослеПриемки.НомерВетеринарногоСвидетельства                                   КАК НомерВетеринарногоСвидетельства,
	|	АктОРасхожденияхПослеПриемки.ДатаВетеринарногоСвидетельства                                    КАК ДатаВетеринарногоСвидетельства,
	|	АктОРасхожденияхПослеПриемки.НомерЖелезнодорожнойНакладной                                     КАК НомерЖелезнодорожнойНакладной,
	|	АктОРасхожденияхПослеПриемки.ДатаЖелезнодорожнойНакладной                                      КАК ДатаЖелезнодорожнойНакладной,
	|	АктОРасхожденияхПослеПриемки.НомерКоносамента                                                  КАК НомерКоносамента,
	|	АктОРасхожденияхПослеПриемки.ДатаКоносамента                                                   КАК ДатаКоносамента,
	|	АктОРасхожденияхПослеПриемки.СпособДоставки                                                    КАК СпособДоставки,
	|	АктОРасхожденияхПослеПриемки.НомерТранспортногоСредства                                        КАК НомерТранспортногоСредства,
	|	АктОРасхожденияхПослеПриемки.ДатаОтправленияТоваров                                            КАК ДатаОтправленияТовара,
	|	АктОРасхожденияхПослеПриемки.ПунктОтправления                                                  КАК ПунктОтправления,
	|	АктОРасхожденияхПослеПриемки.СкладОтправителяТовара                                            КАК СкладОтправителяТовара,
	|	АктОРасхожденияхПослеПриемки.СведенияОСостоянииТранспортаПоСопроводительнымДокументам          КАК СостояниеТранспортаПоДокументам,
	|	АктОРасхожденияхПослеПриемки.СведенияОСостоянииТранспортаПоФакту                               КАК СостояниеТранспортаПоФакту,
	|	АктОРасхожденияхПослеПриемки.УсловияХраненияТовараДоВскрытияНаСкладеПолучателя                 КАК УсловияХраненияТовараДоВскрытия,
	|	АктОРасхожденияхПослеПриемки.ДополнительнаяИнформация                						   КАК ДополнительнаяИнформация,
	|	АктОРасхожденияхПослеПриемки.СведенияОТемпературеПриРазгрузке                                  КАК ТемператураПриРазгрузке,
	|	АктОРасхожденияхПослеПриемки.СостояниеТарыИУпаковки                                            КАК СостояниеТарыИУпаковки,
	|	АктОРасхожденияхПослеПриемки.СодержаниеНаружнойМаркировки                                      КАК СодержаниеНаружнойМаркировки,
	|	АктОРасхожденияхПослеПриемки.ДатаВскрытияТары                                                  КАК ДатаВскрытияТары,
	|	АктОРасхожденияхПослеПриемки.ОрганизацияВзвесившаяИОпломбировавшаяТовар                        КАК ОрганизацияВзвесившаяИОпломбировавшаяТовар,
	|	АктОРасхожденияхПослеПриемки.ПорядокОтбораТовараДляВыборочнойПроверки                          КАК ПорядокОтбораТовараДляВыборочнойПроверки,
	|	АктОРасхожденияхПослеПриемки.СпособОпределенияКоличества                                       КАК СпособОпределенияКоличества,
	|	АктОРасхожденияхПослеПриемки.МестоОпределенияКоличества                                        КАК МестоОпределенияКоличества,
	|	АктОРасхожденияхПослеПриемки.СведенияОбИсправностиВесоизмерительныхПриборов                    КАК СведенияОбИсправностиВесоизмерительныхПриборов,
	|	АктОРасхожденияхПослеПриемки.ПрочиеДанные                                                      КАК ПрочиеДанные,
	|	АктОРасхожденияхПослеПриемки.ПодробноеОписаниеДефектов                                         КАК ПодробноеОписаниеДефектов,
	|	АктОРасхожденияхПослеПриемки.ЗаключениеКомиссии                                                КАК ЗаключениеКомиссии,
	|	АктОРасхожденияхПослеПриемки.Приложение                                                        КАК Приложение,
	|	АктОРасхожденияхПослеПриемки.ДокументУдостоверяющийПолномочияПредставителяПартнера             КАК ДокументУдостоверяющийПолномочияПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.НомерДокументаУдостоверяющегоПолномочияПредставителяПартнера      КАК НомерДокументаУдостоверяющегоПолномочияПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.ДатаВыдачиДокументаУдостоверяющегоПолномочияПредставителяПартнера КАК ДатаВыдачиДокументаУдостоверяющегоПолномочияПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.КоличествоЛистовПриложения                                        КАК КоличествоЛистовПриложения,
	|	АктОРасхожденияхПослеПриемки.РешениеРуководителя                                               КАК РешениеРуководителя,
	|	АктОРасхожденияхПослеПриемки.КладовщикПринявшийТовар                                           КАК КладовщикПринявшийТовар,
	|	АктОРасхожденияхПослеПриемки.ПредседательКомиссии                                              КАК ПредседательКомиссии,
	|	АктОРасхожденияхПослеПриемки.ДолжностьПредседателяКомиссии                                     КАК ДолжностьПредседателяКомиссии,
	|	АктОРасхожденияхПослеПриемки.ЧленКомиссии1                                                     КАК ЧленКомиссии1,
	|	АктОРасхожденияхПослеПриемки.ДолжностьЧленаКомиссии1                                           КАК ДолжностьЧленаКомиссии1,
	|	АктОРасхожденияхПослеПриемки.ЧленКомиссии2                                                     КАК ЧленКомиссии2,
	|	АктОРасхожденияхПослеПриемки.ДолжностьЧленаКомиссии2                                           КАК ДолжностьЧленаКомиссии2,
	|	АктОРасхожденияхПослеПриемки.ЧленКомиссии3                                                     КАК ЧленКомиссии3,
	|	АктОРасхожденияхПослеПриемки.ДолжностьЧленаКомиссии3                                           КАК ДолжностьЧленаКомиссии3,
	|	АктОРасхожденияхПослеПриемки.ПриемкаТоваров.(
	|		НомерСтроки КАК НомерСтроки,
	|		ДатаПрибытияВПунктНазначения КАК ДатаПрибытияВПунктНазначения,
	|		ДатаВскрытия КАК ДатаВскрытия,
	|		ДатаВыдачиОрганизациейТранспорта КАК ДатаВыдачи,
	|		ДатаДоставкиНаСкладПолучателя КАК ДатаДоставкиНаСклад,
	|		ДатаНачалаРазгрузки КАК ДатаНачалаРазгрузки,
	|		ДатаНачалаПриемки КАК ДатаНачалаПриемки,
	|		ДатаПриостановленияПриемки КАК ДатаПриостановленияПриемки,
	|		ДатаВозобновленияПриемки КАК ДатаВозобновленияПриемки,
	|		ДатаОкончанияПриемки КАК ДатаОкончанияПриемки
	|	)                                                                                              КАК ТаблицаПриемкиТоваров,
	|	АктОРасхожденияхПослеПриемки.МассаБруттоПоДаннымПроизводителя                                  КАК МассаБруттоПоДаннымПроизводителя,
	|	АктОРасхожденияхПослеПриемки.МассаБруттоВПунктеОтправления                                     КАК МассаБруттоВПунктеОтправления,
	|	АктОРасхожденияхПослеПриемки.МассаБруттоВПунктеНазначения                                      КАК МассаБруттоВПунктеНазначения,
	|	АктОРасхожденияхПослеПриемки.КоличествоМестПоДокументамГрузоотправителя                        КАК КоличествоМестПоДокументам,
	|	АктОРасхожденияхПослеПриемки.КоличествоМестПоФакту                                             КАК КоличествоМестПоФакту,
	|	АктОРасхожденияхПослеПриемки.КоличествоМестПоФакту - АктОРасхожденияхПослеПриемки.КоличествоМестПоДокументамГрузоотправителя КАК КоличествоМестРасхождение,
	|	АктОРасхожденияхПослеПриемки.МассаБруттоПоДокументамГрузоотправителя                           КАК МассаБруттоПоДокументам,
	|	АктОРасхожденияхПослеПриемки.МассаБруттоПоФакту                                                КАК МассаБруттоПоФакту,
	|	АктОРасхожденияхПослеПриемки.МассаБруттоПоФакту - АктОРасхожденияхПослеПриемки.МассаБруттоПоДокументамГрузоотправителя КАК МассаБруттоРасхождение,
	|	АктОРасхожденияхПослеПриемки.МассаНеттоПоДокументамГрузоотправителя                            КАК МассаНеттоПоДокументам,
	|	АктОРасхожденияхПослеПриемки.МассаНеттоПоФакту                                                 КАК МассаНеттоПоФакту,
	|	АктОРасхожденияхПослеПриемки.МассаНеттоПоФакту - АктОРасхожденияхПослеПриемки.МассаНеттоПоДокументамГрузоотправителя КАК МассаНеттоРасхождение,
	|	АктОРасхожденияхПослеПриемки.МассаТарыПоДокументамГрузоотправителя                             КАК МассаТарыПоДокументам,
	|	АктОРасхожденияхПослеПриемки.МассаТарыПоФакту                                                  КАК МассаТарыПоФакту,
	|	АктОРасхожденияхПослеПриемки.МассаТарыПоФакту - АктОРасхожденияхПослеПриемки.МассаТарыПоДокументамГрузоотправителя КАК МассаТарыРасхождение,
	|	АктОРасхожденияхПослеПриемки.СтепеньЗаполненияПоДокументамГрузоотправителя                     КАК СтепеньЗаполненияПоДокументам,
	|	АктОРасхожденияхПослеПриемки.СтепеньЗаполненияПоФакту                                          КАК СтепеньЗаполненияПоФакту,
	|	ЛОЖЬ                                                                                           КАК ОшибкаНетРасхождений,
	|	АктОРасхожденияхПослеПриемки.ЦенаВключаетНДС                                                   КАК ЦенаВключаетНДС,
	|	ЕстьРасхожденияПоДокументам.ЕстьРасхождения
	|ИЗ
	|	ЕстьРасхожденияПоДокументам КАК ЕстьРасхожденияПоДокументам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктОРасхожденияхПослеПриемки КАК АктОРасхожденияхПослеПриемки
	|		ПО ЕстьРасхожденияПоДокументам.АктОРасхождениях = АктОРасхожденияхПослеПриемки.Ссылка
	|ГДЕ
	|	АктОРасхожденияхПослеПриемки.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////5
	|ВЫБРАТЬ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка                            КАК Ссылка,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура                      КАК Номенклатура,
	|	АктОРасхожденияхПослеПриемкиТовары.НоменклатураПартнера              КАК НоменклатураПартнера,
	|	АктОРасхожденияхПослеПриемкиТовары.НоменклатураПартнера.Артикул      КАК НоменклатураПартнераАртикул,
	|	АктОРасхожденияхПослеПриемкиТовары.НоменклатураПартнера.Идентификатор    
	|																		 КАК Идентификатор,
	|	АктОРасхожденияхПослеПриемкиТовары.Характеристика                    КАК Характеристика,
	|	АктОРасхожденияхПослеПриемкиТовары.Упаковка                          КАК Упаковка,
	|	АктОРасхожденияхПослеПриемкиТовары.Упаковка.Наименование             КАК ВидУпаковки,
	|	АктОРасхожденияхПослеПриемкиТовары.КоличествоУпаковок                КАК КоличествоУпаковок,
	|	АктОРасхожденияхПослеПриемкиТовары.КоличествоУпаковокПоДокументу     КАК КоличествоУпаковокПоДокументу,
	|	АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу             КАК КоличествоПоДокументам,
	|	АктОРасхожденияхПослеПриемкиТовары.СуммаПоДокументу                  КАК СуммаПоДокументам,
	|	АктОРасхожденияхПослеПриемкиТовары.СуммаНДСПоДокументу               КАК СуммаНДСПоДокументам,
	|	АктОРасхожденияхПослеПриемкиТовары.СуммаСНДСПоДокументу              КАК СуммаСНДСПоДокументам,
	|	АктОРасхожденияхПослеПриемкиТовары.Количество                        КАК КоличествоПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.Цена                              КАК Цена,
	|	АктОРасхожденияхПослеПриемкиТовары.Цена                              КАК ЦенаПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.Сумма                             КАК СуммаПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.СтавкаНДС                         КАК СтавкаНДС,
	|	АктОРасхожденияхПослеПриемкиТовары.СуммаНДС                          КАК СуммаНДСПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.СуммаСНДС                         КАК СуммаСНДСПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.Код                  КАК Код,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.Артикул              КАК Артикул,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.ЕдиницаИзмерения     КАК ЕдиницаИзмерения,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.ЕдиницаИзмерения.Наименование 
	|																		 КАК ЕдиницаИзмеренияНаименование,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.ЕдиницаИзмерения.Код КАК КодПоОКЕИ,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	ВЫБОР
	|		КОГДА АктОРасхожденияхПослеПриемкиТовары.Количество - АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу > 0
	|			ТОГДА АктОРасхожденияхПослеПриемкиТовары.Количество - АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                                КАК КоличествоИзлишек,
	|	ВЫБОР
	|		КОГДА АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу - АктОРасхожденияхПослеПриемкиТовары.Количество > 0
	|			ТОГДА АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу - АктОРасхожденияхПослеПриемкиТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                                КАК КоличествоНедостача,
	|	ВЫБОР
	|		КОГДА АктОРасхожденияхПослеПриемкиТовары.Сумма - АктОРасхожденияхПослеПриемкиТовары.СуммаПоДокументу > 0
	|			ТОГДА АктОРасхожденияхПослеПриемкиТовары.Сумма - АктОРасхожденияхПослеПриемкиТовары.СуммаПоДокументу
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                                КАК СуммаИзлишек,
	|	ВЫБОР
	|		КОГДА АктОРасхожденияхПослеПриемкиТовары.СуммаПоДокументу - АктОРасхожденияхПослеПриемкиТовары.Сумма > 0
	|			ТОГДА АктОРасхожденияхПослеПриемкиТовары.СуммаПоДокументу - АктОРасхожденияхПослеПриемкиТовары.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                                КАК СуммаНедостача,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.НаименованиеПолное   КАК НоменклатураНаименование,
	|	АктОРасхожденияхПослеПриемкиТовары.Характеристика.НаименованиеПолное КАК ХарактеристикаНаименование,
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка.ЦенаВключаетНДС            КАК ЦенаВключаетНДСПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка.ЦенаВключаетНДС            КАК ЦенаВключаетНДСПоДокументам,
	|	АктОРасхожденияхПослеПриемкиТовары.НомерСтроки                       КАК НомерСтроки,
	|	АктОРасхожденияхПослеПриемкиТовары.КомментарийМенеджера              КАК КомментарийМенеджера,
	|	АктОРасхожденияхПослеПриемкиТовары.ДокументОснование                 КАК ДокументОснование,
	|	АктОРасхожденияхПослеПриемкиТовары.НомерПаспорта                     КАК НомерПаспорта,
	|	""""                                                                 КАК ТекстовоеОписание
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьРасхожденияПоКодамМаркировки КАК Расхождения
	|		ПО АктОРасхожденияхПослеПриемкиТовары.Ссылка = Расхождения.АктОРасхождениях
	|			И АктОРасхожденияхПослеПриемкиТовары.Номенклатура = Расхождения.Номенклатура
	|			И АктОРасхожденияхПослеПриемкиТовары.Характеристика = Расхождения.Характеристика
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка В(&МассивОбъектов)
	|	И (АктОРасхожденияхПослеПриемкиТовары.КоличествоУпаковок <> АктОРасхожденияхПослеПриемкиТовары.КоличествоУпаковокПоДокументу
	|		ИЛИ ЕСТЬNULL(Расхождения.ЕстьРасхождения, ЛОЖЬ))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////6
	|ВЫБРАТЬ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка                              КАК Ссылка,
	|	АктОРасхожденияхПослеПриемкиТовары.Упаковка                            КАК Упаковка,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.ЕдиницаИзмерения       КАК ЕдиницаИзмерения,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.Наименование           КАК НоменклатураНаименование,
	|	АктОРасхожденияхПослеПриемкиТовары.Характеристика.Наименование         КАК ХарактеристикаНаименование,
	|	АктОРасхожденияхПослеПриемкиТовары.НоменклатураПартнера.Наименование   КАК НоменклатураПартнераНаименование,
	|	АктОРасхожденияхПослеПриемкиТовары.НоменклатураПартнера.Артикул        КАК НоменклатураПартнераАртикул,
	|	АктОРасхожденияхПослеПриемкиТовары.НомерСтроки                         КАК НомерСтроки,
	|	""""                                                                   КАК ТекстовоеОписание,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура                        КАК Номенклатура
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка В(&МассивОбъектов)
	|	И АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////7
	|ВЫБРАТЬ
	|	ПериодыКурсовВалютДокументов.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПериодыКурсовВалютДокументов.Ссылка.Валюта = КурсыВалют.Валюта
	|				ТОГДА ЕСТЬNULL(КурсыВалют.Курс, 1)
	|		КОНЕЦ) КАК КурсВалютыДокумента,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПериодыКурсовВалютДокументов.Ссылка.Валюта = КурсыВалют.Валюта
	|				ТОГДА ЕСТЬNULL(КурсыВалют.Кратность, 1)
	|		КОНЕЦ) КАК КратностьВалютыДокумента,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА &ВалютаРегламентированногоУчета = КурсыВалют.Валюта
	|				ТОГДА ЕСТЬNULL(КурсыВалют.Курс, 1)
	|		КОНЕЦ) КАК КурсВалютыРегламентированногоУчета,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА &ВалютаРегламентированногоУчета = КурсыВалют.Валюта
	|				ТОГДА ЕСТЬNULL(КурсыВалют.Кратность, 1)
	|		КОНЕЦ) КАК КратностьВалютыРегламентированногоУчета,
	|	ВЫБОР
	|		КОГДА &ВалютаРегламентированногоУчета = ПериодыКурсовВалютДокументов.Ссылка.Валюта
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПересчетНеТребуется
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеДокумента.Ссылка КАК Ссылка,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ДанныеДокумента.Валюта = КурсыВалют.Валюта
	|					ТОГДА КурсыВалют.Период
	|			КОНЕЦ) КАК ПериодВалютаДокумента,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА &ВалютаРегламентированногоУчета = КурсыВалют.Валюта
	|					ТОГДА КурсыВалют.Период
	|			КОНЕЦ) КАК ПериодВалютаРегламентированногоУчета
	|	ИЗ
	|		Документ.АктОРасхожденияхПослеПриемки КАК ДанныеДокумента
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|			ПО ДанныеДокумента.Дата >= КурсыВалют.Период
	|				И (ДанныеДокумента.Валюта = КурсыВалют.Валюта
	|					ИЛИ &ВалютаРегламентированногоУчета = КурсыВалют.Валюта)
	|	ГДЕ
	|		ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеДокумента.Ссылка) КАК ПериодыКурсовВалютДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО (ПериодыКурсовВалютДокументов.Ссылка.Валюта = КурсыВалют.Валюта
	|					И ПериодыКурсовВалютДокументов.ПериодВалютаДокумента = КурсыВалют.Период
	|				ИЛИ &ВалютаРегламентированногоУчета = КурсыВалют.Валюта
	|					И ПериодыКурсовВалютДокументов.ПериодВалютаРегламентированногоУчета = КурсыВалют.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодыКурсовВалютДокументов.Ссылка,
	|	ВЫБОР
	|		КОГДА &ВалютаРегламентированногоУчета = ПериодыКурсовВалютДокументов.Ссылка.Валюта
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////////8
	|ВЫБРАТЬ
	|	АктОРасхожденияхШтрихкодыУпаковок.Ссылка КАК Ссылка,
	|	АктОРасхожденияхШтрихкодыУпаковок.НомерСтроки КАК НомерСтроки,
	|	АктОРасхожденияхШтрихкодыУпаковок.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
	|	АктОРасхожденияхШтрихкодыУпаковок.ВидУпаковки КАК ВидУпаковки,
	|	АктОРасхожденияхШтрихкодыУпаковок.Количество КАК Количество,
	|	ЛОЖЬ КАК Обработан,
	|	АктОРасхожденияхШтрихкодыУпаковок.Номенклатура КАК Номенклатура,
	|	АктОРасхожденияхШтрихкодыУпаковок.Характеристика КАК Характеристика
	|ИЗ
	|	ДокументыОснованияАкта КАК ДокументыОснованияАкта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктОРасхожденияхПослеПриемки.ШтрихкодыУпаковокФактЭДО КАК АктОРасхожденияхШтрихкодыУпаковок
	|		ПО ДокументыОснованияАкта.АктОРасхождениях = АктОРасхожденияхШтрихкодыУпаковок.Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////////9
	|ВЫБРАТЬ
	|	АктОРасхожденияхУпаковкиРасхождения.Ссылка КАК Ссылка,
	|	АктОРасхожденияхУпаковкиРасхождения.НомерСтроки КАК НомерСтроки,
	|	АктОРасхожденияхУпаковкиРасхождения.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
	|	АктОРасхожденияхУпаковкиРасхождения.ВидУпаковки КАК ВидУпаковки,
	|	АктОРасхожденияхУпаковкиРасхождения.Номенклатура КАК Номенклатура,
	|	АктОРасхожденияхУпаковкиРасхождения.Характеристика КАК Характеристика,
	|	АктОРасхожденияхУпаковкиРасхождения.ТипРасхождения КАК ТипРасхождения,
	|	АктОРасхожденияхУпаковкиРасхождения.Количество КАК Количество,
	|	ЛОЖЬ КАК Обработан
	|ИЗ
	|	ДокументыОснованияАкта КАК ДокументыОснованияАкта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктОРасхожденияхПослеПриемки.ШтрихкодыУпаковокРасхождения КАК АктОРасхожденияхУпаковкиРасхождения
	|		ПО ДокументыОснованияАкта.АктОРасхождениях = АктОРасхожденияхУпаковкиРасхождения.Ссылка
	|";

	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДанныхПечати = Новый Структура;
	СтруктураДанныхПечати.Вставить("ДанныеСчетовФактур",           ПакетРезультатов[3]);
	СтруктураДанныхПечати.Вставить("ДанныеПечати",                 ПакетРезультатов[4]);
	СтруктураДанныхПечати.Вставить("ДанныеТовары",                 ПакетРезультатов[5]);
	СтруктураДанныхПечати.Вставить("ДанныеТоваровПоДокументам",    ПакетРезультатов[6]);
	СтруктураДанныхПечати.Вставить("ДанныеКурсовВалют",            ПакетРезультатов[7]);
	СтруктураДанныхПечати.Вставить("ШтрихкодыУпаковок",            ПакетРезультатов[8]);
	СтруктураДанныхПечати.Вставить("ШтрихкодыУпаковокРасхождения", ПакетРезультатов[9]);
	
	Возврат СтруктураДанныхПечати;
	
КонецФункции

Функция ПолучитьДанныеДляПечатнойФормыТОРГ3(ПараметрыПечати, МассивОбъектов) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст ="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АктОРасхожденияхПослеПриемкиТовары.ДокументОснование КАК ДокументОснование,
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка            КАК АктОРасхождениях
	|ПОМЕСТИТЬ ДокументыОснованияАкта
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////1
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА АктОРасхожденияхПослеПриемкиТовары.Количество - АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу <> 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ)                                КАК ЕстьРасхождения,
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка КАК АктОРасхождениях
	|ПОМЕСТИТЬ ЕстьРасхожденияПоДокументам
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка В (&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////2
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыОснованияАкта.АктОРасхождениях КАК ДокументОснование,
	|	СтрокиОснований.ДокументОснование       КАК ДокументОснованиеРеализация,
	|	СчетФактураПолученный.НомерИсправления  КАК НомерИсправления,
	|	СчетФактураПолученный.Номер             КАК НомерСчетаФактуры,
	|	СчетФактураПолученный.Дата              КАК ДатаСчетаФактуры
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СтрокиОснований
	|		ПО СтрокиОснований.Ссылка = СчетФактураПолученный.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыОснованияАкта КАК ДокументыОснованияАкта
	|		ПО (ДокументыОснованияАкта.ДокументОснование = СтрокиОснований.ДокументОснование)
	|ГДЕ
	|	НЕ СчетФактураПолученный.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыОснованияАкта.АктОРасхождениях КАК ДокументОснование,
	|	СтрокиОснований.ДокументОснование       КАК ДокументОснованиеРеализация,
	|	СчетФактураПолученный.НомерИсправления  КАК НомерИсправления,
	|	СчетФактураПолученный.Номер             КАК НомерСчетаФактуры,
	|	СчетФактураПолученный.Дата              КАК ДатаСчетаФактуры
	|ИЗ
	|	Документ.СчетФактураПолученныйНалоговыйАгент КАК СчетФактураПолученный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученныйНалоговыйАгент.ДокументыОснования КАК СтрокиОснований
	|		ПО СтрокиОснований.Ссылка = СчетФактураПолученный.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыОснованияАкта КАК ДокументыОснованияАкта
	|		ПО (ДокументыОснованияАкта.ДокументОснование = СтрокиОснований.ДокументОснование)
	|ГДЕ
	|	НЕ СчетФактураПолученный.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетФактураПолученный.НомерИсправления УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////3
	|ВЫБРАТЬ
	|	АктОРасхожденияхПослеПриемки.Ссылка                                                            КАК Ссылка,
	|	АктОРасхожденияхПослеПриемки.Номер                                                             КАК НомерДокумента,
	|	АктОРасхожденияхПослеПриемки.Дата                                                              КАК ДатаДокумента,
	|	АктОРасхожденияхПослеПриемки.Организация                                                       КАК Организация,
	|	АктОРасхожденияхПослеПриемки.Организация.Префикс                                               КАК Префикс,
	|	АктОРасхожденияхПослеПриемки.Организация.КодПоОКПО                                             КАК ОрганизацияПоОКПО,
	|	ПРЕДСТАВЛЕНИЕ(АктОРасхожденияхПослеПриемки.Подразделение)                                      КАК ПредставлениеПодразделения,
	|	АктОРасхожденияхПослеПриемки.Руководитель                                                      КАК Руководитель,
	|	АктОРасхожденияхПослеПриемки.ДолжностьРуководителя                                             КАК ДолжностьРуководителя,
	|	АктОРасхожденияхПослеПриемки.ГлавныйБухгалтер                                                  КАК ГлавныйБухгалтер,
	|	АктОРасхожденияхПослеПриемки.МестоПриемкиТовара                                                КАК МестоПриемкиТовара,
	|	АктОРасхожденияхПослеПриемки.Валюта                                                            КАК Валюта,
	|	АктОРасхожденияхПослеПриемки.ОснованиеДляСоставленияАкта                                       КАК ОснованиеДляСоставленияАкта,
	|	АктОРасхожденияхПослеПриемки.НомерОснования                                                    КАК НомерОснования,
	|	АктОРасхожденияхПослеПриемки.ДатаОснования                                                     КАК ДатаОснования,
	|	АктОРасхожденияхПослеПриемки.ДатаДоставкиТоваров                                               КАК ДатаДоставкиТоваров,
	|	АктОРасхожденияхПослеПриемки.ДатаОтправленияТоваров                                            КАК ДатаОтправленияТоваров,
	|	АктОРасхожденияхПослеПриемки.ПереченьСопроводительныхДокументов                                КАК ПереченьСопроводительныхДокументов,
	|	АктОРасхожденияхПослеПриемки.ВызываемыйПредставительПартнера                                   КАК ВызываемыйПредставительПартнера,
	|	АктОРасхожденияхПослеПриемки.ВидДокументаВызоваПредставителяПартнера                           КАК ВидДокументаОВызовеПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.НомерДокументаОВызовеПредставителяПартнера                        КАК НомерДокументаОВызовеПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.ДатаДокументаОВызовеПредставителяПартнера                         КАК ДатаДокументаОВызовеПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.Грузоотправитель                                                  КАК Грузоотправитель,
	|	АктОРасхожденияхПослеПриемки.Производитель                                                     КАК Производитель,
	|	АктОРасхожденияхПослеПриемки.Контрагент                                                        КАК Поставщик,
	|	АктОРасхожденияхПослеПриемки.КонтрагентСтраховойКомпании                                       КАК СтраховаяКомпания,
	|	АктОРасхожденияхПослеПриемки.НомерДоговораПоставки                                             КАК НомерДоговораПоставки,
	|	АктОРасхожденияхПослеПриемки.ДатаДоговораПоставки                                              КАК ДатаДоговораПоставки,
	|	АктОРасхожденияхПослеПриемки.НомерКоммерческогоАкта                                            КАК НомерКоммерческогоАкта,
	|	АктОРасхожденияхПослеПриемки.ДатаКоммерческогоАкта                                             КАК ДатаКоммерческогоАкта,
	|	АктОРасхожденияхПослеПриемки.НомерУдостоверенияОКачестве                                       КАК НомерУдостоверенияОКачестве,
	|	АктОРасхожденияхПослеПриемки.ДатаУдостоверенияОКачестве                                        КАК ДатаУдостоверенияОКачестве,
	|	АктОРасхожденияхПослеПриемки.НомерВетеринарногоСвидетельства                                   КАК НомерВетеринарногоСвидетельства,
	|	АктОРасхожденияхПослеПриемки.ДатаВетеринарногоСвидетельства                                    КАК ДатаВетеринарногоСвидетельства,
	|	АктОРасхожденияхПослеПриемки.НомерЖелезнодорожнойНакладной                                     КАК НомерЖелезнодорожнойНакладной,
	|	АктОРасхожденияхПослеПриемки.ДатаЖелезнодорожнойНакладной                                      КАК ДатаЖелезнодорожнойНакладной,
	|	АктОРасхожденияхПослеПриемки.НомерКоносамента                                                  КАК НомерКоносамента,
	|	АктОРасхожденияхПослеПриемки.ДатаКоносамента                                                   КАК ДатаКоносамента,
	|	АктОРасхожденияхПослеПриемки.СпособДоставки                                                    КАК СпособДоставки,
	|	АктОРасхожденияхПослеПриемки.НомерТранспортногоСредства                                        КАК НомерТранспортногоСредства,
	|	АктОРасхожденияхПослеПриемки.ДатаОтправленияТоваров                                            КАК ДатаОтправленияТовара,
	|	АктОРасхожденияхПослеПриемки.ПунктОтправления                                                  КАК ПунктОтправления,
	|	АктОРасхожденияхПослеПриемки.СкладОтправителяТовара                                            КАК СкладОтправителяТовара,
	|	АктОРасхожденияхПослеПриемки.СведенияОСостоянииТранспортаПоСопроводительнымДокументам          КАК СостояниеТранспортаПоДокументам,
	|	АктОРасхожденияхПослеПриемки.СведенияОСостоянииТранспортаПоФакту                               КАК СостояниеТранспортаПоФакту,
	|	АктОРасхожденияхПослеПриемки.УсловияХраненияТовараДоВскрытияНаСкладеПолучателя                 КАК УсловияХраненияТовараДоВскрытия,
	|	АктОРасхожденияхПослеПриемки.СведенияОТемпературеПриРазгрузке                                  КАК ТемператураПриРазгрузке,
	|	АктОРасхожденияхПослеПриемки.СостояниеТарыИУпаковки                                            КАК СостояниеТарыИУпаковки,
	|	АктОРасхожденияхПослеПриемки.СодержаниеНаружнойМаркировки                                      КАК СодержаниеНаружнойМаркировки,
	|	АктОРасхожденияхПослеПриемки.ДатаВскрытияТары                                                  КАК ДатаВскрытияТары,
	|	АктОРасхожденияхПослеПриемки.ОрганизацияВзвесившаяИОпломбировавшаяТовар                        КАК ОрганизацияВзвесившаяИОпломбировавшаяТовар,
	|	АктОРасхожденияхПослеПриемки.ПорядокОтбораТовараДляВыборочнойПроверки                          КАК ПорядокОтбораТовараДляВыборочнойПроверки,
	|	АктОРасхожденияхПослеПриемки.СпособОпределенияКоличества                                       КАК СпособОпределенияКоличества,
	|	АктОРасхожденияхПослеПриемки.МестоОпределенияКоличества                                        КАК МестоОпределенияКоличества,
	|	АктОРасхожденияхПослеПриемки.СведенияОбИсправностиВесоизмерительныхПриборов                    КАК СведенияОбИсправностиВесоизмерительныхПриборов,
	|	АктОРасхожденияхПослеПриемки.ПрочиеДанные                                                      КАК ПрочиеДанные,
	|	АктОРасхожденияхПослеПриемки.ПодробноеОписаниеДефектов                                         КАК ПодробноеОписаниеДефектов,
	|	АктОРасхожденияхПослеПриемки.ЗаключениеКомиссии                                                КАК ЗаключениеКомиссии,
	|	АктОРасхожденияхПослеПриемки.Приложение                                                        КАК Приложение,
	|	АктОРасхожденияхПослеПриемки.ДокументУдостоверяющийПолномочияПредставителяПартнера             КАК ДокументУдостоверяющийПолномочияПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.НомерДокументаУдостоверяющегоПолномочияПредставителяПартнера      КАК НомерДокументаУдостоверяющегоПолномочияПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.ДатаВыдачиДокументаУдостоверяющегоПолномочияПредставителяПартнера КАК ДатаВыдачиДокументаУдостоверяющегоПолномочияПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.КоличествоЛистовПриложения                                        КАК КоличествоЛистовПриложения,
	|	АктОРасхожденияхПослеПриемки.РешениеРуководителя                                               КАК РешениеРуководителя,
	|	АктОРасхожденияхПослеПриемки.КладовщикПринявшийТовар                                           КАК КладовщикПринявшийТовар,
	|	АктОРасхожденияхПослеПриемки.ПредседательКомиссии                                              КАК ПредседательКомиссии,
	|	АктОРасхожденияхПослеПриемки.ДолжностьПредседателяКомиссии                                     КАК ДолжностьПредседателяКомиссии,
	|	АктОРасхожденияхПослеПриемки.ЧленКомиссии1                                                     КАК ЧленКомиссии1,
	|	АктОРасхожденияхПослеПриемки.ДолжностьЧленаКомиссии1                                           КАК ДолжностьЧленаКомиссии1,
	|	АктОРасхожденияхПослеПриемки.ЧленКомиссии2                                                     КАК ЧленКомиссии2,
	|	АктОРасхожденияхПослеПриемки.ДолжностьЧленаКомиссии2                                           КАК ДолжностьЧленаКомиссии2,
	|	АктОРасхожденияхПослеПриемки.ЧленКомиссии3                                                     КАК ЧленКомиссии3,
	|	АктОРасхожденияхПослеПриемки.ДолжностьЧленаКомиссии3                                           КАК ДолжностьЧленаКомиссии3,
	|	АктОРасхожденияхПослеПриемки.ПриемкаТоваров.(
	|		НомерСтроки КАК НомерСтроки,
	|		ДатаПрибытияВПунктНазначения КАК ДатаПрибытияВПунктНазначения,
	|		ДатаВскрытия КАК ДатаВскрытия,
	|		ДатаВыдачиОрганизациейТранспорта КАК ДатаВыдачи,
	|		ДатаДоставкиНаСкладПолучателя КАК ДатаДоставкиНаСклад,
	|		ДатаНачалаРазгрузки КАК ДатаНачалаРазгрузки,
	|		ДатаНачалаПриемки КАК ДатаНачалаПриемки,
	|		ДатаПриостановленияПриемки КАК ДатаПриостановленияПриемки,
	|		ДатаВозобновленияПриемки КАК ДатаВозобновленияПриемки,
	|		ДатаОкончанияПриемки КАК ДатаОкончанияПриемки
	|	)                                                                                              КАК ТаблицаПриемкиТоваров,
	|	АктОРасхожденияхПослеПриемки.МассаБруттоПоДаннымПроизводителя                                  КАК МассаБруттоПоДаннымПроизводителя,
	|	АктОРасхожденияхПослеПриемки.МассаБруттоВПунктеОтправления                                     КАК МассаБруттоВПунктеОтправления,
	|	АктОРасхожденияхПослеПриемки.МассаБруттоВПунктеНазначения                                      КАК МассаБруттоВПунктеНазначения,
	|	АктОРасхожденияхПослеПриемки.КоличествоМестПоДокументамГрузоотправителя                        КАК КоличествоМестПоДокументам,
	|	АктОРасхожденияхПослеПриемки.КоличествоМестПоФакту                                             КАК КоличествоМестПоФакту,
	|	АктОРасхожденияхПослеПриемки.КоличествоМестПоФакту - АктОРасхожденияхПослеПриемки.КоличествоМестПоДокументамГрузоотправителя КАК КоличествоМестРасхождение,
	|	АктОРасхожденияхПослеПриемки.МассаБруттоПоДокументамГрузоотправителя КАК МассаБруттоПоДокументам,
	|	АктОРасхожденияхПослеПриемки.МассаБруттоПоФакту                                                КАК МассаБруттоПоФакту,
	|	АктОРасхожденияхПослеПриемки.МассаБруттоПоФакту - АктОРасхожденияхПослеПриемки.МассаБруттоПоДокументамГрузоотправителя КАК МассаБруттоРасхождение,
	|	АктОРасхожденияхПослеПриемки.МассаНеттоПоДокументамГрузоотправителя КАК МассаНеттоПоДокументам,
	|	АктОРасхожденияхПослеПриемки.МассаНеттоПоФакту                                                 КАК МассаНеттоПоФакту,
	|	АктОРасхожденияхПослеПриемки.МассаНеттоПоФакту - АктОРасхожденияхПослеПриемки.МассаНеттоПоДокументамГрузоотправителя КАК МассаНеттоРасхождение,
	|	АктОРасхожденияхПослеПриемки.МассаТарыПоДокументамГрузоотправителя                             КАК МассаТарыПоДокументам,
	|	АктОРасхожденияхПослеПриемки.МассаТарыПоФакту                                                  КАК МассаТарыПоФакту,
	|	АктОРасхожденияхПослеПриемки.МассаТарыПоФакту - АктОРасхожденияхПослеПриемки.МассаТарыПоДокументамГрузоотправителя КАК МассаТарыРасхождение,
	|	АктОРасхожденияхПослеПриемки.СтепеньЗаполненияПоДокументамГрузоотправителя                     КАК СтепеньЗаполненияПоДокументам,
	|	АктОРасхожденияхПослеПриемки.СтепеньЗаполненияПоФакту                                          КАК СтепеньЗаполненияПоФакту,
	|	ЛОЖЬ                                                                                           КАК ОшибкаНетРасхождений,
	|	АктОРасхожденияхПослеПриемки.ЦенаВключаетНДС                                                   КАК ЦенаВключаетНДС,
	|	ЕстьРасхожденияПоДокументам.ЕстьРасхождения                                                    КАК ЕстьРасхождения
	|ИЗ
	|	ЕстьРасхожденияПоДокументам КАК ЕстьРасхожденияПоДокументам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктОРасхожденияхПослеПриемки КАК АктОРасхожденияхПослеПриемки
	|		ПО ЕстьРасхожденияПоДокументам.АктОРасхождениях = АктОРасхожденияхПослеПриемки.Ссылка
	|ГДЕ
	|	АктОРасхожденияхПослеПриемки.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////4
	|ВЫБРАТЬ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка                            КАК Ссылка,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура                      КАК Номенклатура,
	|	АктОРасхожденияхПослеПриемкиТовары.НоменклатураПартнера              КАК НоменклатураПартнера,
	|	АктОРасхожденияхПослеПриемкиТовары.Характеристика                    КАК Характеристика,
	|	АктОРасхожденияхПослеПриемкиТовары.Упаковка                          КАК Упаковка,
	|	АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу             КАК КоличествоПоДокументам,
	|	АктОРасхожденияхПослеПриемкиТовары.Цена                              КАК Цена,
	|	АктОРасхожденияхПослеПриемкиТовары.СуммаПоДокументу                  КАК СуммаПоДокументам,
	|	АктОРасхожденияхПослеПриемкиТовары.СуммаНДСПоДокументу               КАК СуммаНДСПоДокументам,
	|	АктОРасхожденияхПослеПриемкиТовары.Количество                        КАК КоличествоПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.Цена                              КАК ЦенаПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.Сумма                             КАК СуммаПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.СтавкаНДС                         КАК СтавкаНДС,
	|	АктОРасхожденияхПослеПриемкиТовары.СуммаНДС                          КАК СуммаНДСПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.Код                  КАК Код,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.Артикул              КАК Артикул,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.ЕдиницаИзмерения     КАК ЕдиницаИзмерения,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.ЕдиницаИзмерения.Код КАК КодПоОКЕИ,
	|	ВЫБОР
	|		КОГДА АктОРасхожденияхПослеПриемкиТовары.Количество - АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу > 0
	|			ТОГДА АктОРасхожденияхПослеПриемкиТовары.Количество - АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                                КАК КоличествоИзлишек,
	|	ВЫБОР
	|		КОГДА АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу - АктОРасхожденияхПослеПриемкиТовары.Количество > 0
	|			ТОГДА АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу - АктОРасхожденияхПослеПриемкиТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                                КАК КоличествоНедостача,
	|	ВЫБОР
	|		КОГДА АктОРасхожденияхПослеПриемкиТовары.Сумма - АктОРасхожденияхПослеПриемкиТовары.СуммаПоДокументу > 0
	|			ТОГДА АктОРасхожденияхПослеПриемкиТовары.Сумма - АктОРасхожденияхПослеПриемкиТовары.СуммаПоДокументу
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                                КАК СуммаИзлишек,
	|	ВЫБОР
	|		КОГДА АктОРасхожденияхПослеПриемкиТовары.СуммаПоДокументу - АктОРасхожденияхПослеПриемкиТовары.Сумма > 0
	|			ТОГДА АктОРасхожденияхПослеПриемкиТовары.СуммаПоДокументу - АктОРасхожденияхПослеПриемкиТовары.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                                КАК СуммаНедостача,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.НаименованиеПолное   КАК НоменклатураНаименование,
	|	АктОРасхожденияхПослеПриемкиТовары.Характеристика.НаименованиеПолное КАК ХарактеристикаНаименование,
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка.ЦенаВключаетНДС            КАК ЦенаВключаетНДСПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка.ЦенаВключаетНДС            КАК ЦенаВключаетНДСПоДокументам,
	|	АктОРасхожденияхПослеПриемкиТовары.НомерСтроки                       КАК НомерСтроки,
	|	АктОРасхожденияхПослеПриемкиТовары.НомерПаспорта                     КАК НомерПаспорта
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка В(&МассивОбъектов)
	|	И АктОРасхожденияхПослеПриемкиТовары.КоличествоУпаковок <> АктОРасхожденияхПослеПриемкиТовары.КоличествоУпаковокПоДокументу
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДанныхПечати = Новый Структура;
	СтруктураДанныхПечати.Вставить("ДанныеСчетовФактур",        ПакетРезультатов[2]);
	СтруктураДанныхПечати.Вставить("ДанныеПечати",              ПакетРезультатов[3]);
	СтруктураДанныхПечати.Вставить("ДанныеТовары",              ПакетРезультатов[4]);
	
	Возврат СтруктураДанныхПечати;
	
КонецФункции
//-- Локализация

#КонецОбласти


#Область ГосИС

//++ Локализация

// Создает акт по результатам работы в форме проверки и подбора ИСМП.
//
// Параметры:
// 	ПараметрыОкончанияСканирования - Структура - (См. ПроверкаИПодборИСМП.ЗафиксироватьРезультатПроверкиИПодбора).
// 	Проводить - Булево - Необходимость проведения документа.
//
Процедура СоздатьПоРезультатамПроверкиИПодбораИСМП(ПараметрыОкончанияСканирования, Проводить) Экспорт
	
	ЭтоНовыйДокумент = Ложь;
	
	СформированныйАкт = ИнтеграцияИСМПУТ.СформированныйАктОРасхождениях(ПараметрыОкончанияСканирования.ПроверяемыйДокумент);
	Если ЭлектронноеВзаимодействиеИСМП.ЗавершенОбменПоЭДО(СформированныйАкт) Тогда
		СформированныйАкт = Неопределено;
	КонецЕсли;
	
	Если СформированныйАкт = Неопределено Тогда
		ДокументОбъект = Документы.АктОРасхожденияхПослеПриемки.СоздатьДокумент();
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("ДокументОснование",           ПараметрыОкончанияСканирования.ПроверяемыйДокумент);
		ПараметрыЗаполнения.Вставить("НеПроверятьВозможностьВвода", Истина);
		
		ДокументОбъект.Заполнить(ПараметрыЗаполнения);
		ЭтоНовыйДокумент = Истина;
	Иначе
		ДокументОбъект = СформированныйАкт.ПолучитьОбъект();
		ПерезаполнитьТоварыПоВидуПродукции(ДокументОбъект, ПараметрыОкончанияСканирования.ПроверяемыйДокумент, ПараметрыОкончанияСканирования.ВидПродукцииИС);
	КонецЕсли;
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	
	ПровереннаяИПодобраннаяПродукция = ПараметрыОкончанияСканирования.ТаблицаПодобраннойПровереннойПродукции;
	ПровереннаяИПодобраннаяПродукция.Свернуть("Номенклатура, Характеристика, Серия", "Количество, КоличествоПодобрано");
	
	СтруктураДействийОпределениеФактическогоКоличества = Новый Структура;
	ДополнитьСтруктуруДействийПриОпределенииФактическогоКоличества(СтруктураДействийОпределениеФактическогоКоличества, ДокументОбъект);
	
	СтруктураДействийНоваяСтрока = Новый Структура;
	
	СтруктураДействийНоваяСтрока.Вставить("ЗаполнитьНоменклатуруПоставщикаПоНоменклатуре", ДокументОбъект.Партнер);
	СтруктураДействийНоваяСтрока.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата", ДокументОбъект.НалогообложениеНДС, ДокументОбъект.Дата));
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСПоставщиками") И ЗначениеЗаполнено(ДокументОбъект.Соглашение) Тогда
		СтруктураДействийНоваяСтрока.Вставить("ЗаполнитьУсловияЗакупок", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ(ДокументОбъект));
	Иначе
		СтруктураДействийНоваяСтрока.Вставить("ЗаполнитьЦенуЗакупки", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ(ДокументОбъект));
	КонецЕсли;
	ДополнитьСтруктуруДействийПриОпределенииФактическогоКоличества(СтруктураДействийНоваяСтрока, ДокументОбъект);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПодобраннаяПродукция.Номенклатура        КАК Номенклатура,
	|	ПодобраннаяПродукция.Характеристика      КАК Характеристика,
	|	ПодобраннаяПродукция.Серия               КАК Серия, 
	|	ПодобраннаяПродукция.Количество          КАК Количество,
	|	ПодобраннаяПродукция.КоличествоПодобрано КАК КоличествоПодобрано
	|ПОМЕСТИТЬ ПодобраннаяПродукция
	|ИЗ &ПодобраннаяПродукция КАК ПодобраннаяПродукция
	|;
	|///////////////////////////////////////////////////////////////////////////1
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодобраннаяПродукция.Номенклатура        КАК Номенклатура,
	|	ПодобраннаяПродукция.Характеристика      КАК Характеристика,
	|	ПодобраннаяПродукция.Количество          КАК Количество
	|ИЗ ПодобраннаяПродукция КАК ПодобраннаяПродукция
	|;
	|///////////////////////////////////////////////////////////////////////////2
	|";
	
	ТекстЗапросаОпределениеСклада = ИнтеграцияИСМПУТ.ТекстЗапросаОпределениеСклада(ПараметрыОкончанияСканирования.ПроверяемыйДокумент);
	
	Запрос.Текст = Запрос.Текст + ТекстЗапросаОпределениеСклада;
	
	Запрос.УстановитьПараметр("ПроверяемыйДокумент",  ПараметрыОкончанияСканирования.ПроверяемыйДокумент);
	Запрос.УстановитьПараметр("ПодобраннаяПродукция", ПровереннаяИПодобраннаяПродукция);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ПровереннаяПродукцияГруппированная = Результат[1].Выгрузить();
	СкладыДокумента                    = Результат[2].Выгрузить().ВыгрузитьКолонку("Склад");
	
	Для Каждого СтрокаПодобраннойПродукцииГруппированная Из ПровереннаяПродукцияГруппированная Цикл
		
		ПараметрыПоискаПоАкту = Новый Структура;
		ПараметрыПоискаПоАкту.Вставить("Номенклатура",          СтрокаПодобраннойПродукцииГруппированная.Номенклатура);
		ПараметрыПоискаПоАкту.Вставить("Характеристика",        СтрокаПодобраннойПродукцииГруппированная.Характеристика);
		ПараметрыПоискаПоАкту.Вставить("КоличествоПоДокументу", СтрокаПодобраннойПродукцииГруппированная.Количество);
		
		ПараметрыПоискаПродукция = Новый Структура;
		ПараметрыПоискаПродукция.Вставить("Номенклатура",   СтрокаПодобраннойПродукцииГруппированная.Номенклатура);
		ПараметрыПоискаПродукция.Вставить("Характеристика", СтрокаПодобраннойПродукцииГруппированная.Характеристика);
		ПараметрыПоискаПродукция.Вставить("Количество",     СтрокаПодобраннойПродукцииГруппированная.Количество);
		
		НайденныеСтрокиАкта      = ДокументОбъект.Товары.НайтиСтроки(ПараметрыПоискаПоАкту);
		НайденныеСтрокиПродукция = ПровереннаяИПодобраннаяПродукция.НайтиСтроки(ПараметрыПоискаПродукция);
	
		Если НайденныеСтрокиАкта.Количество() > 0 Тогда
			
			РаспределитьПодобранноеНаСуществующиеСтроки(ДокументОбъект, 
			                                            НайденныеСтрокиАкта, 
			                                            НайденныеСтрокиПродукция, 
			                                            СтруктураДействийОпределениеФактическогоКоличества);
			
		Иначе
			
			ДобавитьНовуюСтрокуМаркированнойПродукции(ДокументОбъект, 
			                                         ПараметрыОкончанияСканирования.ПроверяемыйДокумент, 
			                                         НайденныеСтрокиПродукция, 
			                                         СкладыДокумента, 
			                                         СтруктураДействийНоваяСтрока);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, Документы.АктОРасхожденияхПослеПриемки);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокументОбъект, ПараметрыУказанияСерий);
	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ДокументОбъект, ПараметрыУказанияСерий);
	
	ЗаполнитьТаблицыШтрихкодов(ДокументОбъект, ПараметрыОкончанияСканирования, ЭтоНовыйДокумент);
	
	ИнтеграцияИСМПУТ.ОтразитьИзмененияТабличнойЧастиШтрихкодыУпаковок(
		ДокументОбъект,
		ПараметрыОкончанияСканирования.ТаблицаШтрихкодовВерхнегоУровня,
		ПараметрыОкончанияСканирования.ВидПродукцииИС);
	
	Если Проводить Тогда
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
	Иначе
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	ПараметрыОкончанияСканирования.СозданныйАктОРасхождениях = ДокументОбъект.Ссылка;
	
КонецПроцедуры

//-- Локализация

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Процедура дополняет тексты запросов проведения документа.
//
// Параметры:
//  Запрос - Запрос - Общий запрос проведения документа.
//  ТекстыЗапроса - СписокЗначений - Список текстов запроса проведения.
//  Регистры - Строка, Структура - Список регистров проведения документа через запятую или в ключах структуры.
//
Процедура ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ГосИС

//++ Локализация

Процедура ПерезаполнитьТоварыПоВидуПродукции(ДокументОбъект, ДокументОснование, ВидМаркируемойПродукцииОтбор)
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаНоменклатура.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ТаблицаНоменклатура
	               |ИЗ
	               |	&Номенклатура КАК ТаблицаНоменклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Товары.Номенклатура КАК Номенклатура,
	               |	Товары.НоменклатураПартнера КАК НоменклатураПартнера,
	               |	Товары.Характеристика КАК Характеристика,
	               |	Товары.Серия КАК Серия,
	               |	Товары.Назначение КАК Назначение,
	               |	Товары.Упаковка КАК Упаковка,
	               |	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	Товары.Количество КАК Количество,
	               |	Товары.ВидЦеныПоставщика КАК ВидЦеныПоставщика,
	               |	ВЫБОР
	               |		КОГДА Товары.КоличествоУпаковок = 0
	               |			ТОГДА Товары.Цена
	               |		ИНАЧЕ ВЫРАЗИТЬ(Товары.Сумма / Товары.КоличествоУпаковок КАК ЧИСЛО(31, 2))
	               |	КОНЕЦ КАК Цена,
	               |	Товары.Сумма КАК Сумма,
	               |	Товары.СтавкаНДС КАК СтавкаНДС,
	               |	Товары.Склад КАК Склад,
	               |	Товары.СуммаНДС КАК СуммаНДС,
	               |	Товары.СуммаСНДС КАК СуммаСНДС,
	               |	Товары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	               |	Товары.Ссылка КАК ДокументОснование,
	               |	Товары.ЗаказПоставщику КАК ЗаказПоставщику,
	               |	Товары.КодСтроки КАК КодСтроки,
	               |	ИСТИНА КАК ЗаполненоПоОснованию,
	               |	Товары.КоличествоУпаковок КАК КоличествоУпаковокПоДокументу,
	               |	Товары.Количество КАК КоличествоПоДокументу,
	               |	Товары.Сумма КАК СуммаПоДокументу,
	               |	Товары.СуммаНДС КАК СуммаНДСПоДокументу,
	               |	Товары.СуммаСНДС КАК СуммаСНДСПоДокументу,
	               |	Товары.СтатьяРасходов КАК СтатьяРасходов,
	               |	Товары.АналитикаРасходов КАК АналитикаРасходов,
	               |	Товары.Сертификат КАК Сертификат,
	               |	Товары.Сделка КАК Сделка,
	               |	Товары.Подразделение КАК Подразделение,
	               |	Товары.НомерГТД КАК НомерГТД,
	               |	Товары.НомерПаспорта КАК НомерПаспорта,
	               |	Товары.СписатьНаРасходы КАК СписатьНаРасходы,
	               |	&ОпределениеВидаПродукции КАК ВидПродукции
	               |ИЗ
	               |	Документ.%1.Товары КАК Товары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО Товары.Номенклатура = СправочникНоменклатура.Ссылка
	               |ГДЕ
	               |	Товары.Ссылка = &ДокументОснование
	               |	И &УсловиеМаркируемаяПродукция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Серии.Серия КАК Серия,
	               |	Серии.Количество КАК Количество,
	               |	Серии.Количество КАК КоличествоПоДокументу,
	               |	Серии.Номенклатура КАК Номенклатура,
	               |	Серии.Характеристика КАК Характеристика,
	               |	Серии.Назначение КАК Назначение,
	               |	Серии.Склад КАК Склад,
	               |	Серии.Ссылка КАК ДокументОснование,
	               |	ИСТИНА КАК ЗаполненоПоОснованию,
	               |	&ОпределениеВидаПродукции КАК ВидПродукции
	               |ИЗ
	               |	Документ.%1.Серии КАК Серии
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО Серии.Номенклатура = СправочникНоменклатура.Ссылка
	               |ГДЕ
	               |	Серии.Ссылка = &ДокументОснование
	               |	И &УсловиеМаркируемаяПродукция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаНоменклатура.Номенклатура КАК Номенклатура,
	               |	&ОпределениеВидаПродукции КАК ВидПродукции
	               |ПОМЕСТИТЬ ТаблицаНоменклатурыПоВидуПродукции
	               |ИЗ
	               |	ТаблицаНоменклатура КАК ТаблицаНоменклатура
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО ТаблицаНоменклатура.Номенклатура = СправочникНоменклатура.Ссылка
	               |ГДЕ
	               |	&УсловиеМаркируемаяПродукция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаНоменклатурыПоВидуПродукции.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	ТаблицаНоменклатурыПоВидуПродукции КАК ТаблицаНоменклатурыПоВидуПродукции
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаНоменклатурыПоВидуПродукции.Номенклатура";
	
	ТекстЗапроса = СтрШаблон(ТекстЗапроса, ДокументОснование.Метаданные().Имя);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Номенклатура", ДокументОбъект.Товары.Выгрузить(,"Номенклатура"));
	
	Запрос.Текст = ТекстЗапроса;
	
	ИнтеграцияИСУТ.ОпределитьВидПродукцииТекстаЗапроса(Запрос.Текст, "СправочникНоменклатура");
	ИнтеграцияИСМПУТ.УстановитьУсловиеПоВидуМаркируемойПродукции(Запрос.Текст, ВидМаркируемойПродукцииОтбор);
	
	Результат = Запрос.ВыполнитьПакет();
	ТоварыДобавить = Результат[1].Выбрать();
	СерииДобавить  = Результат[2].Выбрать();
	ТаблицаНоменклатура  = Результат[4].Выбрать();
	
	ПараметрыПоискаПродукция = Новый Структура("Номенклатура");
	
	Пока ТаблицаНоменклатура.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыПоискаПродукция, ТаблицаНоменклатура);
		СтрокиКУдалению = ДокументОбъект.Товары.НайтиСтроки(ПараметрыПоискаПродукция);
		Для Каждого СтрокаУдалить Из СтрокиКУдалению Цикл
			ДокументОбъект.Товары.Удалить(СтрокаУдалить);
		КонецЦикла;
		
		СтрокиКУдалению = ДокументОбъект.Серии.НайтиСтроки(ПараметрыПоискаПродукция);
		Для Каждого СтрокаУдалить Из СтрокиКУдалению Цикл
			ДокументОбъект.Серии.Удалить(СтрокаУдалить);
		КонецЦикла;
		
	КонецЦикла;
	
	Пока ТоварыДобавить.Следующий() Цикл
		
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТоварыДобавить);
		
	КонецЦикла;
	
	Пока СерииДобавить.Следующий() Цикл
		
		НоваяСтрока = ДокументОбъект.Серии.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СерииДобавить);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицыШтрихкодов(ДокументОбъект, ПараметрыОкончанияСканирования, 
	ЭтоНовыйДокумент = Истина)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихкодыУпаковокПланЭДО", ПараметрыОкончанияСканирования.ШтрихкодыУпаковокПланЭДО);
	Запрос.УстановитьПараметр("ШтрихкодыУпаковокФактЭДО", ПараметрыОкончанияСканирования.ШтрихкодыУпаковокФактЭДО);
	
	Запрос.УстановитьПараметр("ШтрихкодыУпаковокДокументаФактЭДО", ДокументОбъект.ШтрихкодыУпаковокФактЭДО.Выгрузить());
	Запрос.УстановитьПараметр("ШтрихкодыУпаковокРасхожденияДокумента", ДокументОбъект.ШтрихкодыУпаковокРасхождения.Выгрузить());
	
	Запрос.Текст = "ВЫБРАТЬ
				|	ШтрихкодыУпаковокПланЭДО.Номенклатура КАК Номенклатура,
				|	ШтрихкодыУпаковокПланЭДО.Характеристика КАК Характеристика,
				|	ШтрихкодыУпаковокПланЭДО.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
				|	ШтрихкодыУпаковокПланЭДО.ВидУпаковки КАК ВидУпаковки,
				|	ШтрихкодыУпаковокПланЭДО.КоличествоНедостача КАК КоличествоНедостача,
				|	ШтрихкодыУпаковокПланЭДО.КоличествоБрак КАК КоличествоБрак,
				|	ШтрихкодыУпаковокПланЭДО.КоличествоПринято КАК КоличествоПринято
				|ПОМЕСТИТЬ ТаблицаШтрихкодыПлан
				|ИЗ
				|	&ШтрихкодыУпаковокПланЭДО КАК ШтрихкодыУпаковокПланЭДО
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Номенклатура,
				|	Характеристика,
				|	ЗначениеШтрихкода
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////1
				|ВЫБРАТЬ
				|	ШтрихкодыУпаковокФактЭДО.Номенклатура КАК Номенклатура,
				|	ШтрихкодыУпаковокФактЭДО.Характеристика КАК Характеристика,
				|	ШтрихкодыУпаковокФактЭДО.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
				|	ШтрихкодыУпаковокФактЭДО.ВидУпаковки КАК ВидУпаковки,
				|	ШтрихкодыУпаковокФактЭДО.КоличествоИзлишек КАК КоличествоИзлишек,
				|	ШтрихкодыУпаковокФактЭДО.КоличествоБрак КАК КоличествоБрак,
				|	ШтрихкодыУпаковокФактЭДО.КоличествоПринято КАК КоличествоПринято,
				|	ШтрихкодыУпаковокФактЭДО.Брак КАК Брак
				|ПОМЕСТИТЬ ТаблицаШтрихкодыФакт
				|ИЗ
				|	&ШтрихкодыУпаковокФактЭДО КАК ШтрихкодыУпаковокФактЭДО
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Номенклатура,
				|	Характеристика,
				|	ЗначениеШтрихкода
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////2
				|ВЫБРАТЬ
				|	ШтрихкодыУпаковокДокументаФактЭДО.Номенклатура КАК Номенклатура,
				|	ШтрихкодыУпаковокДокументаФактЭДО.Характеристика КАК Характеристика,
				|	ШтрихкодыУпаковокДокументаФактЭДО.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
				|	ШтрихкодыУпаковокДокументаФактЭДО.Количество КАК Количество
				|ПОМЕСТИТЬ ШтрихкодыУпаковокДокументаФактЭДО
				|ИЗ
				|	&ШтрихкодыУпаковокДокументаФактЭДО КАК ШтрихкодыУпаковокДокументаФактЭДО
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Номенклатура
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////3
				|ВЫБРАТЬ
				|	ШтрихкодыУпаковокРасхожденияДокумента.Номенклатура КАК Номенклатура,
				|	ШтрихкодыУпаковокРасхожденияДокумента.Характеристика КАК Характеристика,
				|	ШтрихкодыУпаковокРасхожденияДокумента.ЗначениеШтрихкода КАК ЗначениеШтрихкода
				|ПОМЕСТИТЬ ШтрихкодыУпаковокРасхожденияДокумента
				|ИЗ
				|	&ШтрихкодыУпаковокРасхожденияДокумента КАК ШтрихкодыУпаковокРасхожденияДокумента
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Номенклатура
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////4
				|ВЫБРАТЬ
				|	ТаблицаШтрихкодыПлан.Номенклатура КАК Номенклатура,
				|	ТаблицаШтрихкодыПлан.Характеристика КАК Характеристика,
				|	ТаблицаШтрихкодыПлан.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
				|	ТаблицаШтрихкодыПлан.ВидУпаковки КАК ВидУпаковки,
				|	ТаблицаШтрихкодыПлан.КоличествоНедостача КАК Количество,
				|	ЛОЖЬ КАК Излишек,
				|	ЛОЖЬ КАК Брак
				|ПОМЕСТИТЬ ТаблицаРасхождений
				|ИЗ
				|	ТаблицаШтрихкодыПлан КАК ТаблицаШтрихкодыПлан
				|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаШтрихкодыФакт КАК ТаблицаШтрихкодыФакт
				|		ПО ТаблицаШтрихкодыПлан.ЗначениеШтрихкода = ТаблицаШтрихкодыФакт.ЗначениеШтрихкода
				|ГДЕ
				|	ТаблицаШтрихкодыФакт.Номенклатура ЕСТЬ NULL
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ТаблицаШтрихкодыФакт.Номенклатура,
				|	ТаблицаШтрихкодыФакт.Характеристика,
				|	ТаблицаШтрихкодыФакт.ЗначениеШтрихкода,
				|	ТаблицаШтрихкодыФакт.ВидУпаковки КАК ВидУпаковки,
				|	ТаблицаШтрихкодыФакт.КоличествоИзлишек,
				|	ИСТИНА,
				|	ЛОЖЬ
				|ИЗ
				|	ТаблицаШтрихкодыФакт КАК ТаблицаШтрихкодыФакт
				|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаШтрихкодыПлан КАК ТаблицаШтрихкодыПлан
				|		ПО (ТаблицаШтрихкодыПлан.ЗначениеШтрихкода = ТаблицаШтрихкодыФакт.ЗначениеШтрихкода)
				|ГДЕ
				|	ТаблицаШтрихкодыПлан.Номенклатура ЕСТЬ NULL
				|	И ТаблицаШтрихкодыФакт.КоличествоИзлишек > 0
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ТаблицаШтрихкодыФакт.Номенклатура,
				|	ТаблицаШтрихкодыФакт.Характеристика,
				|	ТаблицаШтрихкодыФакт.ЗначениеШтрихкода,
				|	ТаблицаШтрихкодыФакт.ВидУпаковки КАК ВидУпаковки,
				|	ТаблицаШтрихкодыФакт.КоличествоБрак,
				|	ЛОЖЬ,
				|	ИСТИНА
				|ИЗ
				|	ТаблицаШтрихкодыФакт КАК ТаблицаШтрихкодыФакт
				|ГДЕ
				|	(ТаблицаШтрихкодыФакт.Брак
				|			ИЛИ ТаблицаШтрихкодыФакт.КоличествоБрак > 0)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////5
				|ВЫБРАТЬ
				|	ШтрихкодыУпаковокРасхожденияДокумента.Номенклатура КАК Номенклатура,
				|	ШтрихкодыУпаковокРасхожденияДокумента.Характеристика КАК Характеристика,
				|	&ОпределениеВидаПродукции КАК ВидПродукции,
				|	ШтрихкодыУпаковокРасхожденияДокумента.ЗначениеШтрихкода КАК ЗначениеШтрихкода
				|ИЗ
				|	ШтрихкодыУпаковокРасхожденияДокумента КАК ШтрихкодыУпаковокРасхожденияДокумента
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
				|		ПО ШтрихкодыУпаковокРасхожденияДокумента.Номенклатура = СправочникНоменклатура.Ссылка
				|ГДЕ
				|	&УсловиеМаркируемаяПродукция
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////6
				|ВЫБРАТЬ
				|	ТаблицаРасхождений.Номенклатура КАК Номенклатура,
				|	ТаблицаРасхождений.Характеристика КАК Характеристика,
				|	&ОпределениеВидаПродукции КАК ВидПродукции,
				|	ТаблицаРасхождений.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
				|	ТаблицаРасхождений.ВидУпаковки КАК ВидУпаковки,
				|	ТаблицаРасхождений.Количество КАК Количество,
				|	ТаблицаРасхождений.Излишек КАК Излишек,
				|	ТаблицаРасхождений.Брак КАК Брак
				|ИЗ
				|	ТаблицаРасхождений КАК ТаблицаРасхождений
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
				|		ПО ТаблицаРасхождений.Номенклатура = СправочникНоменклатура.Ссылка
				|ГДЕ
				|	&УсловиеМаркируемаяПродукция
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////7
				|ВЫБРАТЬ
				|	ШтрихкодыУпаковокДокументаФактЭДО.Номенклатура КАК Номенклатура,
				|	ШтрихкодыУпаковокДокументаФактЭДО.Характеристика КАК Характеристика,
				|	&ОпределениеВидаПродукции КАК ВидПродукции,
				|	ШтрихкодыУпаковокДокументаФактЭДО.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
				|	ШтрихкодыУпаковокДокументаФактЭДО.Количество КАК Количество
				|ИЗ
				|	ШтрихкодыУпаковокДокументаФактЭДО КАК ШтрихкодыУпаковокДокументаФактЭДО
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
				|		ПО ШтрихкодыУпаковокДокументаФактЭДО.Номенклатура = СправочникНоменклатура.Ссылка
				|ГДЕ
				|	&УсловиеМаркируемаяПродукция
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////8
				|ВЫБРАТЬ
				|	ТаблицаШтрихкодыФакт.Номенклатура КАК Номенклатура,
				|	ТаблицаШтрихкодыФакт.Характеристика КАК Характеристика,
				|	ТаблицаШтрихкодыФакт.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
				|	ТаблицаШтрихкодыФакт.ВидУпаковки КАК ВидУпаковки,
				|	ТаблицаШтрихкодыФакт.КоличествоПринято + ТаблицаШтрихкодыФакт.КоличествоИзлишек + ТаблицаШтрихкодыФакт.КоличествоБрак КАК Количество
				|ИЗ
				|	ТаблицаШтрихкодыФакт КАК ТаблицаШтрихкодыФакт
				|ГДЕ
				|	НЕ ТаблицаШтрихкодыФакт.Брак
				|";
	
	ИнтеграцияИСУТ.ОпределитьВидПродукцииТекстаЗапроса(Запрос.Текст, "СправочникНоменклатура");
	
	Если ЭтоНовыйДокумент Тогда
		ВидМаркируемойПродукцииОтбор = Новый Массив;
		ВидыПродукцииИСМП = ИнтеграцияИСКлиентСервер.ВидыПродукцииИСМП(Истина);
		Для Каждого ВидПродукции Из ВидыПродукцииИСМП Цикл
			Если ИнтеграцияИСМПКлиентСерверПовтИсп.ВестиУчетМаркируемойПродукции(ВидПродукции) Тогда
				ВидМаркируемойПродукцииОтбор.Добавить(ВидПродукции);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ВидМаркируемойПродукцииОтбор = ПараметрыОкончанияСканирования.ВидПродукцииИС;
	КонецЕсли;
	
	ИнтеграцияИСМПУТ.УстановитьУсловиеПоВидуМаркируемойПродукции(Запрос.Текст, ВидМаркируемойПродукцииОтбор);
	
	Результат = Запрос.ВыполнитьПакет();
	ВыборкаШтрихкодыРасхожденияКУдалению   = Результат[5].Выбрать();
	ВыборкаШтрихкодыРасхожденияКДобавлению = Результат[6].Выбрать();
	ВыборкаШтрихкодыФактКУдалению          = Результат[7].Выбрать();
	ВыборкаШтрихкодыФактКДобавлению        = Результат[8].Выбрать();
	
	ПараметрыПоискаПродукция = Новый Структура("Номенклатура, Характеристика, ЗначениеШтрихкода");
	
	//Удалить изменившиеся строки из ШтрихкодыУпаковокРасхождения и добавить новые
	Пока ВыборкаШтрихкодыРасхожденияКУдалению.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыПоискаПродукция, ВыборкаШтрихкодыРасхожденияКУдалению);
		СтрокиКУдалению = ДокументОбъект.ШтрихкодыУпаковокРасхождения.НайтиСтроки(ПараметрыПоискаПродукция);
		Для Каждого СтрокаУдалить Из СтрокиКУдалению Цикл
			ДокументОбъект.ШтрихкодыУпаковокРасхождения.Удалить(СтрокаУдалить);
		КонецЦикла;
	КонецЦикла;
	
	Пока ВыборкаШтрихкодыРасхожденияКДобавлению.Следующий() Цикл
		
		НоваяСтрока = ДокументОбъект.ШтрихкодыУпаковокРасхождения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаШтрихкодыРасхожденияКДобавлению);
		Если ВыборкаШтрихкодыРасхожденияКДобавлению.Излишек Тогда
			ТипРасхождения = ИнтеграцияИСМПУТ.ТипРасхожденияИСМПИзлишек();
		ИначеЕсли ВыборкаШтрихкодыРасхожденияКДобавлению.Брак Тогда
			ТипРасхождения = ИнтеграцияИСМПУТ.ТипРасхожденияИСМПБрак();
		Иначе
 			ТипРасхождения = ИнтеграцияИСМПУТ.ТипРасхожденияИСМПНедостача();
		КонецЕсли;
		
		НоваяСтрока.ТипРасхождения = ТипРасхождения;
		
	КонецЦикла;
	
	//Удалить изменившиеся строки из ШтрихкодыУпаковокФактЭДО и добавить новые
	Пока ВыборкаШтрихкодыФактКУдалению.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыПоискаПродукция, ВыборкаШтрихкодыФактКУдалению);
		СтрокиКУдалению = ДокументОбъект.ШтрихкодыУпаковокФактЭДО.НайтиСтроки(ПараметрыПоискаПродукция);
		Для Каждого СтрокаШтрихкодУпаковокФактУдалить Из СтрокиКУдалению Цикл
			ДокументОбъект.ШтрихкодыУпаковокФактЭДО.Удалить(СтрокаШтрихкодУпаковокФактУдалить);
		КонецЦикла;
	КонецЦикла;
	
	Пока ВыборкаШтрихкодыФактКДобавлению.Следующий() Цикл
		НоваяСтрока = ДокументОбъект.ШтрихкодыУпаковокФактЭДО.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаШтрихкодыФактКДобавлению);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьНовуюСтрокуМаркированнойПродукции(ДокументОбъект, ПроверяемыйДокумент, НайденныеСтрокиПродукция, СкладыДокумента, СтруктураДействий)
	
	Склад = СкладыДокумента[0];
	
	Для Каждого НайденнаяСтрокаПродукция Из НайденныеСтрокиПродукция Цикл
		
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
	
		НоваяСтрока.Номенклатура        = НайденнаяСтрокаПродукция.Номенклатура;
		НоваяСтрока.Характеристика      = НайденнаяСтрокаПродукция.Характеристика;
		НоваяСтрока.Серия               = НайденнаяСтрокаПродукция.Серия;
		НоваяСтрока.КоличествоУпаковок  = НайденнаяСтрокаПродукция.КоличествоПодобрано;
		НоваяСтрока.Склад               = Склад;
		НоваяСтрока.ДокументОснование   = ПроверяемыйДокумент;
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
		
		НоваяСтрокаСерии = ДокументОбъект.Серии.Добавить();
		НоваяСтрокаСерии.Номенклатура     = НайденнаяСтрокаПродукция.Номенклатура;
		НоваяСтрокаСерии.Характеристика   = НайденнаяСтрокаПродукция.Характеристика;
		НоваяСтрокаСерии.Серия             = НайденнаяСтрокаПродукция.Серия;
		НоваяСтрокаСерии.Количество        = НайденнаяСтрокаПродукция.КоличествоПодобрано;
		НоваяСтрокаСерии.Склад             = Склад;
		НоваяСтрокаСерии.ДокументОснование = ПроверяемыйДокумент;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РаспределитьПодобранноеНаСуществующиеСтроки(ДокументОбъект, НайденныеСтрокиАкта,
                                                      НайденныеСтрокиПродукция, СтруктураДействийОпределениеФактическогоКоличества)
	
	ТребуетсяРаспределениеПоСериям = Ложь;
	СерииВОтдельнойТабличнойЧасти  = Ложь;
	КоличествоКРаспределению = 0;
	
	СерииАкта      = Новый Массив;
	СерииПродукции = Новый Массив;
	
	Для Каждого НайденнаяСтрокаПродукция Из НайденныеСтрокиПродукция Цикл
		КоличествоКРаспределению = КоличествоКРаспределению + НайденнаяСтрокаПродукция.КоличествоПодобрано;
		Если ЗначениеЗаполнено(НайденнаяСтрокаПродукция.Серия)
			И СерииПродукции.Найти(НайденнаяСтрокаПродукция.Серия) = Неопределено Тогда
			СерииПродукции.Добавить(НайденнаяСтрокаПродукция.Серия);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого НайденнаяСтрокаАкт Из НайденныеСтрокиАкта Цикл
		Если ЗначениеЗаполнено(НайденнаяСтрокаАкт.Серия)
			И СерииАкта.Найти(НайденнаяСтрокаАкт.Серия) = Неопределено Тогда
			СерииАкта.Добавить(НайденнаяСтрокаАкт.Серия);
		КонецЕсли;
	КонецЦикла;
	
	Если СерииПродукции.Количество() > 1 Тогда
		ТребуетсяРаспределениеПоСериям = Истина;
	КонецЕсли;
	
	Если СерииПродукции.Количество() > 0 
		И СерииАкта.Количество() = 0 Тогда
		СерииВОтдельнойТабличнойЧасти = Истина;			
	КонецЕсли;
		
	Если Не ТребуетсяРаспределениеПоСериям Тогда
		
		РаспределитьПодобранноеОднаСерия(ДокументОбъект, НайденныеСтрокиАкта, НайденныеСтрокиПродукция, 
		                                 СерииПродукции, КоличествоКРаспределению, СтруктураДействийОпределениеФактическогоКоличества, СерииВОтдельнойТабличнойЧасти);
		
	КонецЕсли;

КонецПроцедуры

Процедура РаспределитьПодобранноеОднаСерия(ДокументОбъект, НайденныеСтрокиАкта, НайденныеСтрокиПродукция,
                                           СерииПродукции, КоличествоКРаспределению, СтруктураДействий, СерииВОтдельнойТабличнойЧасти)
	
	НомерСтроки = 1;
	КоличествоСтрок = НайденныеСтрокиАкта.Количество();
	
	Для Каждого НайденнаяСтрокаАкта Из НайденныеСтрокиАкта Цикл
		
		Если НайденнаяСтрокаАкта.КоличествоУпаковок < КоличествоКРаспределению Тогда
			
			Если КоличествоСтрок <> НомерСтроки Тогда
				КоличествоКРаспределению = КоличествоКРаспределению - НайденнаяСтрокаАкта.КоличествоУпаковок;
			Иначе
				НайденнаяСтрокаАкта.КоличествоУпаковок = КоличествоКРаспределению;
				КоличествоКРаспределению = 0;
			
				ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НайденнаяСтрокаАкта,
				                                                 СтруктураДействий,
				                                                 Неопределено);
			КонецЕсли;
			
		Иначе
			
			НайденнаяСтрокаАкта.КоличествоУпаковок = КоличествоКРаспределению;
			КоличествоКРаспределению = 0;
			
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НайденнаяСтрокаАкта,
			                                                 СтруктураДействий,
			                                                 Неопределено);
			
		КонецЕсли;
			
		НомерСтроки = НомерСтроки + 1;	
			
	КонецЦикла;
	
	Если СерииВОтдельнойТабличнойЧасти Тогда
		
		КоличествоКРаспределению = 0;
		Для Каждого НайденнаяСтрокаПродукция Из НайденныеСтрокиПродукция Цикл
			КоличествоКРаспределению = КоличествоКРаспределению + НайденнаяСтрокаПродукция.КоличествоПодобрано;
		КонецЦикла;
		
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("Номенклатура",   НайденныеСтрокиПродукция[0].Номенклатура);
		ПараметрыПоиска.Вставить("Характеристика", НайденныеСтрокиПродукция[0].Характеристика);
		ПараметрыПоиска.Вставить("Количество",     НайденныеСтрокиПродукция[0].Количество);
		ПараметрыПоиска.Вставить("Серия",          СерииПродукции[0]);
		
		НайденныеСтрокиСерии = ДокументОбъект.Серии.НайтиСтроки(ПараметрыПоиска);
		
		НомерСтроки = 1;
		
		Для Каждого НайденнаяСтрокаСерия Из НайденныеСтрокиСерии Цикл
		
			Если НайденнаяСтрокаСерия.Количество < КоличествоКРаспределению Тогда
				
				Если КоличествоСтрок <> НомерСтроки Тогда
					
					КоличествоКРаспределению = КоличествоКРаспределению - НайденнаяСтрокаСерия.Количество;
					
				Иначе
					
					НайденнаяСтрокаСерия.Количество = КоличествоКРаспределению;
					КоличествоКРаспределению = 0;

				КонецЕсли;
				
			Иначе
				
				НайденнаяСтрокаСерия.Количество = КоличествоКРаспределению;
				КоличествоКРаспределению = 0;
				
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьСтруктуруДействийПриОпределенииФактическогоКоличества(СтруктураДействий, ДокументОбъект)
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект);

	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуРасхождения");
	
КонецПроцедуры

//-- Локализация

#КонецОбласти

#КонецОбласти
