#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ТаблицаЗначений") Тогда
		
		ЗаполнитьПоТаблице(ДанныеЗаполнения);
		
	ИначеЕсли ОбщегоНазначения.ВидОбъектаПоТипу(ТипЗнч(ДанныеЗаполнения)) = "Документ" Тогда
		
		ОбщегоНазначения.МенеджерОбъектаПоСсылке(ДанныеЗаполнения).ЗаполнитьПоОснованию(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли;
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	НастройкиПолей = Документы.СправкаОПодтверждающихДокументах.НастройкиПолейФормы();
	
	ДополнительныеРеквизиты = Новый Структура;
	ДополнительныеРеквизиты.Вставить("ДокументОперацииЗаполнен", Истина);
	
	СвойстваЭлементов = ДенежныеСредстваКлиентСервер.СвойстваЭлементовФормы(ЭтотОбъект, НастройкиПолей,,, ДополнительныеРеквизиты);
	ДенежныеСредстваСервер.ОтключитьПроверкуЗаполненияРеквизитовОбъекта(СвойстваЭлементов, НепроверяемыеРеквизиты);
	ЭтотОбъект.ДополнительныеСвойства.Вставить("СвойстваЭлементов", СвойстваЭлементов);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	ПодтверждающиеДокументыБезРазбиения = Ложь;
	Если ДополнительныеСвойства.Свойство("ПодтверждающиеДокументыБезРазбиения")
		И ДополнительныеСвойства.ПодтверждающиеДокументыБезРазбиения Тогда
		ПодтверждающиеДокументыБезРазбиения = Истина;
	КонецЕсли;
	
	Если ПодтверждающиеДокументыБезРазбиения Тогда
		ДенежныеСредстваСервер.ПроверитьЗаполнениеРасшифровкиБезРазбиения(
			ЭтотОбъект, ПроверяемыеРеквизиты, "ПодтверждающиеДокументы", "ПодтверждающиеДокументыБезРазбиения", Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(ДатаСправки) Тогда
		ДатаСправки = Дата;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СвойстваЭлементов") Тогда
		ДенежныеСредстваСервер.ОчиститьНеиспользуемыеРеквизитыОбъекта(ЭтотОбъект, ЭтотОбъект.ДополнительныеСвойства.СвойстваЭлементов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Корректировка = Ложь;
	КорректируемаяСправка = Неопределено;
	НомерКорректировки = 0;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоТаблице(ТаблицаДокументов)
	
	Если ТаблицаДокументов.Количество() Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ТаблицаДокументов[0]);
		
		Для каждого СтрокаТаблицы Из ТаблицаДокументов Цикл
			ЗаполнитьЗначенияСвойств(ПодтверждающиеДокументы.Добавить(), СтрокаТаблицы);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли