
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запись.Номенклатура=Справочники.Номенклатура.НайтиПоКоду("00-00000734");
	ТекущееРабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();  
	ТочкаПродажи = СтрРазделить(ТекущееРабочееМесто.Наименование, " ");
	Запись.ТочкаПродажи = ТочкаПродажи[0];
	Попытка
		Запись.ДатаПоступления = Параметры.ДатаПоступления;
		Запись.Цена = Параметры.Цена;
		Запись.Сотрудник1 = Параметры.Сотрудник1;
		Запись.Сотрудник2 = Параметры.Сотрудник2;
		Запись.Сотрудник3 = Параметры.Сотрудник3;
		Запись.Комплект = Параметры.Комплект;
		Запись.Артикул = Параметры.Артикул;
		Запись.Радиус = Параметры.Радиус;
		Запись.Ширина = Параметры.Ширина;
		Запись.Высота = Параметры.Высота;
		Запись.Бренд = Параметры.Бренд;
		Запись.Зимняя = Параметры.Зимняя;
		Запись.Год = Параметры.Год;  
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//ТекущееРабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();  
	//ТочкаПродажи = СтрРазделить(ТекущееРабочееМесто.Наименование, " ");
	//Запись.ТочкаПродажи = ТочкаПродажи[0]; 
	//Запись.Записать();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

Функция КоличествоНепроданныхЗаписей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШМ_Стойка.Продано,
		|	ШМ_Стойка.Идентификатор
		|ИЗ
		|	РегистрСведений.ШМ_Стойка КАК ШМ_Стойка
		|ГДЕ ШМ_Стойка.Продано=Ложь";
	Выборка = Запрос.Выполнить().Выгрузить();
	Сч=Выборка.Количество();
	Возврат Сч;
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	
	Сч=КоличествоНепроданныхЗаписей();
	
	Запись.Идентификатор=Строка(Запись.Номенклатура)+"_"+Строка(Запись.ДатаПоступления)+"_"+Строка(Сч)+"_"+Строка(ТекущаяДата());
	
КонецПроцедуры


