//////////////////////////////////////////////////////////////////////////////////////////
// СопоставлениеНоменклатурыКонтрагентов:
// механизм сопоставления номенклатуры контрагентов с номенклатурой информационной базы.
//
/////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ЗаполнениеСправочникаНоменклатураКонтрагентов

// Создает новую или обновляет существующую номенклатуру контрагента.
//
// Параметры:
//  ДанныеНоменклатурыКонтрагента - Структура - данные номенклатуры контрагента для создания элемента.
//                                              См. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагента.
//  НоменклатураИБ                - Структура - соответствие номенклатуре информационной базы.
//                                              См. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагентаИнформационнойБазы. 
//  Отказ                         - Булево - при записи объекта произошла ошибка.
//  ТекстОшибкиПользователю       - Строка - текст ошибки при возникновении исключительной ситуации.
//  ДополнительныеПараметры       - Структура - управляемые параметры при записи номенклатуры контрагента.
//                                              См. НовыеДополнительныеПараметрыПриЗаписиНоменклатурыКонтрагентов.
//  ПометитьНаУдаление            - Булево - признак пометки на удаление.
//
Процедура СоздатьОбновитьНоменклатуруКонтрагента(ДанныеНоменклатурыКонтрагента,
												Знач НоменклатураИБ,
												Отказ,
												ТекстОшибкиПользователю = "",
												Знач ДополнительныеПараметры = Неопределено,
												Знач ПометитьНаУдаление = Ложь) Экспорт
	
	ВладелецНоменклатуры = ДанныеНоменклатурыКонтрагента.Владелец;
	ТекстОшибки = "";
	
	Если Не ЗначениеЗаполнено(ВладелецНоменклатуры) Тогда
		ТекстОшибкиПользователю = НСтр("ru = 'Не заполнен владелец номенклатуры.'");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = НовыеДополнительныеПараметрыПриЗаписиНоменклатурыКонтрагентов();
	КонецЕсли;
	ТребуетсяЗаписьВРегистр                = ДополнительныеПараметры.ТребуетсяЗаписьВРегистр;
	ТребуетсяПоискСсылки                   = ДополнительныеПараметры.ТребуетсяПоискСсылки;
	ТребуетсяПоискЕдиницыИзмеренияПоОКЕИ   = ДополнительныеПараметры.ТребуетсяПоискЕдиницыИзмеренияПоОКЕИ;
	ДанныеРегистраНоменклатурыКонтрагентов = ДополнительныеПараметры.ДанныеРегистраНоменклатурыКонтрагентов;
	
	НоменклатураКонтрагента = ДанныеНоменклатурыКонтрагента.НоменклатураКонтрагента;
	
	МетаданныеОбъекта = Метаданные.Справочники.НоменклатураКонтрагентов;
	ПолноеИмяОбъекта  = МетаданныеОбъекта.ПолноеИмя();
	
	Представления = СопоставлениеНоменклатурыКонтрагентовСлужебный.ПредставленияНоменклатурыКонтрагентов();
	СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриОпределенииПредставленийСопоставленияНоменклатуры(
			Представления);
	ВладелецНоменклатурыВРодительномПадеже = НРег(Представления.ВладелецНоменклатурыВРодительномПадеже);
	
	НачатьТранзакцию();
	Попытка
		ЭлектронноеВзаимодействиеСлужебный.УстановитьУправляемуюБлокировку(ПолноеИмяОбъекта,
			Новый Структура("ВладелецНоменклатуры", ВладелецНоменклатуры));

		Если Не ЗначениеЗаполнено(НоменклатураКонтрагента) И ТребуетсяПоискСсылки Тогда
			НоменклатураКонтрагента = СсылкаНоменклатурыКонтрагентаПоДаннымКонтрагента(ДанныеНоменклатурыКонтрагента);
		КонецЕсли;

		Если ЗначениеЗаполнено(НоменклатураКонтрагента) Тогда
			ОбъектНоменклатураКонтрагента = НоменклатураКонтрагента.ПолучитьОбъект();
			ТекстСообщенияОшибки = СтрШаблон(НСтр("ru = 'Не удалось изменить номенклатуру %1 %2 по владельцу %3'", ОбщегоНазначения.КодОсновногоЯзыка()),
									ВладелецНоменклатурыВРодительномПадеже,
									НоменклатураКонтрагента.Наименование,
									ВладелецНоменклатуры);
		ИначеЕсли Не ПометитьНаУдаление Тогда
			ОбъектНоменклатураКонтрагента = Справочники.НоменклатураКонтрагентов.СоздатьЭлемент();
			ТекстСообщенияОшибки = СтрШаблон(НСтр("ru = 'Не удалось создать новую номенклатуру %1 по владельцу %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
									ВладелецНоменклатурыВРодительномПадеже,
									ВладелецНоменклатуры);
		Иначе
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;

		Если Не ПометитьНаУдаление Тогда

			ЗаполнитьОбъектНоменклатурыКонтрагента(ОбъектНоменклатураКонтрагента, ДанныеНоменклатурыКонтрагента,
				НоменклатураИБ, ТребуетсяПоискЕдиницыИзмеренияПоОКЕИ, ДанныеРегистраНоменклатурыКонтрагентов);

			Если ОбъектНоменклатураКонтрагента.ПометкаУдаления Тогда
				ОбъектНоменклатураКонтрагента.ПометкаУдаления = Ложь;
			КонецЕсли;
			
		Иначе
			ОбъектНоменклатураКонтрагента.ПометкаУдаления = Истина;
		КонецЕсли;
		
		Если Не ТребуетсяЗаписьВРегистр Тогда
			ОбъектНоменклатураКонтрагента.ДополнительныеСвойства.Вставить("Синхронизация");
		КонецЕсли;

		ОбъектНоменклатураКонтрагента.Записать();
		ОбъектНоменклатураКонтрагента.Разблокировать();
		ДанныеНоменклатурыКонтрагента.НоменклатураКонтрагента = ОбъектНоменклатураКонтрагента.Ссылка;
		
		СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриСохраненииСопоставленияНоменклатурыКонтрагентов(
			ДанныеНоменклатурыКонтрагента, НоменклатураИБ, Отказ, ТекстОшибкиПользователю);
			
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		КраткоеПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Если ПустаяСтрока(ТекстОшибкиПользователю) Тогда
			ТекстОшибкиПользователю = СтрШаблон(НСтр("ru = '%1 по причине:
													|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
													ТекстСообщенияОшибки,
													КраткоеПредставлениеОшибки);
		КонецЕсли;
		ЭлектронноеВзаимодействиеСлужебный.ВыполнитьЗаписьСобытияПоЭДВЖурналРегистрации(
			ТекстОшибки, "СопоставлениеНоменклатурыКонтрагентов", , , ОбъектНоменклатураКонтрагента);
		Отказ = Истина;
		
	КонецПопытки;
	
КонецПроцедуры

// Заполняет данные номенклатуры контрагента по ссылке или объекту справочника номенклатуры контрагента.
//
// Параметры:
//  НоменклатураКонтрагента       - СправочникСсылка.НоменклатураКонтрагентов - объект номенклатуры контрагента.
//                                  СправочникОбъект.НоменклатураКонтрагентов - ссылка номенклатуры контрагента.
//  ДанныеНоменклатурыКонтрагента - Структура                                 - данные номенклатуры контрагента.
//                                                                              См. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагента.
//
Процедура ЗаполнитьДанныеНоменклатурыКонтрагентаПоСсылке(НоменклатураКонтрагента, ДанныеНоменклатурыКонтрагента) Экспорт
	
	ЗаполнитьЗначенияСвойств(ДанныеНоменклатурыКонтрагента, НоменклатураКонтрагента);
	ДанныеНоменклатурыКонтрагента.Владелец                = НоменклатураКонтрагента.ВладелецНоменклатуры;
	Если ТипЗнч(НоменклатураКонтрагента) = Тип("СправочникОбъект.НоменклатураКонтрагентов") Тогда
		ДанныеНоменклатурыКонтрагента.НоменклатураКонтрагента = НоменклатураКонтрагента.Ссылка;
	Иначе
		ДанныеНоменклатурыКонтрагента.НоменклатураКонтрагента = НоменклатураКонтрагента;
	КонецЕсли;
	ДанныеНоменклатурыКонтрагента.Характеристика          = НоменклатураКонтрагента.НаименованиеХарактеристики;
	ДанныеНоменклатурыКонтрагента.Наименование            = НоменклатураКонтрагента.НаименованиеНоменклатуры;
	ДанныеНоменклатурыКонтрагента.ЕдиницаИзмерения        = НоменклатураКонтрагента.НаименованиеБазовойЕдиницыИзмерения;
	ДанныеНоменклатурыКонтрагента.НаименованиеУпаковки    = НоменклатураКонтрагента.НаименованиеУпаковки;
	ДанныеНоменклатурыКонтрагента.ЕдиницаИзмеренияКод     = НоменклатураКонтрагента.КодОКЕИБазовойЕдиницыИзмерения;
	ДанныеНоменклатурыКонтрагента.ШтрихкодКомбинации      = НоменклатураКонтрагента.Штрихкод;
	ДанныеНоменклатурыКонтрагента.ШтрихкодыНоменклатуры   = НоменклатураКонтрагента.ДругиеШтрихкодыНоменклатурыСтрокой;
	
КонецПроцедуры

// Заполняет объект номенклатуры контрагента.
//
// Параметры:
//  ОбъектНоменклатураКонтрагента          - СправочникОбъект.НоменклатураКонтрагентов - объект номенклатуры контрагента.
//  ДанныеНоменклатурыКонтрагента          - Структура из см. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагента 
//                                                                                     - данные номенклатуры контрагента.
//  НоменклатураИБ                         - Структура из см. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагентаИнформационнойБазы
//                                                                                     - данные номенклатуры информационной базы.
//  ТребуетсяПоискЕдиницыИзмеренияПоОКЕИ   - Булево                                    - признак необходимости выполнить поиск единицы измерения по ОКЕИ
//                                                                                       для заполнения данных контрагента, если единица измерения не была заполнена.
//  ДанныеРегистраНоменклатурыКонтрагентов - Булево                                    - данные номенклатуры контрагента заполнены из регистра сведений
//                                                                                       НоменклатураКонтрагентовБЭД.
//
Процедура ЗаполнитьОбъектНоменклатурыКонтрагента(ОбъектНоменклатураКонтрагента, ДанныеНоменклатурыКонтрагента, Знач НоменклатураИБ = Неопределено,
				Знач ТребуетсяПоискЕдиницыИзмеренияПоОКЕИ = Истина, Знач ДанныеРегистраНоменклатурыКонтрагентов = Ложь) Экспорт

	Если ЗначениеЗаполнено(Метаданные.Справочники.НоменклатураКонтрагентов.Владельцы) Тогда
		ЗаполнитьЗначенияСвойств(ОбъектНоменклатураКонтрагента, ДанныеНоменклатурыКонтрагента, , 
			"Наименование, КоличествоБазовойЕдиницыИзмерения, КоличествоУпаковок");
	Иначе
		ЗаполнитьЗначенияСвойств(ОбъектНоменклатураКонтрагента, ДанныеНоменклатурыКонтрагента, ,
			"Наименование, Владелец, КоличествоБазовойЕдиницыИзмерения, КоличествоУпаковок");
	КонецЕсли;

	ОбъектНоменклатураКонтрагента.ВладелецНоменклатуры               = ДанныеНоменклатурыКонтрагента.Владелец;
	ОбъектНоменклатураКонтрагента.НаименованиеХарактеристики         = ДанныеНоменклатурыКонтрагента.Характеристика;
	ОбъектНоменклатураКонтрагента.НаименованиеНоменклатуры           = ДанныеНоменклатурыКонтрагента.Наименование;
	ОбъектНоменклатураКонтрагента.Штрихкод                           = ДанныеНоменклатурыКонтрагента.ШтрихкодКомбинации;
	ОбъектНоменклатураКонтрагента.ДругиеШтрихкодыНоменклатурыСтрокой = ДанныеНоменклатурыКонтрагента.ШтрихкодыНоменклатуры;
		
	Если ПустаяСтрока(ОбъектНоменклатураКонтрагента.Идентификатор) Тогда
		
		ОбъектНоменклатураКонтрагента.Идентификатор = Справочники.НоменклатураКонтрагентов.ИдентификаторНоменклатурыКонтрагентаПоНаименованию(
																								ОбъектНоменклатураКонтрагента.НаименованиеНоменклатуры,
																								ОбъектНоменклатураКонтрагента.НаименованиеХарактеристики,
																								ОбъектНоменклатураКонтрагента.НаименованиеУпаковки);
	КонецЕсли;
	
	Если ПустаяСтрока(ДанныеНоменклатурыКонтрагента.ИдентификаторНоменклатуры) Тогда
		СопоставлениеНоменклатурыКонтрагентовСлужебныйКлиентСервер.РазделитьИдентификаторНаЧасти(
			ОбъектНоменклатураКонтрагента.Идентификатор, ОбъектНоменклатураКонтрагента);
		ДанныеНоменклатурыКонтрагента.ИдентификаторНоменклатуры   = ОбъектНоменклатураКонтрагента.ИдентификаторНоменклатуры;
		ДанныеНоменклатурыКонтрагента.ИдентификаторХарактеристики = ОбъектНоменклатураКонтрагента.ИдентификаторХарактеристики;
		ДанныеНоменклатурыКонтрагента.ИдентификаторУпаковки       = ОбъектНоменклатураКонтрагента.ИдентификаторУпаковки;
	КонецЕсли;
	
	ЗаполнитьДругиеШтрихкодыНоменклатуры(ОбъектНоменклатураКонтрагента);
	ЗаполнитьСведенияЕдиницИзмеренияУпаковок(ОбъектНоменклатураКонтрагента, ДанныеНоменклатурыКонтрагента,
		ТребуетсяПоискЕдиницыИзмеренияПоОКЕИ, ДанныеРегистраНоменклатурыКонтрагентов);
		
	Если Не ЗначениеЗаполнено(ОбъектНоменклатураКонтрагента.НаименованиеПолное) Тогда
		
		ОбъектНоменклатураКонтрагента.НаименованиеПолное = Справочники.НоменклатураКонтрагентов.ПолноеНаименованиеНоменклатурыКонтрагента(
																							ОбъектНоменклатураКонтрагента.НаименованиеНоменклатуры,
																							ОбъектНоменклатураКонтрагента.НаименованиеХарактеристики,
																							ОбъектНоменклатураКонтрагента.НаименованиеУпаковки);
	КонецЕсли;
	
	ОбъектНоменклатураКонтрагента.Наименование = ОбъектНоменклатураКонтрагента.НаименованиеПолное;
	
	Если ЗначениеЗаполнено(НоменклатураИБ) Тогда
		Если ЗначениеЗаполнено(НоменклатураИБ.Номенклатура) Тогда
			ОбъектНоменклатураКонтрагента.Номенклатура = НоменклатураИБ.Номенклатура;
		КонецЕсли;
		Если ЗначениеЗаполнено(НоменклатураИБ.Характеристика) Тогда
			ОбъектНоменклатураКонтрагента.Характеристика = НоменклатураИБ.Характеристика;
		КонецЕсли;
		Если ЗначениеЗаполнено(НоменклатураИБ.Упаковка) Тогда
			ОбъектНоменклатураКонтрагента.Упаковка = НоменклатураИБ.Упаковка;
		КонецЕсли;

		Если ЗначениеЗаполнено(ОбъектНоменклатураКонтрагента.Номенклатура) 
			И Не ЗначениеЗаполнено(ОбъектНоменклатураКонтрагента.Упаковка) Тогда
			СопоставлениеНоменклатурыКонтрагентовПереопределяемый.БазоваяЕдиницаИзмеренияНоменклатуры(
				ОбъектНоменклатураКонтрагента.Номенклатура, ОбъектНоменклатураКонтрагента.Упаковка);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

// Заполняет пустое сопоставление в номенклатуре контрагента по номенклатуре информационной базы из таблицы товаров.
//
// Параметры:
//  ТаблицаТоваров            - ТаблицаЗначений - таблицы товаров, которая будет помещена во временную таблицу.
//  Отказ                     - Булево          - признак наличия ошибок при выполнении процедуры.
//  ТаблицаТоваровПоУмолчанию - Булево          - признак необходимости использовать временную таблицу Товары с колонками:
//                                                НоменклатураКонтрагента, Номенклатура, Характеристика, Упаковка. 
//
Процедура ЗаполнитьПустоеСопоставлениеВНоменклатуреКонтрагентаПоНоменклатуреИБ(Знач ТаблицаТоваров, Отказ, ТаблицаТоваровПоУмолчанию = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", ТаблицаТоваров);
	Запрос.УстановитьПараметр("ПустаяНоменклатура", СопоставлениеНоменклатурыКонтрагентовСлужебный.ПустаяСсылкаНоменклатурыБЭД());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|ГДЕ
	|	Товары.Номенклатура <> &ПустаяНоменклатура
	|	И Товары.НоменклатураКонтрагента <> ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)";

	ТекстЗапроса = "";
	СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ТекстЗапросаПоискаНеСопоставленнойНоменклатурыКонтрагентовПоНоменклатуреИБ(
		ТекстЗапроса, ТаблицаТоваровПоУмолчанию);
		
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
		"ВЫБРАТЬ
		|	Товары.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Упаковка КАК Упаковка
		|ИЗ
		|	Товары КАК Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|		ПО Товары.НоменклатураКонтрагента = НоменклатураКонтрагентов.Ссылка
		|ГДЕ
		|	НоменклатураКонтрагентов.Номенклатура = &ПустаяНоменклатура";
		
	ИначеЕсли ТаблицаТоваровПоУмолчанию Тогда
		Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() + ТекстЗапроса;
	Иначе
		Запрос.Текст = ТекстЗапроса;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		
		НоменклатураКонтрагента = Выборка.НоменклатураКонтрагента;
		
		Попытка
			
			ЗаблокироватьДанныеДляРедактирования(НоменклатураКонтрагента);
			
			НоменклатураКонтрагентаОбъект = НоменклатураКонтрагента.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(НоменклатураКонтрагентаОбъект, Выборка);
			НоменклатураКонтрагентаОбъект.Записать();
			
		Исключение
			
			ТекстОшибки = НСтр("ru = 'Не удалось заблокировать %Элемент%. %ОписаниеОшибки%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Элемент%",        НоменклатураКонтрагента);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			Отказ = Истина;
			ВызватьИсключение ТекстОшибки;
			
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ПоискНоменклатурыКонтрагентов

// Возвращает текст запроса с дублирующими строками не сопоставленной номенклатуры контрагента в таблице товаров.
// В запроса используется параметр ПустаяНоменклатура, который необходимо установить в запросе.
//
// Параметры:
//  ИмяВременнойТаблицыТоваров - Строка - наименование временной таблицы. По умолчанию наименование "ВременнаяТаблицаТовары".
//                                        Таблица должна содержать колонки:
//   * НомерСтроки             - Строка                                        - номер строки товара.
//   * НоменклатураКонтрагента - СправочникСсылка.НоменклатураКонтрагентов     - ссылка номенклатуры контрагента.
//   * Номенклатура            - ОпределяемыйТип.НоменклатураБЭД               - ссылка номенклатуры.
//   * Характеристика          - ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД - ссылка характеристики.
//   * Упаковка                - ОпределяемыйТип.УпаковкаНоменклатурыБЭД       - ссылка упаковки.
//
// Возвращаемое значение:
//  Строка - текст запроса.
//
Функция ТекстЗапросаПоискаДублирующихСтрокНеСопоставленнойНоменклатурыКонтрагентов(Знач ИмяВременнойТаблицыТоваров = Неопределено) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	МАКСИМУМ(ВложенныйЗапросПоДублям.НомерСтроки) КАК НомерСтроки,
	|	ВложенныйЗапросПоДублям.НоменклатураКонтрагента КАК НоменклатураКонтрагента
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ДокументТовары.НомерСтроки) КАК НомерСтроки,
	|		ДокументТовары.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
	|		ДокументТовары.Номенклатура КАК Номенклатура,
	|		ДокументТовары.Характеристика КАК Характеристика,
	|		ДокументТовары.Упаковка КАК Упаковка
	|	ИЗ
	|		&ИмяВременнойТаблицыТоваров КАК ДокументТовары
	|	ГДЕ
	|		ДокументТовары.Номенклатура <> &ПустаяНоменклатура
	|		И ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|				ГДЕ
	|					НоменклатураКонтрагентов.Ссылка = ДокументТовары.НоменклатураКонтрагента
	|					И НоменклатураКонтрагентов.Номенклатура =&ПустаяНоменклатура)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДокументТовары.НоменклатураКонтрагента,
	|		ДокументТовары.Номенклатура,
	|		ДокументТовары.Характеристика,
	|		ДокументТовары.Упаковка) КАК ВложенныйЗапросПоДублям
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапросПоДублям.НоменклатураКонтрагента
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(*) > 1";
	
	Возврат СтрЗаменить(ТекстЗапроса, "&ИмяВременнойТаблицыТоваров", 
		?(ИмяВременнойТаблицыТоваров = Неопределено, "ВременнаяТаблицаТовары", ИмяВременнойТаблицыТоваров));
		
КонецФункции

// Возвращает результат запроса с найденной однозначной номенклатурой контрагента по таблице товаров при изменении владельца.
//
// Параметры:
//  ВладелецНоменклатуры - ОпределяемыйТип.ВладелецНоменклатурыБЭД - владелец номенклатуры.
//  Товары               - ТаблицаЗначений                         - содержит колонки:
//   * НомерСтроки             - Строка                                        - номер строки в таблице номенклатуры ИБ.
//                                                                               Если колонка отсутствует - добавляется в таблицу.
//   * Номенклатура            - ОпределяемыйТип.НоменклатураБЭД               - номенклатура информационной базы.
//   * Характеристика          - ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД - характеристика информационной базы.
//   * Упаковка                - ОпределяемыйТип.УпаковкаНоменклатурыБЭД       - упаковка информационной базы.
//   * НоменклатураКонтрагента - СправочникСсылка.НоменклатураКонтрагентов     - ссылка номенклатуры контрагентов.
//                                                                               Если колонка отсутствует - добавляется в таблицу.
//                                                                               Используется для поиска по идентификатору аналогичной
//                                                                               номенклатуры контрагента при смене владельца.
//
// Возвращаемое значение:
//  РезультатЗапроса - результат запроса поиска номенклатуры контрагента по номенклатуре информационной базы.
//   * НомерСтроки             - Строка                                        - номер строки из таблицы Товары
//   * НоменклатураКонтрагента - СправочникСсылка.НоменклатураКонтрагентов     - ссылка номенклатуры контрагентов.
//
Функция РезультатЗапросаПоискаНоменклатурыКонтрагентаПриИзмененииВладельца(Знач ВладелецНоменклатуры, Знач Товары) Экспорт
	
	Если Товары.Колонки.Найти("НомерСтроки") = Неопределено Тогда
		ТипНомераСтроки = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0, ДопустимыйЗнак.Неотрицательный));
		Товары.Колонки.Добавить("НомерСтроки", ТипНомераСтроки);
	КонецЕсли;
	
	Если Товары.Колонки.Найти("НоменклатураКонтрагента") = Неопределено Тогда
		Товары.Колонки.Добавить("НоменклатураКонтрагента", Новый ОписаниеТипов("СправочникСсылка.НоменклатураКонтрагентов"));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВладелецНоменклатуры", ВладелецНоменклатуры);
	Запрос.УстановитьПараметр("Товары", Товары);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Упаковка КАК Упаковка,
	|	Товары.НоменклатураКонтрагента КАК НоменклатураКонтрагента
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	НоменклатураКонтрагентов.Ссылка КАК НоменклатураКонтрагента,
	|	Товары.НоменклатураКонтрагента КАК СтараяНоменклатураКонтрагента
	|ПОМЕСТИТЬ НоменклатураКонтрагентаПоИдентификаторам
	|ИЗ
	|	Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК СтараяНоменклатураКонтрагентов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|			ПО СтараяНоменклатураКонтрагентов.Идентификатор = НоменклатураКонтрагентов.Идентификатор
	|				И (ИСТИНА В
	|					(ВЫБРАТЬ ПЕРВЫЕ 1
	|						ИСТИНА
	|					ИЗ
	|						Товары КАК Товары
	|					ГДЕ
	|						Товары.Номенклатура = НоменклатураКонтрагентов.Номенклатура
	|						И Товары.Характеристика = НоменклатураКонтрагентов.Характеристика
	|						И Товары.Упаковка = НоменклатураКонтрагентов.Упаковка))
	|		ПО Товары.НоменклатураКонтрагента = СтараяНоменклатураКонтрагентов.Ссылка
	|ГДЕ
	|	НоменклатураКонтрагентов.ВладелецНоменклатуры = &ВладелецНоменклатуры
	|	И НЕ НоменклатураКонтрагентов.ПометкаУдаления
	|	И НЕ НоменклатураКонтрагентов.Недействителен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураКонтрагентаПоИдентификаторам.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
	|	НоменклатураКонтрагентаПоИдентификаторам.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	НоменклатураКонтрагентаПоИдентификаторам КАК НоменклатураКонтрагентаПоИдентификаторам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(НоменклатураКонтрагентов.Ссылка),
	|	Товары.НомерСтроки
	|ИЗ
	|	Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|		ПО Товары.Номенклатура = НоменклатураКонтрагентов.Номенклатура
	|			И Товары.Характеристика = НоменклатураКонтрагентов.Характеристика
	|			И Товары.Упаковка = НоменклатураКонтрагентов.Упаковка
	|			И (НЕ ИСТИНА В
	|					(ВЫБРАТЬ ПЕРВЫЕ 1
	|						ИСТИНА
	|					ИЗ
	|						НоменклатураКонтрагентаПоИдентификаторам КАК НоменклатураКонтрагентаПоИдентификаторам
	|					ГДЕ
	|						НоменклатураКонтрагентаПоИдентификаторам.СтараяНоменклатураКонтрагента = Товары.НоменклатураКонтрагента))
	|ГДЕ
	|	НоменклатураКонтрагентов.ВладелецНоменклатуры = &ВладелецНоменклатуры
	|	И НЕ НоменклатураКонтрагентов.ПометкаУдаления
	|	И НЕ НоменклатураКонтрагентов.Недействителен
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.НомерСтроки
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(*) = 1";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Возвращает результат запроса с найденной однозначной номенклатурой контрагента по номенклатуре информационной базы в разрезе владельца.
//
// Параметры:
//  ВладелецНоменклатуры - ОпределяемыйТип.ВладелецНоменклатурыБЭД - владелец номенклатуры.
//  Товары               - ТаблицаЗначений                         - содержит колонки:
//   * НомерСтроки             - Строка                                        - номер строки в таблице номенклатуры ИБ.
//                                                                               Если колонка отсутствует - добавляется в таблицу.
//   * Номенклатура            - ОпределяемыйТип.НоменклатураБЭД               - номенклатура информационной базы.
//   * Характеристика          - ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД - характеристика информационной базы.
//   * Упаковка                - ОпределяемыйТип.УпаковкаНоменклатурыБЭД       - упаковка информационной базы.
//   * НоменклатураКонтрагента - СправочникСсылка.НоменклатураКонтрагентов     - ссылка номенклатуры контрагентов.
//                                                                               Если колонка отсутствует - добавляется в таблицу.
//                                                                               Используется для поиска по идентификатору аналогичной
//                                                                               номенклатуры контрагента при смене владельца.
//
// Возвращаемое значение:
//  РезультатЗапроса - результат запроса поиска номенклатуры контрагента по номенклатуре информационной базы.
//   * НомерСтроки                        - Строка                                        - номер строки из таблицы Товары
//   * НоменклатураКонтрагента            - СправочникСсылка.НоменклатураКонтрагентов     - ссылка номенклатуры контрагентов.
//   * КоличествоНоменклатурыКонтрагентов - Число                                         - количество найденных по фильтрации номенклатур контрагента.
//   * Номенклатура                       - ОпределяемыйТип.НоменклатураБЭД               - номенклатура информационной базы.
//   * Характеристика                     - ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД - характеристика информационной базы.
//   * Упаковка                           - ОпределяемыйТип.УпаковкаНоменклатурыБЭД       - упаковка информационной базы.
//
Функция РезультатЗапросаПоискаНоменклатурыКонтрагентаПоНоменклатуреИБ(Знач ВладелецНоменклатуры, Знач Товары) Экспорт
	
	Если Товары.Колонки.Найти("НомерСтроки") = Неопределено Тогда
		ТипНомераСтроки = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0, ДопустимыйЗнак.Неотрицательный));
		Товары.Колонки.Добавить("НомерСтроки", ТипНомераСтроки);
	КонецЕсли;
	
	Если Товары.Колонки.Найти("НоменклатураКонтрагента") = Неопределено Тогда
		Товары.Колонки.Добавить("НоменклатураКонтрагента", Новый ОписаниеТипов("СправочникСсылка.НоменклатураКонтрагентов"));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВладелецНоменклатуры", ВладелецНоменклатуры);
	Запрос.УстановитьПараметр("Товары"              , Товары);
	Запрос.УстановитьПараметр("ПустаяНоменклатура"  , СопоставлениеНоменклатурыКонтрагентовСлужебный.ПустаяСсылкаНоменклатурыБЭД());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Упаковка КАК Упаковка,
	|	Товары.НоменклатураКонтрагента КАК НоменклатураКонтрагента
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|ГДЕ
	|	Товары.Номенклатура <> &ПустаяНоменклатура
	|	И Товары.НоменклатураКонтрагента = ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(НоменклатураКонтрагентов.Ссылка) КАК НоменклатураКонтрагента,
	|	Товары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|		ПО Товары.Номенклатура = НоменклатураКонтрагентов.Номенклатура
	|			И Товары.Характеристика = НоменклатураКонтрагентов.Характеристика
	|			И Товары.Упаковка = НоменклатураКонтрагентов.Упаковка
	|ГДЕ
	|	НоменклатураКонтрагентов.ВладелецНоменклатуры = &ВладелецНоменклатуры
	|	И НЕ НоменклатураКонтрагентов.ПометкаУдаления
	|	И НЕ НоменклатураКонтрагентов.Недействителен
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.НомерСтроки
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(*) = 1";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Возвращает номенклатуру контрагента найденную по номенклатуре информационной базы в строке таблицы.
//
// Параметры:
//  ВладелецНоменклатуры - ОпределяемыйТип,ВладелецНоменклатурыБЭД - владелец номенклатуры.
//  НоменклатураИБ - Структура - содержит информацию из строки таблицы. 
//                               См. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагентаИнформационнойБазы.
//
// Возвращаемое значение:
//  СправочникСсылка.НоменклатураКонтрагентов - ссылка на найденную номенклатуру контрагента.
//                                              Если номенклатура контрагента не найдена возвращается пустая ссылка.
//
Функция НоменклатураКонтрагентаПоНоменклатуреВСтрокеТаблицы(Знач ВладелецНоменклатуры, Знач НоменклатураИБ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВладелецНоменклатуры"   , ВладелецНоменклатуры);
	Запрос.УстановитьПараметр("Номенклатура"           , НоменклатураИБ.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика"         , НоменклатураИБ.Характеристика);
	Запрос.УстановитьПараметр("Упаковка"               , НоменклатураИБ.Упаковка);
	Запрос.УстановитьПараметр("НоменклатураКонтрагента", НоменклатураИБ.НоменклатураКонтрагента);
	Запрос.УстановитьПараметр("ПустаяНоменклатура"     , СопоставлениеНоменклатурыКонтрагентовСлужебный.ПустаяСсылкаНоменклатурыБЭД());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(НоменклатураКонтрагентов.Ссылка) КАК НоменклатураКонтрагента,
	|	КОЛИЧЕСТВО(*) КАК КоличествоНоменклатурыКонтрагента
	|ПОМЕСТИТЬ НоменклатураКонтрагентаПоиска
	|ИЗ
	|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|ГДЕ
	|	НоменклатураКонтрагентов.ВладелецНоменклатуры = &ВладелецНоменклатуры
	|	И НоменклатураКонтрагентов.Номенклатура = &Номенклатура
	|	И НоменклатураКонтрагентов.Характеристика = &Характеристика
	|	И НоменклатураКонтрагентов.Упаковка = &Упаковка
	|	И НЕ НоменклатураКонтрагентов.ПометкаУдаления
	|	И НЕ НоменклатураКонтрагентов.Недействителен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НоменклатураКонтрагентов.Номенклатура = &ПустаяНоменклатура
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СопоставлениеЗаполнено,
	|	ВЫБОР
	|		КОГДА НоменклатураКонтрагентов.Номенклатура = &Номенклатура
	|				И НоменклатураКонтрагентов.Характеристика = &Характеристика
	|				И НоменклатураКонтрагентов.Упаковка = &Упаковка
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Сопоставлено,
	|	НоменклатураКонтрагентов.Ссылка КАК НоменклатураКонтрагента
	|ПОМЕСТИТЬ НоменклатураКонтрагентовИзТаблицы
	|ИЗ
	|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|ГДЕ
	|	НоменклатураКонтрагентов.Ссылка = &НоменклатураКонтрагента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА НоменклатураКонтрагентов.Номенклатура = &ПустаяНоменклатура
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НоменклатураКонтрагентов.Номенклатура = &Номенклатура
	|				И НоменклатураКонтрагентов.Характеристика = &Характеристика
	|				И НоменклатураКонтрагентов.Упаковка = &Упаковка
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	НоменклатураКонтрагентов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НоменклатураКонтрагентовИзТаблицы.Сопоставлено = ИСТИНА
	|			ТОГДА НоменклатураКонтрагентовИзТаблицы.НоменклатураКонтрагента
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НоменклатураКонтрагентаПоиска.КоличествоНоменклатурыКонтрагента = 1
	|					ТОГДА НоменклатураКонтрагентаПоиска.НоменклатураКонтрагента
	|				ИНАЧЕ ВЫБОР
	|						КОГДА НоменклатураКонтрагентовИзТаблицы.СопоставлениеЗаполнено = ЛОЖЬ
	|							ТОГДА НоменклатураКонтрагентовИзТаблицы.НоменклатураКонтрагента
	|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НоменклатураКонтрагента
	|ИЗ
	|	НоменклатураКонтрагентаПоиска КАК НоменклатураКонтрагентаПоиска
	|		ПОЛНОЕ СОЕДИНЕНИЕ НоменклатураКонтрагентовИзТаблицы КАК НоменклатураКонтрагентовИзТаблицы
	|		ПО (ИСТИНА)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НоменклатураКонтрагента;
	Иначе
		Возврат Справочники.НоменклатураКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Возвращает таблицу данных номенклатуры контрагентов найденных по уникальным идентификаторам.
//
// Параметры:
//  УникальныеИдентификаторы - Массив из Строка - уникальные идентификаторы, по которым необходимо вернуть данные номенклатуры контрагентов.
//
// Возвращаемое значение:
//  ТаблицаЗначений - данные номенклатуры контрагента:
//   * НоменклатураКонтрагента             - СправочникСсылка.НоменклатураКонтрагентов - ссылка номенклатуры контрагента.
//   * ВладелецНоменклатуры                - ОпределяемыйТип.ВладелецНоменклатурыБЭД   - ссылка на владельца номенклатуры контрагента.
//   * Идентификатор                       - Строка                                    - идентификатор номенклатуры контрагента.
//   * ИдентификаторНоменклатурыСервиса    - Строка                                    - идентификатор номенклатуры в сервисе 1С:Номенклатура.
//   * ИдентификаторХарактеристикиСервиса  - Строка                                    - идентификатор характеристики в сервисе 1С:Номенклатура.
//   * НаименованиеНоменклатуры            - Строка                                    - наименование номенклатуры.
//   * НаименованиеХарактеристики          - Строка                                    - наименование характеристики.
//   * НаименованиеУпаковки                - Строка                                    - наименование упаковки.
//   * НаименованиеБазовойЕдиницыИзмерения - Строка                                    - наименование базовой единицы измерения.
//   * КодОКЕИБазовойЕдиницыИзмерения      - Строка                                    - код ОКЕИ единицы измерения.
//   * КоличествоБазовойЕдиницыИзмерения   - Строка                                    - числитель.
//   * КоличествоУпаковок                  - Строка                                    - знаменатель.
//   * Штрихкод                            - Строка                                    - штрихкод комбинации: номенклатура, характеристика, упаковка.
//   * ДругиеШтрихкодыНоменклатурыСтрокой  - Строка                                    - штрихкоды номенклатуры через запятую.
//   * Артикул                             - Строка                                    - артикул.
//   * СтавкаНДС                           - Строка                                    - ставка ндс.
//
Функция ДанныеНоменклатурыКонтрагентовПоВнутреннимИдентификаторам(Знач УникальныеИдентификаторы) Экспорт
	
	СсылкиНоменклатурыКонтрагентов = Новый Массив;
	Для Каждого Идентификатор Из УникальныеИдентификаторы Цикл
		
		Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Идентификатор) Тогда
			Продолжить;
		КонецЕсли;
		
		Ссылка = Справочники.НоменклатураКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
		Если ЗначениеЗаполнено(Ссылка) Тогда
			СсылкиНоменклатурыКонтрагентов.Добавить(Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкиНоменклатурыКонтрагентов", СсылкиНоменклатурыКонтрагентов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураКонтрагентов.Ссылка КАК НоменклатураКонтрагента,
	|	НоменклатураКонтрагентов.ВладелецНоменклатуры,
	|	НоменклатураКонтрагентов.Идентификатор,
	|	НоменклатураКонтрагентов.ИдентификаторНоменклатурыСервиса,
	|	НоменклатураКонтрагентов.ИдентификаторХарактеристикиСервиса,
	|	НоменклатураКонтрагентов.НаименованиеНоменклатуры,
	|	НоменклатураКонтрагентов.НаименованиеХарактеристики,
	|	НоменклатураКонтрагентов.НаименованиеУпаковки,
	|	НоменклатураКонтрагентов.НаименованиеБазовойЕдиницыИзмерения,
	|	НоменклатураКонтрагентов.КодОКЕИБазовойЕдиницыИзмерения,
	|	НоменклатураКонтрагентов.КоличествоБазовойЕдиницыИзмерения,
	|	НоменклатураКонтрагентов.КоличествоУпаковок,
	|	НоменклатураКонтрагентов.Штрихкод,
	|	НоменклатураКонтрагентов.ДругиеШтрихкодыНоменклатурыСтрокой,
	|	НоменклатураКонтрагентов.Артикул,
	|	НоменклатураКонтрагентов.СтавкаНДС
	|ИЗ
	|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|ГДЕ
	|	НоменклатураКонтрагентов.Ссылка В (&СсылкиНоменклатурыКонтрагентов)";
	
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Добавить("КлючЗаписи",  Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(36)));
	Для Каждого ЭлементВыборки Из Результат Цикл
		ЭлементВыборки.КлючЗаписи = XMLСтрока(ЭлементВыборки.НоменклатураКонтрагента);
	КонецЦикла;
	
	Результат.Индексы.Добавить("КлючЗаписи");
	
	Возврат Результат;
	
КонецФункции

// Возвращает результат запроса с исходной таблицей, в которую добавлена колонка "НоменклатураКонтрагентов", заполненная
//  сопоставленной номенклатурой по идентификаторам поставщика
//
// Параметры:
//  ТаблицаТоваров - ТаблицаЗначений - Содержит колонки:
//   * НомерСтроки             - Строка                                        - номер строки в таблице номенклатуры ИБ.
//                                                                               Если колонка отсутствует - добавляется в таблицу.
//   * Владелец                - ОпределяемыйТип.ВладелецНоменклатурыБЭД       - владелец номенклатуры.
//   * Номенклатура            - ОпределяемыйТип.НоменклатураБЭД               - номенклатура информационной базы.
//   * Характеристика          - ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД - характеристика информационной базы.
//   * Упаковка                - ОпределяемыйТип.УпаковкаНоменклатурыБЭД       - упаковка информационной базы.
//   * Идентификатор           - Строка                                        - идентификатор номенклатуры поставщика.
// 
// Возвращаемое значение:
//  РезультатЗапроса - Содержит колонки:
//   * НомерСтроки             - Строка                                        - номер строки в таблице номенклатуры ИБ.
//                                                                               Если колонка отсутствует - добавляется в таблицу.
//   * Владелец                - ОпределяемыйТип.ВладелецНоменклатурыБЭД       - владелец номенклатуры.
//   * Номенклатура            - ОпределяемыйТип.НоменклатураБЭД               - номенклатура информационной базы.
//   * Характеристика          - ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД - характеристика информационной базы.
//   * Упаковка                - ОпределяемыйТип.УпаковкаНоменклатурыБЭД       - упаковка информационной базы.
//   * Идентификатор           - Строка                                        - идентификатор номенклатуры поставщика.
//   * НоменклатураКонтрагента - СправочникСсылка.НоменклатураКонтрагентов     - ссылка номенклатуры контрагентов.
//
Функция РезультатЗапросаСопоставленияНоменклатурыПоИдентификатору(ТаблицаТоваров) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТоваров.Владелец КАК Владелец,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Упаковка КАК Упаковка,
	|	ТаблицаТоваров.Идентификатор КАК Идентификатор,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Владелец,
	|	Номенклатура,
	|	Характеристика,
	|	Упаковка,
	|	Идентификатор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Владелец КАК Владелец,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Упаковка КАК Упаковка,
	|	ТаблицаТоваров.Идентификатор КАК Идентификатор,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(МАКСИМУМ(НоменклатураКонтрагентов.Ссылка), ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)) КАК НоменклатураКонтрагента
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|		ПО ТаблицаТоваров.Владелец = НоменклатураКонтрагентов.ВладелецНоменклатуры
	|			И ТаблицаТоваров.Номенклатура = НоменклатураКонтрагентов.Номенклатура
	|			И ТаблицаТоваров.Характеристика = НоменклатураКонтрагентов.Характеристика
	|			И ТаблицаТоваров.Упаковка = НоменклатураКонтрагентов.Упаковка
	|			И ТаблицаТоваров.Идентификатор = НоменклатураКонтрагентов.Идентификатор
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Владелец,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика,
	|	ТаблицаТоваров.Упаковка,
	|	ТаблицаТоваров.Идентификатор,
	|	ТаблицаТоваров.НомерСтроки
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НоменклатураКонтрагентов.Ссылка) = 1";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Область РаботаСРегистромНоменклатураКонтрагентовБЭД

// Сохраняет данные о номенклатуре контрагента и устанавливает их соответствие номенклатуре информационной базы.
//
// Параметры:
//  НоменклатураКонтрагента    - Структура - номенклатура контрагента. См. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагента.
//  НоменклатураИБ             - Структура - номенклатура ИБ. См. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураИнформационнойБазы.
//                                           Если Неопределено, то данные о номенклатуре контрагента сохраняются
//                                           без сопоставления с номенклатурой информационной базы.
//  ИспользоватьХарактеристики - Булево - признак использования характеристики в номенклатуре.
//  Замещать                   - Булево - признак замещения записей.
//
Процедура УстановитьСоответствиеНоменклатуры(Знач НоменклатураКонтрагента, Знач НоменклатураИБ = Неопределено, 
			Знач ИспользоватьХарактеристики = Неопределено, Замещать = Истина) Экспорт
	
	СопоставлениеНоменклатурыКонтрагентовСлужебный.УстановитьСоответствиеНоменклатуры(
		НоменклатураКонтрагента, НоменклатураИБ, ИспользоватьХарактеристики, Замещать);
	
КонецПроцедуры

// Удаляет данные о номенклатуре контрагента из информационной базы.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - номенклатура контрагента для удаления. 
//                                        Обязательно должны быть заданы свойства "Владелец" и "Идентификатор". 
//                                        См. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагента.
//
Процедура УдалитьСоответствиеНоменклатуры(Знач НоменклатураКонтрагента) Экспорт
	
	СопоставлениеНоменклатурыКонтрагентовСлужебный.УдалитьСоответствиеНоменклатуры(НоменклатураКонтрагента);
	
КонецПроцедуры

// Возвращает соответствие номенклатуры контрагента и информационной базы, удовлетворяющие отбору.
//
// Параметры:
//  Отбор                - Структура - критерий отбора, который может содержать следующие свойства:
//   * НоменклатураКонтрагента - Структура - поиск по номенклатуре контрагента.
//                                           Используется только поиск по свойствам "Владелец" и "Идентификатор".
//                                           См. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагента.
//   * НоменклатураИБ - Структура - поиск по номенклатуре информационной базы. 
//                                           См. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураИнформационнойБазы.
//   * Владелец - ОпределяемыйТип.ВладелецНоменклатурыБЭД - отбор по владельцу номенклатуры. Актуально, если задан только отбор по номенклатуре ИБ.
//  ТолькоСопоставленные - Булево - возвращаются только такие элементы, у которых заполнена номенклатура информационной базы.
//
// Возвращаемое значение:
//  Массив - соответствия номенклатуры, удовлетворяющие отбору. Элементы массива представлены структурой:
//   * НоменклатураКонтрагента - См. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагента.
//   * НоменклатураИБ          - См. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураИнформационнойБазы.
//
Функция НайтиСоответствиеНоменклатуры(Знач Отбор = Неопределено, Знач ТолькоСопоставленные = Ложь) Экспорт
	
	Возврат СопоставлениеНоменклатурыКонтрагентовСлужебный.НайтиСоответствиеНоменклатуры(Отбор, ТолькоСопоставленные);
	
КонецФункции

// Создает временную таблицу соответствия номенклатуры контрагентов и информационной базы.
// Колонки:
//  * Идентификатор                       - Строка - идентификатор номенклатуры.
//  * Наименование                        - Строка - наименование номенклатуры.
//  * НаименованиеХарактеристики          - Строка - наименование характеристики.
//  * ЕдиницаИзмерения                    - Строка - если заполнено наименование упаковки передается оно, иначе наименование единицы измерения (базовой).
//  * ЕдиницаИзмеренияКод                 - Строка - код единицы измерения.
//  * Артикул                             - Строка - артикул номенклатуры.
//  * СтавкаНДС                           - Строка - ставка НДС номенклатуры.
//  * Штрихкод                            - Строка - штрихкод (не используется, вместо него используются поля:штрихкод комбинации и штрихкод номенклатуры).
//  * ШтрихкодКомбинации                  - Строка - штрихкод комбинации: номенклатура, характеристика, упаковка.
//  * ШтрихкодыНоменклатуры               - Строка - штрихкоды номенклатуры через запятую.
//  * ИдентификаторНоменклатурыСервиса    - Строка - идентификатор номенклатуры в сервисе 1С:Номенклатура.
//  * ИдентификаторХарактеристикиСервиса  - Строка - идентификатор характеристики в сервисе 1С:Номенклатура.
//  * НаименованиеУпаковки                - Строка - наименование упаковки.
//  * НаименованиеБазовойЕдиницаИзмерения - Строка - наименование базовой единицы измерения.
//  * Владелец                            - ОпределяемыйТип.ВладелецНоменклатурыБЭД       - владелец номенклатуры информационной базы.
//  * Номенклатура                        - ОпределяемыйТип.НоменклатураБЭД               - номенклатура информационной базы.
//  * Характеристика                      - ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД - характеристика информационной базы.
//  * Упаковка                            - ОпределяемыйТип.УпаковкаНоменклатурыБЭД       - упаковка информационной базы.
//
// Параметры:
//  ТаблицаОтбора           - ТаблицаЗначений         - таблица для отбора записей сопоставления.
//                                                      Отбор производиться по следующему сочетанию полей:
//                                                      * (Владелец, Идентификатор), если идентификатор не равен пустой строке.
//                                                      * (Владелец, Номенклатура, Характеристика, Упаковка), если идентификатор равен пустой строке.
//   * Владелец       - ОпределяемыйТип.ВладелецНоменклатурыБЭД       - владелец номенклатуры.
//   * Идентификатор  - Строка                                        - идентификатор номенклатуры.
//   * Номенклатура   - ОпределяемыйТип.НоменклатураБЭД               - номенклатура информационной базы.
//   * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД - характеристика информационной базы.
//   * Упаковка       - ОпределяемыйТип.УпаковкаНоменклатурыБЭД       - упаковка информационной базы.
//  ИмяВременнойТаблицы     - Строка                  - имя временной таблицы, в которую нужно поместить отобранные данные.
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц, в котором будет создана временная таблица.
//
Процедура СоздатьВременнуюТаблицуСоответствияНоменклатуры(Знач ТаблицаОтбора, Знач ИмяВременнойТаблицы, МенеджерВременныхТаблиц) Экспорт
	
	Если ТаблицаОтбора.Колонки.Найти("НомерСтроки") = Неопределено Тогда
		ТипНомераСтроки = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0, ДопустимыйЗнак.Неотрицательный));
		ТаблицаОтбора.Колонки.Добавить("НомерСтроки", ТипНомераСтроки);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаОтбора.НомерСтроки КАК НомерСтроки,
	|	ТаблицаОтбора.Владелец КАК Владелец,
	|	ТаблицаОтбора.Идентификатор КАК Идентификатор,
	|	ТаблицаОтбора.Номенклатура КАК Номенклатура,
	|	ТаблицаОтбора.Характеристика КАК Характеристика,
	|	ТаблицаОтбора.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ втОтбор
	|ИЗ
	|	&ТаблицаОтбора КАК ТаблицаОтбора
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Владелец,
	|	Идентификатор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураКонтрагентовБЭД.Владелец КАК Владелец,
	|	НоменклатураКонтрагентовБЭД.Идентификатор КАК Идентификатор,
	|	НоменклатураКонтрагентовБЭД.Наименование КАК Наименование,
	|	НоменклатураКонтрагентовБЭД.НаименованиеХарактеристики КАК НаименованиеХарактеристики,
	|	ВЫБОР
	|		КОГДА НоменклатураКонтрагентовБЭД.НаименованиеУпаковки <> """"
	|			ТОГДА НоменклатураКонтрагентовБЭД.НаименованиеУпаковки
	|		ИНАЧЕ НоменклатураКонтрагентовБЭД.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	НоменклатураКонтрагентовБЭД.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	НоменклатураКонтрагентовБЭД.Артикул КАК Артикул,
	|	НоменклатураКонтрагентовБЭД.СтавкаНДС КАК СтавкаНДС,
	|	НоменклатураКонтрагентовБЭД.ИдентификаторНоменклатурыСервиса КАК ИдентификаторНоменклатурыСервиса,
	|	НоменклатураКонтрагентовБЭД.ИдентификаторХарактеристикиСервиса КАК ИдентификаторХарактеристикиСервиса,
	|	НоменклатураКонтрагентовБЭД.Номенклатура КАК Номенклатура,
	|	НоменклатураКонтрагентовБЭД.Характеристика КАК Характеристика,
	|	НоменклатураКонтрагентовБЭД.Упаковка КАК Упаковка,
	|	втОтбор.НомерСтроки КАК НомерСтроки,
	|	НоменклатураКонтрагентовБЭД.ШтрихкодКомбинации КАК ШтрихкодКомбинации,
	|	НоменклатураКонтрагентовБЭД.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры,
	|	НоменклатураКонтрагентовБЭД.Штрихкод КАК Штрихкод,
	|	НоменклатураКонтрагентовБЭД.НаименованиеУпаковки КАК НаименованиеУпаковки,
	|	НоменклатураКонтрагентовБЭД.ЕдиницаИзмерения КАК НаименованиеБазовойЕдиницаИзмерения
	|ПОМЕСТИТЬ втРезультат
	|ИЗ
	|	РегистрСведений.НоменклатураКонтрагентовБЭД КАК НоменклатураКонтрагентовБЭД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОтбор КАК втОтбор
	|		ПО НоменклатураКонтрагентовБЭД.Владелец = втОтбор.Владелец
	|		И НоменклатураКонтрагентовБЭД.Идентификатор = втОтбор.Идентификатор
	|		И (втОтбор.Идентификатор <> """")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НоменклатураКонтрагентовБЭД.Владелец,
	|	НоменклатураКонтрагентовБЭД.Идентификатор,
	|	НоменклатураКонтрагентовБЭД.Наименование,
	|	НоменклатураКонтрагентовБЭД.НаименованиеХарактеристики,
	|	ВЫБОР
	|		КОГДА НоменклатураКонтрагентовБЭД.НаименованиеУпаковки <> """"
	|			ТОГДА НоменклатураКонтрагентовБЭД.НаименованиеУпаковки
	|		ИНАЧЕ НоменклатураКонтрагентовБЭД.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	НоменклатураКонтрагентовБЭД.ЕдиницаИзмеренияКод,
	|	НоменклатураКонтрагентовБЭД.Артикул,
	|	НоменклатураКонтрагентовБЭД.СтавкаНДС,
	|	НоменклатураКонтрагентовБЭД.ИдентификаторНоменклатурыСервиса,
	|	НоменклатураКонтрагентовБЭД.ИдентификаторХарактеристикиСервиса,
	|	НоменклатураКонтрагентовБЭД.Номенклатура,
	|	НоменклатураКонтрагентовБЭД.Характеристика,
	|	НоменклатураКонтрагентовБЭД.Упаковка,
	|	втОтбор.НомерСтроки,
	|	НоменклатураКонтрагентовБЭД.ШтрихкодКомбинации,
	|	НоменклатураКонтрагентовБЭД.ШтрихкодыНоменклатуры,
	|	НоменклатураКонтрагентовБЭД.Штрихкод,
	|	НоменклатураКонтрагентовБЭД.НаименованиеУпаковки КАК НаименованиеУпаковки,
	|	НоменклатураКонтрагентовБЭД.ЕдиницаИзмерения КАК НаименованиеБазовойЕдиницаИзмерения
	|ИЗ
	|	РегистрСведений.НоменклатураКонтрагентовБЭД КАК НоменклатураКонтрагентовБЭД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОтбор КАК втОтбор
	|		ПО НоменклатураКонтрагентовБЭД.Владелец = втОтбор.Владелец
	|		И НоменклатураКонтрагентовБЭД.Номенклатура = втОтбор.Номенклатура
	|		И НоменклатураКонтрагентовБЭД.Характеристика = втОтбор.Характеристика
	|		И НоменклатураКонтрагентовБЭД.Упаковка = втОтбор.Упаковка
	|		И (втОтбор.Идентификатор = """")
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втОтбор";
	Запрос.УстановитьПараметр("ТаблицаОтбора", ТаблицаОтбора);
	Если ИмяВременнойТаблицы = "втОтбор" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "втОтбор", "втОтбор1");
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "втРезультат", ИмяВременнойТаблицы);
	Запрос.Выполнить();
	
КонецПроцедуры

// Возвращает текст запроса соответствия номенклатуры контрагента по идентификатору и владельцу.
//
// Параметры:
//  ИмяВременнойТаблицыОтбора          - Строка - наименование временной таблицы с колонками поиска:
//   * Идентификатор - Строка                                  - идентификатор номенклатуры контрагента.
//   * Владелец      - ОпределяемыйТип.ВладелецНоменклатурыБЭД - владелец номенклатуры информационной базы. 
//
// Возвращаемое значение:
// ТекстЗапроса - содержит колонки:
//  * Идентификатор                       - Строка - идентификатор номенклатуры контрагента.
//  * ИдентификаторНоменклатуры           - Строка - идентификатор номенклатуры.
//  * ИдентификаторХарактеристики         - Строка - идентификатор характеристики.
//  * ИдентификаторУпаковки               - Строка - идентификатор упаковки.
//  * Наименование                        - Строка - наименование номенклатуры.
//  * НаименованиеХарактеристики          - Строка - наименование характеристики.
//  * ЕдиницаИзмерения                    - Строка - единица измерения.
//  * ЕдиницаИзмеренияКод                 - Строка - код единицы измерения.
//  * Артикул                             - Строка - артикул номенклатуры.
//  * СтавкаНДС                           - Строка - ставка НДС номенклатуры.
//  * Штрихкод                            - Строка - штрихкод (не используется, вместо него используются поля:штрихкод комбинации и штрихкод номенклатуры).
//  * ШтрихкодКомбинации                  - Строка - штрихкод комбинации: номенклатура, характеристика, упаковка.
//  * ШтрихкодыНоменклатуры               - Строка - штрихкоды номенклатуры через запятую.
//  * ИдентификаторНоменклатурыСервиса    - Строка - идентификатор номенклатуры в сервисе 1С:Номенклатура.
//  * ИдентификаторХарактеристикиСервиса  - Строка - идентификатор характеристики в сервисе 1С:Номенклатура.
//  * НаименованиеУпаковки                - Строка - наименование упаковки.
//  * НаименованиеБазовойЕдиницаИзмерения - Строка - наименование базовой единицы измерения.
//  * ИспользоватьХарактеристики          - Булево - признак использования характеристики на момент заполнения 
//														соответствия номенклатуры контрагента и номенклатуры ИБ. 
//  * Владелец                            - ОпределяемыйТип.ВладелецНоменклатурыБЭД       - владелец номенклатуры информационной базы.
//  * Номенклатура                        - ОпределяемыйТип.НоменклатураБЭД               - номенклатура информационной базы.
//  * Характеристика                      - ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД - характеристика информационной базы.
//  * Упаковка                            - ОпределяемыйТип.УпаковкаНоменклатурыБЭД       - упаковка информационной базы.
//
Функция ИнициализироватьТекстЗапросаСоответствияНоменклатурыКонтрагентовБЭДПоИдентификаторуИВладельцу(Знач ИмяВременнойТаблицыОтбора = Неопределено) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОтборов.Идентификатор КАК Идентификатор,
	|	ТаблицаОтборов.Владелец КАК Владелец
	|ПОМЕСТИТЬ ТаблицаУникальныхОтобров
	|ИЗ
	|	ТаблицаОтборов КАК ТаблицаОтборов
	|ГДЕ
	|	ТаблицаОтборов.Идентификатор <> """"
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Идентификатор,
	|	Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураКонтрагентовБЭД.Владелец КАК Владелец,
	|	НоменклатураКонтрагентовБЭД.Идентификатор КАК Идентификатор,
	|	НоменклатураКонтрагентовБЭД.Наименование,
	|	НоменклатураКонтрагентовБЭД.НаименованиеХарактеристики,
	|	НоменклатураКонтрагентовБЭД.ЕдиницаИзмерения,
	|	НоменклатураКонтрагентовБЭД.ЕдиницаИзмеренияКод,
	|	НоменклатураКонтрагентовБЭД.Артикул,
	|	НоменклатураКонтрагентовБЭД.СтавкаНДС,
	|	НоменклатураКонтрагентовБЭД.Штрихкод,
	|	НоменклатураКонтрагентовБЭД.ИдентификаторНоменклатурыСервиса,
	|	НоменклатураКонтрагентовБЭД.ИдентификаторХарактеристикиСервиса,
	|	НоменклатураКонтрагентовБЭД.Номенклатура,
	|	НоменклатураКонтрагентовБЭД.Характеристика,
	|	НоменклатураКонтрагентовБЭД.Упаковка,
	|	НоменклатураКонтрагентовБЭД.ИдентификаторНоменклатуры,
	|	НоменклатураКонтрагентовБЭД.ИдентификаторХарактеристики,
	|	НоменклатураКонтрагентовБЭД.ИдентификаторУпаковки,
	|	НоменклатураКонтрагентовБЭД.ИспользоватьХарактеристики,
	|	НоменклатураКонтрагентовБЭД.ШтрихкодКомбинации,
	|	НоменклатураКонтрагентовБЭД.ШтрихкодыНоменклатуры,
	|	НоменклатураКонтрагентовБЭД.НаименованиеУпаковки
	|ПОМЕСТИТЬ НоменклатураКонтрагентовБЭД
	|ИЗ
	|	РегистрСведений.НоменклатураКонтрагентовБЭД КАК НоменклатураКонтрагентовБЭД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаУникальныхОтобров КАК ТаблицаУникальныхОтобров
	|		ПО НоменклатураКонтрагентовБЭД.Владелец = ТаблицаУникальныхОтобров.Владелец
	|		И НоменклатураКонтрагентовБЭД.Идентификатор = ТаблицаУникальныхОтобров.Идентификатор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Владелец,
	|	Идентификатор";
	
	Если ИмяВременнойТаблицыОтбора <> Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаОтборов", ИмяВременнойТаблицыОтбора);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Конструкторы

// Возвращает параметры при создании формы документа.
//
// Возвращаемое значение:
//  Структура - содержит:
//   * ВариантУказанияНоменклатурыПоУмолчанию      - ПеречислениеСсылка.ВариантыУказанияНоменклатурыБЭД - устанавливается вариант по умолчанию,
//                                                                                                        если не заданы другие настройки.
//   * ПредставлениеУчитыватьНоменклатуруВладельца - Строка - представление команды учитывать номенклатуру владельца. 
//                                                            Например, "Учитывать номенклатуру поставщика"
//                                                            или "Учитывать номенклатуру клиента" и т.п.
//   * ИмяЭлементаНоменклатураКонтрагента          - Строка - имя элемента табличной части с типом СправочникСсылка.НоменклатураКонтрагентов.
//   * ИмяРеквизитаОрганизация                     - Строка - имя реквизита организации в документе.
//   * ИмяРеквизитаКонтрагент                      - Строка - имя реквизита контрагент в документе.
//
Функция НовыеПараметрыПриСозданииФормыДокумента() Экспорт
	
	ПараметрыФормыДокумента = Новый Структура;
	ПараметрыФормыДокумента.Вставить("ВариантУказанияНоменклатурыПоУмолчанию"        );
	ПараметрыФормыДокумента.Вставить("ПредставлениеУчитыватьНоменклатуруВладельца"   , "");
	ПараметрыФормыДокумента.Вставить("ИмяЭлементаНоменклатураКонтрагента"            , "");
	ПараметрыФормыДокумента.Вставить("ИмяРеквизитаОрганизация"                       , "");
	ПараметрыФормыДокумента.Вставить("ИмяРеквизитаКонтрагент"                        , "");

	Возврат ПараметрыФормыДокумента;
	
КонецФункции

// Возвращает дополнительные параметры при записи номенклатуры контрагентов.
//
// Возвращаемое значение:
//  Структура - содержит параметры:
//   * ТребуетсяЗаписьВРегистр                - Булево - признак необходимости обновить запись в регистре сведений НоменклатураКонтрагентовБЭД.
//   * ТребуетсяПоискСсылки                   - Булево - признак необходимости выполнить поиск ссылки номенклатуры контрагента.
//   * ТребуетсяПоискЕдиницыИзмеренияПоОКЕИ   - Булево - признак необходимости выполнить поиск единицы измерения по ОКЕИ
//                                                       для заполнения данных контрагента, если единица измерения не была заполнена.
//   * ДанныеРегистраНоменклатурыКонтрагентов - Булево - данные номенклатуры контрагента заполнены из регистра сведений НоменклатураКонтрагентовБЭД.
//
Функция НовыеДополнительныеПараметрыПриЗаписиНоменклатурыКонтрагентов() Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТребуетсяЗаписьВРегистр"               , Истина);
	ДополнительныеПараметры.Вставить("ТребуетсяПоискСсылки"                  , Истина);
	ДополнительныеПараметры.Вставить("ТребуетсяПоискЕдиницыИзмеренияПоОКЕИ"  , Истина);
	ДополнительныеПараметры.Вставить("ДанныеРегистраНоменклатурыКонтрагентов", Ложь);
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийФормыСправочников

// Обрабатывает форму номенклатуры при ее создании.
// Если в параметрах формы присутствует данные о номенклатуре контрагента,
// то вызывает переопределяемый метод, инициализирующий данные формы.
// Следует вызвать в обработчике события ПриСозданииНаСервере формы элемента номенклатуры.
// См. также СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриЗаполненииФормыНоменклатурыПоДаннымКонтрагента.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма элемента номенклатуры.
//
Процедура ПриСозданииФормыНоменклатуры(Форма) Экспорт
	
	НоменклатураКонтрагента = СвойствоСтруктуры(Форма.Параметры,
		"ДополнительныеПараметры.СопоставлениеНоменклатурыКонтрагентов.НоменклатураКонтрагента");
	
	Если НоменклатураКонтрагента <> Неопределено Тогда
		
		СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриЗаполненииФормыНоменклатурыПоДаннымКонтрагента(
			НоменклатураКонтрагента, Форма);
		
	КонецЕсли;

КонецПроцедуры

// Обрабатывает форму характеристики при ее создании.
// Если в параметрах формы присутствует данные о номенклатуре контрагента,
// то вызывает переопределяемый метод, инициализирующий данные формы.
// Следует вызвать в обработчике события ПриСозданииНаСервере формы элемента характеристики.
// См. также СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриЗаполненииФормыХарактеристикиПоДаннымКонтрагента.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма элемента номенклатуры.
//
Процедура ПриСозданииФормыХарактеристики(Форма) Экспорт
	
	НоменклатураКонтрагента = СвойствоСтруктуры(Форма.Параметры,
		"ДополнительныеПараметры.СопоставлениеНоменклатурыКонтрагентов.НоменклатураКонтрагента");
	
	Если НоменклатураКонтрагента <> Неопределено Тогда
		
		СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриЗаполненииФормыХарактеристикиПоДаннымКонтрагента(
			НоменклатураКонтрагента, Форма);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормыДокументов

// Обработчик событий "ПриСозданииНаСервере" формы документа.
//
// Параметры:
//  ФормаДокумента          - ФормаКлиентскогоПриложения                               - форма документа.
//  ПараметрыФормыДокумента - Структура из см. НовыеПараметрыПриСозданииФормыДокумента - параметры при создании формы.
//
Процедура ПриСозданииФормыДокумента(ФормаДокумента, ПараметрыФормыДокумента) Экспорт
		
	ДобавитьРеквизитыФормы(ФормаДокумента);
		
	ЗаполнитьРеквизитыФормы(ФормаДокумента, ПараметрыФормыДокумента);
	
	УстановитьУсловноеОформлениеФормыДокумента(ФормаДокумента, ПараметрыФормыДокумента);
	
КонецПроцедуры

// Обработчик событий "ПриЗаписиНаСервере" формы документа.
//
// Параметры:
//  ФормаДокумента - ФормаКлиентскогоПриложения - форма документа.
//  Объект         - ДокументОбъект             - объект документа.
//  Отказ          - Булево                     - признак наличия ошибок при выполнении обработчика.
//
Процедура ПриЗаписиНаСервереФормыДокумента(Знач ФормаДокумента, Знач Объект, Отказ) Экспорт
	
	ПараметрыНоменклатурыКонтрагентаБЭД = ФормаДокумента.ПараметрыНоменклатурыКонтрагентаБЭД;
	
	Если Не ПараметрыНоменклатурыКонтрагентаБЭД.ИспользуетсяОбменEDI Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаДокумент = Объект.Ссылка;
	Организация      = Объект[ПараметрыНоменклатурыКонтрагентаБЭД.ИмяРеквизитаОрганизация];
	Контрагент       = Объект[ПараметрыНоменклатурыКонтрагентаБЭД.ИмяРеквизитаКонтрагент];

	РегистрыСведений.ВариантыУказанияНоменклатурыВДокументахБЭД.ЗаписатьНаборЗаписейВариантаУказанияНоменклатурыДокумента(
		СсылкаНаДокумент, Организация, Контрагент, ФормаДокумента.ВариантУказанияНоменклатурыБЭД, Отказ);
	
КонецПроцедуры
	
#КонецОбласти
	
#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПоискИУдалениеДублей

// См. ПоискИУдалениеДублейПереопределяемый.ПриОпределенииОбъектовСПоискомДублей
Процедура ПриОпределенииОбъектовСПоискомДублей(Объекты) Экспорт
	
	Объекты.Вставить(Метаданные.Справочники.НоменклатураКонтрагентов.ПолноеИмя(), "ПараметрыПоискаДублей
	|ПриПоискеДублей");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПоискИУдалениеДублей

#КонецОбласти	
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// См. ЭлектронноеВзаимодействие.ПриДобавленииОбработчиковОбновления.
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

#Область Версия_1_7_2

#Область РегистрыСведений_НоменклатураКонтрагентовБЭД_ОбработатьДанныеДляПереходаНаНовуюВерсию

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.7.2.29";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "РегистрыСведений.НоменклатураКонтрагентовБЭД.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("743a6c54-ff68-4f50-abc0-b9a52b40197a");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.НоменклатураКонтрагентовБЭД.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ОчередьОтложеннойОбработки = 2;
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.ЧитаемыеОбъекты = "РегистрСведений.НоменклатураКонтрагентовБЭД, Справочник.НоменклатураКонтрагентов";
	Обработчик.ИзменяемыеОбъекты = "РегистрСведений.НоменклатураКонтрагентовБЭД, Справочник.НоменклатураКонтрагентов";
	Обработчик.БлокируемыеОбъекты = "";
	Обработчик.Комментарий = НСтр("ru = 'Обновляются данные регистра номенклатура контрагентов.'");
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();

#КонецОбласти

#КонецОбласти

КонецПроцедуры

// См. ЭлектронноеВзаимодействие.ПриЗаполненииСписковСОграничениемДоступа
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа_НоменклатураКонтрагентов(Списки);
	
КонецПроцедуры

// См. ЭлектронноеВзаимодействие.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных_НоменклатураКонтрагентов(Описание);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СвойствоСтруктуры(Структура, Знач ИерархияСвойств, Знач ЗначениеПоУмолчанию = Неопределено)
	
	Если ТипЗнч(ИерархияСвойств) = Тип("Строка") Тогда
		ИерархияСвойств = СтрРазделить(ИерархияСвойств, ".");
	КонецЕсли;
	
	ТекущееСвойство = ИерархияСвойств[0];
	
	Если ИерархияСвойств.Количество() = 1 Тогда
		
		Если Структура.Свойство(ТекущееСвойство) Тогда
			Возврат Структура[ТекущееСвойство];
		Иначе
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли;
		
	Иначе
		
		ТекущееЗначение = Неопределено;
		Если Не Структура.Свойство(ТекущееСвойство, ТекущееЗначение) Тогда
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли;
		ИерархияСвойств.Удалить(0);
		Возврат СвойствоСтруктуры(ТекущееЗначение, ИерархияСвойств, ЗначениеПоУмолчанию);
		
	КонецЕсли;
	
КонецФункции

Функция СсылкаНоменклатурыКонтрагентаПоДаннымКонтрагента(Знач ДанныеКонтрагента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	НоменклатураКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|ГДЕ
		|	НоменклатураКонтрагентов.ВладелецНоменклатуры = &ВладелецНоменклатуры
		|	И НоменклатураКонтрагентов.Идентификатор = &Идентификатор
		|	И
		|	НЕ НоменклатураКонтрагентов.Недействителен
		|	И
		|	НЕ НоменклатураКонтрагентов.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	НоменклатураКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|ГДЕ
		|	НоменклатураКонтрагентов.НаименованиеНоменклатуры = &НаименованиеНоменклатуры
		|	И НоменклатураКонтрагентов.НаименованиеХарактеристики = &НаименованиеХарактеристики
		|	И НоменклатураКонтрагентов.НаименованиеУпаковки = &НаименованиеУпаковки
		|	И НоменклатураКонтрагентов.ВладелецНоменклатуры = &ВладелецНоменклатуры
		|	И НЕ НоменклатураКонтрагентов.Недействителен
		|	И НЕ НоменклатураКонтрагентов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВладелецНоменклатуры"      , ДанныеКонтрагента.Владелец);
	Запрос.УстановитьПараметр("Идентификатор"             , ДанныеКонтрагента.Идентификатор);
	Запрос.УстановитьПараметр("НаименованиеНоменклатуры"  , ДанныеКонтрагента.Наименование);
	Запрос.УстановитьПараметр("НаименованиеХарактеристики", ДанныеКонтрагента.Характеристика);
	Запрос.УстановитьПараметр("НаименованиеУпаковки"      , ДанныеКонтрагента.НаименованиеУпаковки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.НоменклатураКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьДругиеШтрихкодыНоменклатуры(Объект)
	
	Если Не ПустаяСтрока(Объект.ДругиеШтрихкодыНоменклатурыСтрокой) Тогда
		ДругиеШтрихкодыНоменклатурыТЧ = СтрСоединить(Объект.ДругиеШтрихкодыНоменклатуры.Выгрузить().ВыгрузитьКолонку("Штрихкод"), ",");
		Если Объект.ДругиеШтрихкодыНоменклатурыСтрокой <> ДругиеШтрихкодыНоменклатурыТЧ Тогда
			Объект.ДругиеШтрихкодыНоменклатуры.Очистить();
			НаборДругихШтрихкодов = СтрРазделить(Объект.ДругиеШтрихкодыНоменклатурыСтрокой, ",");
			Для Каждого Штрихкод Из НаборДругихШтрихкодов Цикл
				НоваяСтрока = Объект.ДругиеШтрихкодыНоменклатуры.Добавить();
				НоваяСтрока.Штрихкод = СокрЛП(Штрихкод);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияЕдиницИзмеренияУпаковок(Объект, ДанныеНоменклатурыКонтрагента,
	Знач ТребуетсяПоискЕдиницыИзмеренияПоОКЕИ, Знач ДанныеРегистраНоменклатурыКонтрагентов)
	
	Если ПустаяСтрока(ДанныеНоменклатурыКонтрагента.ИдентификаторУпаковки) Тогда
		Объект.НаименованиеУпаковки                = "";
		Объект.НаименованиеБазовойЕдиницыИзмерения = "";
		Объект.КодОКЕИБазовойЕдиницыИзмерения      = "";
		Возврат;
	КонецЕсли;
	
	НаименованиеУпаковки = ДанныеНоменклатурыКонтрагента.НаименованиеУпаковки;
	ЕдиницаИзмерения     = ДанныеНоменклатурыКонтрагента.ЕдиницаИзмерения;
	ЕдиницаИзмеренияКод  = ДанныеНоменклатурыКонтрагента.ЕдиницаИзмеренияКод;
	
	Если ПустаяСтрока(НаименованиеУпаковки) Тогда
		Объект.НаименованиеУпаковки = ЕдиницаИзмерения;
		Если Не ПустаяСтрока(ДанныеНоменклатурыКонтрагента.ЕдиницаИзмеренияКод) 
			И ТребуетсяПоискЕдиницыИзмеренияПоОКЕИ Тогда
			СопоставлениеНоменклатурыКонтрагентовПереопределяемый.НайтиНаименованиеЕдиницыИзмеренияПоКодуОКЕИ(
				ЕдиницаИзмеренияКод, ЕдиницаИзмерения);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ЕдиницаИзмерения) Тогда
		Объект.НаименованиеБазовойЕдиницыИзмерения = ЕдиницаИзмерения;
		Объект.КодОКЕИБазовойЕдиницыИзмерения      = ЕдиницаИзмеренияКод;
	Иначе
		ЕдиницаИзмеренияПоУмолчанию = СопоставлениеНоменклатурыКонтрагентовСлужебный.ЕдиницаИзмеренияПоУмолчанию();
		Объект.НаименованиеБазовойЕдиницыИзмерения = ЕдиницаИзмеренияПоУмолчанию.Наименование;
		Объект.КодОКЕИБазовойЕдиницыИзмерения      = ЕдиницаИзмеренияПоУмолчанию.КодОКЕИ;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.НаименованиеУпаковки) Тогда
		Объект.НаименованиеУпаковки = Объект.НаименованиеБазовойЕдиницыИзмерения;
	КонецЕсли;
	
	Если Не ДанныеРегистраНоменклатурыКонтрагентов Тогда
		Объект.КоличествоБазовойЕдиницыИзмерения = ДанныеНоменклатурыКонтрагента.КоличествоБазовойЕдиницыИзмерения;
		Объект.КоличествоУпаковок = ДанныеНоменклатурыКонтрагента.КоличествоУпаковок;
	КонецЕсли;
	
	Если Объект.КоличествоБазовойЕдиницыИзмерения = 0
			И Объект.КоличествоУпаковок = 0 Тогда
				
		Объект.КоличествоБазовойЕдиницыИзмерения = 1;
		Объект.КоличествоУпаковок = 1;
			
	КонецЕсли;
	
	ДанныеНоменклатурыКонтрагента.НаименованиеУпаковки = Объект.НаименованиеУпаковки;
	ДанныеНоменклатурыКонтрагента.ЕдиницаИзмерения     = Объект.НаименованиеБазовойЕдиницыИзмерения;
	ДанныеНоменклатурыКонтрагента.ЕдиницаИзмеренияКод  = Объект.КодОКЕИБазовойЕдиницыИзмерения;

КонецПроцедуры

Процедура УстановитьУсловноеОформлениеФормыДокумента(ФормаДокумента, ПараметрыФормыДокумента)
	
	Элемент = ФормаДокумента.УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ПараметрыФормыДокумента.ИмяЭлементаНоменклатураКонтрагента);
	
	ОтборГруппа = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ОтборГруппа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ОтборЭлемента = ОтборГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВариантУказанияНоменклатурыБЭД");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.ВариантУказанияНоменклатураОрганизации();
	
	ОтборЭлемента = ОтборГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВариантУказанияНоменклатурыБЭД");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыУказанияНоменклатурыБЭД.ПустаяСсылка();
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

Процедура ДобавитьРеквизитыФормы(ФормаДокумента)
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПараметрыНоменклатурыКонтрагентаБЭД", Новый ОписаниеТипов));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ВариантУказанияНоменклатурыБЭД",
		Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыУказанияНоменклатурыБЭД")));
	
	ФормаДокумента.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыФормы(ФормаДокумента, ПараметрыНоменклатурыКонтрагентаБЭД)
	
	Объект         = ФормаДокумента.Объект;
	ДокументСсылка = Объект.Ссылка;

	ДополнитьПараметрыНоменклатурыКонтрагентаБЭД(ПараметрыНоменклатурыКонтрагентаБЭД);
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		
		ВариантУказанияНоменклатурыВДокументе = 
			РегистрыСведений.ВариантыУказанияНоменклатурыВДокументахБЭД.ВариантУказанияНоменклатурыВДокументе(ДокументСсылка);
			
		Если ВариантУказанияНоменклатурыВДокументе <> Неопределено Тогда
			ФормаДокумента.ВариантУказанияНоменклатурыБЭД                             = ВариантУказанияНоменклатурыВДокументе;
			ПараметрыНоменклатурыКонтрагентаБЭД.ВариантУказанияНоменклатурыВДокументе = ВариантУказанияНоменклатурыВДокументе;
		Иначе
			ВариантУказанияНоменклатурыПоУмолчанию = ПараметрыНоменклатурыКонтрагентаБЭД.ВариантУказанияНоменклатурыПоУмолчанию;
			ФормаДокумента.ВариантУказанияНоменклатурыБЭД = ВариантУказанияНоменклатурыПоУмолчанию;
		КонецЕсли;
		
	Иначе
		
		Контрагент  = Объект[ПараметрыНоменклатурыКонтрагентаБЭД.ИмяРеквизитаКонтрагент];
		Организация = Объект[ПараметрыНоменклатурыКонтрагентаБЭД.ИмяРеквизитаОрганизация];
		
		ПоследняяНастройкаВариантаУказанияНоменклатуры = 
			РегистрыСведений.ВариантыУказанияНоменклатурыВДокументахБЭД.ПоследняяНастройкаВариантаУказанияНоменклатуры(ДокументСсылка,
																														Контрагент,
																														Организация);
		Если ЗначениеЗаполнено(ПоследняяНастройкаВариантаУказанияНоменклатуры) Тогда
			ПараметрыНоменклатурыКонтрагентаБЭД.ПоследняяНастройкаВариантаУказанияНоменклатуры = ПоследняяНастройкаВариантаУказанияНоменклатуры;
			ФормаДокумента.ВариантУказанияНоменклатурыБЭД = ПоследняяНастройкаВариантаУказанияНоменклатуры;
		Иначе
			ФормаДокумента.ВариантУказанияНоменклатурыБЭД = ПараметрыНоменклатурыКонтрагентаБЭД.ВариантУказанияНоменклатурыПоУмолчанию;
		КонецЕсли;
		
	КонецЕсли;
		
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.СервисEDI") Тогда
		МодульДокументыEDIИнтеграция = ОбщегоНазначения.ОбщийМодуль("ДокументыEDIИнтеграция");
		ПараметрыНоменклатурыКонтрагентаБЭД.ИспользуетсяОбменEDI = МодульДокументыEDIИнтеграция.ЕстьПравоИспользованияEDI();
	КонецЕсли;

	ФормаДокумента.ПараметрыНоменклатурыКонтрагентаБЭД = ПараметрыНоменклатурыКонтрагентаБЭД;
	
КонецПроцедуры

Процедура ДополнитьПараметрыНоменклатурыКонтрагентаБЭД(ПараметрыНоменклатурыКонтрагентаБЭД)
	
	ПараметрыНоменклатурыКонтрагентаБЭД.Вставить("ИмяКомандыУчитыватьВладельцаНоменклатуры"      );
	ПараметрыНоменклатурыКонтрагентаБЭД.Вставить("ПоследняяНастройкаВариантаУказанияНоменклатуры");
	ПараметрыНоменклатурыКонтрагентаБЭД.Вставить("ВариантУказанияНоменклатурыВДокументе"         );
	ПараметрыНоменклатурыКонтрагентаБЭД.Вставить("ВариантУказанияНоменклатурыВОбменеEDI"         );
	ПараметрыНоменклатурыКонтрагентаБЭД.Вставить("ИспользуетсяОбменEDI"                          , Ложь);
	ПараметрыНоменклатурыКонтрагентаБЭД.Вставить("ДокументИспользуетсяВОбменеEDI"                , Ложь);
	ПараметрыНоменклатурыКонтрагентаБЭД.Вставить("ЗначениеНастройкиКонтрагентаEDI"               , Ложь);

КонецПроцедуры

#КонецОбласти

