#Область СлужебныйПрограммныйИнтерфейс

// Заполняет поля данных штрихкода, используемые подсистемой МОТП, после уточнения данных:
//  * Выбор вида и типа упаковки (пачка/блок), если ранее он не распознан, по коэффициенту вложенности (количеству пачек)
//  * По виду упаковки и коэффициенту указание количества пачек и блоков.
//
// Параметры:
//  ДанныеШтрихкода - Структура - текущие данные штрихкода
//  ДанныеВыбора    - Структура - данные уточнения номенклатуры
//
Процедура ОбработатьУточнениеДанных(ДанныеШтрихкода, ДанныеВыбора) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеШтрихкода.ВидУпаковки) Тогда
		Если ДанныеВыбора.Коэффициент > 1 Тогда
			ДанныеШтрихкода.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая;
			ДанныеШтрихкода.ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
			
			ДанныеШтрихкода.КоличествоПачек  = ДанныеВыбора.Коэффициент;
			ДанныеШтрихкода.КоличествоБлоков = 1;
		Иначе
			ДанныеШтрихкода.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская;
			ДанныеШтрихкода.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар;
			
			ДанныеШтрихкода.КоличествоПачек  = 1;
			ДанныеШтрихкода.КоличествоБлоков = 0;
		КонецЕсли;
	ИначеЕсли Не ЗначениеЗаполнено(ДанныеШтрихкода.КоличествоПачек) Тогда
		Если ДанныеШтрихкода.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
			ДанныеШтрихкода.КоличествоПачек  = 1;
			ДанныеШтрихкода.КоличествоБлоков = 0;
		Иначе
			ДанныеШтрихкода.КоличествоПачек  = ДанныеВыбора.Коэффициент;
			ДанныеШтрихкода.КоличествоБлоков = 1;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Формирует структуру вложенных штрихкодов по ссылке на документ.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - Ссылка на документ.
//  Детализация - ПеречислениеСсылка.ДетализацияСтруктурыХраненияИС - Детализация, с которой
//                           требуется сформировать вложенные штрихкоды.
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
// Возвращаемое значение:
//  (См. ИнициализацияВложенныхШтрихкодов).
Функция ВложенныеШтрихкодыУпаковокПоДокументу(ДокументСсылка, Детализация, ПараметрыСканирования) Экспорт
	
	Если ПараметрыСканирования = Неопределено Тогда
		ДанныеШапки           = ШтрихкодированиеИС.ПолучитьСтруктуруРеквизитовДокумента(ДокументСсылка);
		ПараметрыСканирования = ШтрихкодированиеИС.ПараметрыСканирования(ДанныеШапки);
	КонецЕсли;
	
	ШтрихкодыУпаковок = ШтрихкодыУпаковокИзДокумента(ДокументСсылка, ПараметрыСканирования);
	
	ИзвестныеУпаковки   = Новый Массив;
	НеизвестныеУпаковки = Новый Массив;
	
	Для Каждого Строка Из ШтрихкодыУпаковок Цикл
		
		Если ЗначениеЗаполнено(Строка.ШтрихкодУпаковки) Тогда
			ИзвестныеУпаковки.Добавить(Строка.ШтрихкодУпаковки);
		Иначе
			НеизвестныеУпаковки.Добавить(Новый Структура("Штрихкод, Количество", Строка.Штрихкод, 1));
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеПоШтрихкодам = ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам();
	Если ИзвестныеУпаковки.Количество() > 0 Тогда
		
		ВложенныеШтрихкодыИзвестныхУпаковок = ШтрихкодированиеИС.ВложенныеШтрихкодыИзвестныхУпаковок(
			ИзвестныеУпаковки, ПараметрыСканирования);
		
		ПривестиВложенныеШтрихкодыКТребуемомуВидуДетализации(ВложенныеШтрихкодыИзвестныхУпаковок, ПараметрыСканирования);
		
		ДанныеПоШтрихкодам.ВложенныеШтрихкоды = ВложенныеШтрихкодыИзвестныхУпаковок;
		
		ДобавленныеСтроки = Новый Массив;
		ШтрихкодированиеИС.ДополнитьТаблицуДанныеКодовМаркировкиПоСтрокамДереваУпаковок(
			ДанныеПоШтрихкодам.ДанныеКодовМаркировки, ВложенныеШтрихкодыИзвестныхУпаковок.ДеревоУпаковок, ДобавленныеСтроки, ПараметрыСканирования);
		
		ШтрихкодированиеИС.ЗаполнитьКоэффициентыВложенностиУпаковокПоШтрихкодамEAN(ДобавленныеСтроки, ПараметрыСканирования);
		
		ДополнитьДанныеПоШтрихкодамСпецификой(ДанныеПоШтрихкодам, ПараметрыСканирования);
		
		Результат = ИнициализацияРезультатаПолученияВложенныхШтрихкодовПоДаннымМОТП();
		
		Если ДанныеПоШтрихкодам.ЕстьОшибки Тогда
			Результат.ЕстьОшибки  = Истина;
			Результат.ТекстОшибки = ДанныеПоШтрихкодам.ТекстОшибки;
			Результат.ТребуетсяОбновлениеКлючаСессии = ДанныеПоШтрихкодам.ТребуетсяОбновлениеКлючаСессии;
		Иначе
			Результат.ВложенныеШтрихкоды = ВложенныеШтрихкодыИзвестныхУпаковок;
		КонецЕсли;
		
		Возврат Результат;
		
	КонецЕсли;
	
	Если НеизвестныеУпаковки.Количество() > 0 Тогда
		
		Возврат ВложенныеШтрихкодыПоДаннымМОТП(НеизвестныеУпаковки, ПараметрыСканирования);
		
	КонецЕсли;
	
	ПустаяКоллекция = ИнициализацияВложенныхШтрихкодов();
	Результат       = ИнициализацияРезультатаПолученияВложенныхШтрихкодовПоДаннымМОТП();
	Результат.ВложенныеШтрихкоды = ПустаяКоллекция;
	
	Возврат Результат;
	
КонецФункции

Функция ШтрихкодыУпаковокИзДокумента(Знач ДокументСсылка, Знач ПараметрыСканирования) Экспорт
	
	ИмяТабличнойЧасти = ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок;
	ИмяКолонки        = ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки;
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	ЕстьКолонкаЗначениеШтрихкода = МетаданныеДокумента.ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты.Найти("ЗначениеШтрихкода") <> Неопределено;
	ИмяДокумента = МетаданныеДокумента.Имя;
	
	Если ЕстьКолонкаЗначениеШтрихкода Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Штрихкоды.%3                КАК ШтрихкодУпаковки,
		|	Штрихкоды.ЗначениеШтрихкода КАК Штрихкод
		|ИЗ
		|	Документ.%1.%2 КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Ссылка = &ДокументСсылка";
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Штрихкоды.%3                                   КАК ШтрихкодУпаковки,
		|	ЕСТЬNULL(Штрихкоды.%3.ЗначениеШтрихкода, """") КАК Штрихкод
		|ИЗ
		|	Документ.%1.%2 КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Ссылка = &ДокументСсылка";
	КонецЕсли;
	ТекстЗапроса = СтрШаблон(ТекстЗапроса, ИмяДокумента, ИмяТабличнойЧасти, ИмяКолонки);
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	ШтрихкодыУпаковок = Запрос.Выполнить().Выгрузить();
	Возврат ШтрихкодыУпаковок;

КонецФункции

// Формирует данные по неизвестным кодам табачных пачек и заполняет данные по штрихкодам.
// 
// Параметры:
//  ДанныеПоШтрихкодам - (См. ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам).
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
Процедура ЗаполнитьДанныеНеизвестнойМаркируемойПродукции(ДанныеПоШтрихкодам, ПараметрыСканирования) Экспорт
	
	ДобавитьКолонкиТаблицыДанныеКодовМаркировки(
		ДанныеПоШтрихкодам.ДанныеКодовМаркировки, ПараметрыСканирования);
		
	Если ПараметрыСканирования.ЗапрашиватьСтатусыИСМП Тогда
		ЗаполнитьДанныеНеизвестныхТабачныхПачекСЗапросомСведенийМОТП(ДанныеПоШтрихкодам, ПараметрыСканирования);
	Иначе
		ЗаполнитьДанныеНеизвестныхТабачныхПачекБезЗапросаСведенийМОТП(ДанныеПоШтрихкодам, ПараметрыСканирования);
	КонецЕсли;
	
	ОбработкаДанныхПоШтрихкодамУчетМРЦ(ДанныеПоШтрихкодам, ПараметрыСканирования);
	
КонецПроцедуры

// Дополняет базовую таблицу "ДанныеКодовМаркировки" необходимыми колонками для табачной продукции.
// 
// Параметры:
//  ДанныеКодовМаркировки - ТаблицаЗначений - (См. ШтрихкодированиеИС.ИнициализацияТаблицыДанныхКодовМаркировки):
//   * Владелец - ОпределяемыйТип.Организация - Владелец кода маркировки.
//   * ИННВладельца - Строка - ИНН владельца кода маркировки.
//   * Статус - ПеречислениеСсылка.СтатусыКодовМаркировкиМОТП - Текущий статус кода маркировки.
//   * ПредставлениеСтатуса - Строка - Представление текущего статуса кода маркировки.
//   * КоличествоПачек - Число - Количество пачек.
//   * КоличествоБлоков - Число - Количество блоков.
//   * МРЦ - Число - Максимальная розничная цена.
//   * ТребуетсяВыборСерии - Булево - Истина, если требуется указать серию
//  ПараметрыСканирования - См. ШтрихкодированиеИС.ПараметрыСканирования
Процедура ДобавитьКолонкиТаблицыДанныеКодовМаркировки(ДанныеКодовМаркировки, ПараметрыСканирования = Неопределено) Экспорт
	
	ОбязательныеКолонки = Новый Структура;
	ОбязательныеКолонки.Вставить("Владелец",                  Неопределено);
	ОбязательныеКолонки.Вставить("ПредставлениеСтатуса",      Новый ОписаниеТипов("Строка"));
	ОбязательныеКолонки.Вставить("GTIN",                      Новый ОписаниеТипов("Строка"));
	ОбязательныеКолонки.Вставить("ТребуетсяВыборСерии",       Новый ОписаниеТипов("Булево"));
	ОбязательныеКолонки.Вставить("ЕстьВПулеКодовМаркировки",  Новый ОписаниеТипов("Булево"));
	
	Если ПараметрыСканирования <> Неопределено Тогда
		
		ПараметрыДерева = ИнтерфейсМОТП.ПараметрыПостроенияДерева(ПараметрыСканирования);
		КоллекцияДополнительныхКолонокДереваУпаковокМОТП(ПараметрыДерева, ОбязательныеКолонки);
		Если ПараметрыСканирования.ЭтоПроверкаКодовМаркировкиИСМП Тогда
			КоллекцияДополнительныхКолонокДереваУпаковокДляФормыПроверкиКодовМаркировки(ОбязательныеКолонки);
		КонецЕсли;
		
	КонецЕсли;
	
	НормализироватьДанныеДереваУпаковокПоПереданнымКолонкам(ДанныеКодовМаркировки, ОбязательныеКолонки);
	
КонецПроцедуры

// Выполняет обработку выбора пользователем уточняющей информации.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма, для которой требуется обработка штрихкодов.
//  ИмяЭлементаВыбора - Строка - Идентификатор операции.
//  РезультатВыбора - Структура - Результат выбора данных пользователем.
//  РезультатОбработкиШтрихкода - (См. ШтрихкодированиеИС.ИнициализироватьРезультатОбработкиШтрихкода).
//  КэшированныеЗначения - Структура - закэшированные данные формы.
// Возвращаемое значение:
//  (См. ШтрихкодированиеИС.ИнициализироватьРезультатОбработкиШтрихкода).
Функция ОбработатьВыбор(Форма, ИмяЭлементаВыбора, РезультатВыбора, РезультатОбработкиШтрихкода, КэшированныеЗначения) Экспорт

	Если ИмяЭлементаВыбора = "Номенклатура" Тогда
		РезультатДобавления = ОбработатьВыборНоменклатуры(Форма, РезультатВыбора, РезультатОбработкиШтрихкода, КэшированныеЗначения);
	КонецЕсли;

	Возврат РезультатДобавления;

КонецФункции

// Выполняет поиск ошибок в данных по штрихкодам.
//
// Параметры:
//  ДанныеПоШтрихкодам - (См. ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам).
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
//  ЕстьОшибки - Булево - Истина, если выявлена ошибка.
Процедура ВыполнитьПроверкуНаОшибки(ДанныеПоШтрихкодам, ПараметрыСканирования, ЕстьОшибки) Экспорт
	
	ПравилаПроверкиНаОшибки = ПравилаПроверкиНаОшибки(ПараметрыСканирования, ДанныеПоШтрихкодам);
	ПроверитьНаОшибкиПоПравилам(ДанныеПоШтрихкодам, ПравилаПроверкиНаОшибки, ПараметрыСканирования, ЕстьОшибки);
	
КонецПроцедуры

// Приводит дерево упаковок и таблицу маркированные товары к детализации, которая указана в параметрах сканирования.
//
// Параметры:
//  ВложенныеШтрихкоды - Структура - Включает в себя таблицу значений "Маркированные товары" и "Дерево упаковок".
//  ПараметрыСканирования - См. ШтрихкодированиеИСКлиент.ПараметрыСканирования.
//  ДанныеКодовМаркировки - Неопределено, ТаблицаЗначений - связанные данные кодов маркировки.
Процедура ПривестиВложенныеШтрихкодыКТребуемомуВидуДетализации(ВложенныеШтрихкоды, ПараметрыСканирования, ДанныеКодовМаркировки = Неопределено) Экспорт
	
	Детализация = ПараметрыСканирования.ДетализацияСтруктурыХранения;
	
	// Полная детализация требуется для того, что бы в ДанныхКодовМаркировки можно
	// было найти информацию о вложенных единицах. В противном случае разрывается связь
	// между кодами из сервиса и считанными штрихкодами.
	Если Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки
		Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими Тогда
		Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.Полная;
	КонецЕсли;
	
	Если Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.Полная
		Или Не ЗначениеЗаполнено(Детализация) Тогда
		Возврат;
	КонецЕсли;
	
	ДеревоУпаковок       = ВложенныеШтрихкоды.ДеревоУпаковок;
	МаркированныеТовары  = ВложенныеШтрихкоды.МаркированныеТовары;
	МассивУдаляемыхСтрок = Новый Массив;

	Для Каждого СтрокаДерева Из ДеревоУпаковок.Строки Цикл
		
		Если Не (ИнтеграцияИСПовтИсп.ЭтоПродукцияМОТП(СтрокаДерева.ВидПродукции)
			Или СтрокаДерева.ВидПродукции = Перечисления.ВидыПродукцииИС.ПустаяСсылка()) Тогда
			Продолжить;
		КонецЕсли;
		
		Если
			// Если детализация полная - любые упаковки добавляются в дерево упаковок.
			(Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.Полная
				Или Не ЗначениеЗаполнено(Детализация))
			
			// Если детализация - палеты с коробками, то все верхнеуровневые упаковки добавляются в дерево упаковок.
			Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами
			
			// Если детализация - коробки с блоками, то все верхнеуровневые упаковки добавляются в дерево упаковок.
			Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками
			
			// Если детализация - блоки с пачками или блоки, то верхнеуровневые упаковки добавляются в дерево
			// упаковок только в случае если они являются блоками или пачками.
			Или ((Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими
					Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковки
					Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки)
				И СтрокаДерева.ВидУпаковки <> Перечисления.ВидыУпаковокИС.Логистическая) Тогда
				
				Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая
					И (Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками
						Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами
						Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковки) Тогда
					
					Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл
						УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(ВложеннаяСтрокаДерева, МаркированныеТовары);
						УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(ВложеннаяСтрокаДерева, ДанныеКодовМаркировки);
					КонецЦикла;
					
					СтрокаДерева.Строки.Очистить();
					Продолжить;
					
				КонецЕсли;
				
				Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
					И Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами Тогда
					
					GTIN = СтрокаДерева.GTIN;
					
					Если ЗначениеЗаполнено(GTIN) Тогда
						
						Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл
							УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(ВложеннаяСтрокаДерева, МаркированныеТовары);
							УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(ВложеннаяСтрокаДерева, ДанныеКодовМаркировки);
						КонецЦикла;
						
						СтрокаДерева.Строки.Очистить();
						Продолжить;

					КонецЕсли;
					
				КонецЕсли;

		Иначе
			
			МассивУдаляемыхСтрок.Добавить(СтрокаДерева);
			
		КонецЕсли;
		
		ОпределитьУдаляемыеСтрокиДереваПоДетализации(
			СтрокаДерева.Строки, Детализация, МассивУдаляемыхСтрок, МаркированныеТовары, ДанныеКодовМаркировки);
		
	КонецЦикла;
	
	Если МассивУдаляемыхСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьСтрокиДереваУпаковокПоДетализации(
		ДеревоУпаковок,
		МассивУдаляемыхСтрок,
		МаркированныеТовары,
		ДанныеКодовМаркировки);
	
	ВложенныеШтрихкоды.МаркированныеТовары = МаркированныеТовары;
	ВложенныеШтрихкоды.ДеревоУпаковок      = ДеревоУпаковок;
	
КонецПроцедуры

// Дополнение полученных данных штрихкодов данными, которые актуальны для табачной продукции.
// 
// Параметры:
//  ДанныеПоШтрихкодам - (См. ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам).
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
Процедура ДополнитьДанныеПоШтрихкодамСпецификой(ДанныеПоШтрихкодам, ПараметрыСканирования) Экспорт
	
	Если ДанныеПоШтрихкодам.ВложенныеШтрихкоды <> Неопределено Тогда
		
		ДеревоУпаковок = ДанныеПоШтрихкодам.ВложенныеШтрихкоды.ДеревоУпаковок;
		НормализоватьДанныеДереваУпаковок(ДеревоУпаковок, ПараметрыСканирования, ДанныеПоШтрихкодам.ДанныеКодовМаркировки);
		
		// Если сканирование выполняется в форме проверки и подбора, то заполнение таблицы маркированных товаров не требуется
		Если Не ПараметрыСканирования.ИспользуетсяСоответствиеШтрихкодовСтрокДерева Тогда
			МаркированныеТовары = ДанныеПоШтрихкодам.ВложенныеШтрихкоды.МаркированныеТовары;
			НормализоватьСвойстваКоллекцииВложенныхШтрихкодов(МаркированныеТовары);
			
			ПривестиДанныеМаркированныхТоваровВСоответствиеДеревуУпаковок(МаркированныеТовары);
			ДополнитьМаркированныеТоварыБлокамиПоСтрокамДерева(ДеревоУпаковок.Строки, МаркированныеТовары);
		КонецЕсли;
		
	КонецЕсли;
	
	ДобавитьКолонкиТаблицыДанныеКодовМаркировки(ДанныеПоШтрихкодам.ДанныеКодовМаркировки, ПараметрыСканирования);
	
	Если ПараметрыСканирования.ЗапрашиватьСтатусыИСМП Тогда
		ДополнитьДанныеПоШтрихкодамСпецификойСЗапросомСтатусовМОТП(ДанныеПоШтрихкодам, ПараметрыСканирования);
		Если ДанныеПоШтрихкодам.ВложенныеШтрихкоды <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ДанныеПоШтрихкодам.ВложенныеШтрихкоды, ДанныеПоШтрихкодам, "ТекстОшибки, ЕстьОшибки, ТребуетсяОбновлениеКлючаСессии");
		КонецЕсли;
	Иначе
		ДополнитьДанныеПоШтрихкодамСпецификойБезЗапросаСтатусовМОТП(ДанныеПоШтрихкодам, ПараметрыСканирования);
	КонецЕсли;
	
	ШтрихкодированиеИСМПСлужебный.ЗаполнитьПредставлениеНоменклатурыОстаточныхШтрихкодов(
		ДанныеПоШтрихкодам.ДанныеКодовМаркировки, ПараметрыСканирования);

	Если ДанныеПоШтрихкодам.Свойство("ВложенныеШтрихкоды")
		И ДанныеПоШтрихкодам.ВложенныеШтрихкоды <> Неопределено Тогда
		
		НормализоватьДанныеВложенныхШтрихкодов(
			ДанныеПоШтрихкодам.ВложенныеШтрихкоды,
			ПараметрыСканирования,
			ДанныеПоШтрихкодам.ДанныеКодовМаркировки);
		
	КонецЕсли;
	
	ДополнитьДанныеПоШтрихкодамДаннымиПулаКодовМаркировки(ДанныеПоШтрихкодам, ПараметрыСканирования);
	
	// Заполнение количества пачек по коэффициентам упаковок и коэффициентам из таблицы Описание GTIN
	СтрокиДляЗаполнения = Новый Массив;
	Для Каждого СтрокаДанных Из ДанныеПоШтрихкодам.ДанныеКодовМаркировки Цикл
		Если ЗначениеЗаполнено(СтрокаДанных.ШтрихкодУпаковки) Тогда
			СтрокиДляЗаполнения.Добавить(СтрокаДанных);
		КонецЕсли;
	КонецЦикла;
	Если ПараметрыСканирования.ЗапрашиватьСтатусыИСМП Тогда
		// Заполнить только коэффициенты упаковок, если не заполнены ранее
		ШтрихкодированиеИСМПСлужебный.ЗаполнитьСтрокиТаблицыДанныхПоГрупповымУпаковкам(СтрокиДляЗаполнения, Ложь);
	Иначе
		// Заполнить коэффициенты упаковок и количество вложенных пачек
		ШтрихкодированиеИСМПСлужебный.ЗаполнитьСтрокиТаблицыДанныхПоГрупповымУпаковкам(СтрокиДляЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет представления статусов, владельцев и прочую дополнительную информацию
//
// Параметры:
//  ДанныеПоШтрихкодам - (См. ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам).
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
Процедура ЗаполнитьПредставленияДанных(ДанныеПоШтрихкодам, ПараметрыСканирования) Экспорт
	
	МассивИНН = ДанныеПоШтрихкодам.ДанныеКодовМаркировки.ВыгрузитьКолонку("ИННВладельца");
	МассивИНН = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивИНН);
	Если МассивИНН.Количество() > 0 Тогда
		
		КонтрагентыПоИНН = ИнтеграцияИСМП.КонтрагентыПоСпискуИНН(МассивИНН);
		ОрганизацииПоИНН = ИнтеграцияИСМП.ОрганизацииПоСпискуИНН(МассивИНН);
		Для Каждого СтрокаДанных Из ДанныеПоШтрихкодам.ДанныеКодовМаркировки Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаДанных.Владелец)
				И ЗначениеЗаполнено(СтрокаДанных.ИННВладельца) Тогда
				СтрокаДанных.Владелец = КонтрагентыПоИНН.Получить(СтрокаДанных.ИННВладельца);
				Если Не ЗначениеЗаполнено(СтрокаДанных.Владелец) Тогда
					СтрокаДанных.Владелец = ОрганизацииПоИНН.Получить(СтрокаДанных.ИННВладельца);
				КонецЕсли;
				Если СтрокаДанных.СтрокаДерева <> Неопределено Тогда
					СтрокаДанных.СтрокаДерева.Владелец = СтрокаДанных.Владелец;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет проверки перед формированием данных по штрихкодам. 
// 
// Параметры:
//  ДанныеКодовМаркировки - (См. ШтрихкодированиеИС.ИнициализацияТаблицыДанныхКодовМаркировки).
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
// Возвращаемое значение:
//  Соответствие - В случае удачного прохождения проверок - возвращает пустое соответствие,
//    В случае выявления ошибок или необходимого уточнения информации - возвращает заполненное соответствие с указанием причины.
Функция ВыполнитьПроверкиПередПолучениемДанныхПоШтрихкодам(ДанныеКодовМаркировки, ПараметрыСканирования) Экспорт
	
	РезультатыПроверок = Новый Соответствие;
	
	ТребуетсяАвторизацияИСМП = ШтрихкодированиеИСМПСлужебный.ТребуетсяАвторизацияПользователя(ПараметрыСканирования);
	
	Если Не ТребуетсяАвторизацияИСМП Тогда
		Возврат РезультатыПроверок;
	КонецЕсли;
	
	ВидПродукцииТабак               = Перечисления.ВидыПродукцииИС.Табак;
	ВидПродукцииАльтернативныйТабак = Перечисления.ВидыПродукцииИС.АльтернативныйТабак;
	
	Для Каждого СтрокаДанных Из ДанныеКодовМаркировки Цикл
		
		// Например, в заказе на Эмиссию можно сканировать EAN и сканирование КМ не требуется
		Если Не ПараметрыСканирования.РазрешеноЗапрашиватьКодМаркировки
			И СтрокаДанных.ЭтоШтрихкодНоменклатуры Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанных.ВидПродукции)
			И Не ИнтеграцияИСПовтИсп.ЭтоПродукцияМОТП(СтрокаДанных.ВидПродукции) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанных.ВидПродукции)
			Или СтрокаДанных.ВидыПродукцииКодаМаркировки.Количество() = 1 // Проверка на упаковку с 1 видом продукции.
			Или СтрокаДанных.ПрисутствуетТабачнаяПродукция // Неопределено: АТП или классический табак
			Тогда
			
			ВидыПродукцииПоКоду = Новый Массив;
			Если СтрокаДанных.ВидыПродукцииКодаМаркировки.Найти(ВидПродукцииТабак) <> Неопределено Тогда
				ВидыПродукцииПоКоду.Добавить(ВидПродукцииТабак);
			КонецЕсли;
			Если СтрокаДанных.ВидыПродукцииКодаМаркировки.Найти(ВидПродукцииАльтернативныйТабак) <> Неопределено Тогда
				ВидыПродукцииПоКоду.Добавить(ВидПродукцииАльтернативныйТабак);
			КонецЕсли;
			Если ВидыПродукцииПоКоду.Количество() > 0 Тогда
				РезультатОбработкиШтрихкода = ШтрихкодированиеИС.ИнициализироватьРезультатОбработкиШтрихкода(ПараметрыСканирования);
				РезультатОбработкиШтрихкода.ВидыПродукции.Очистить();
				Для Каждого ВидПродукции Из ВидыПродукцииПоКоду Цикл
					РезультатОбработкиШтрихкода.ВидыПродукции.Добавить(ВидПродукции);
				КонецЦикла;
				РезультатОбработкиШтрихкода.ТребуетсяАвторизацияИСМП = Истина;
				
				СтрокаДанных.ОбработанСОшибками = Истина;
				РезультатыПроверок.Вставить(СтрокаДанных.Штрихкод, РезультатОбработкиШтрихкода);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатыПроверок;
	
КонецФункции

// Формирует структуру, описывающую результат обработки кода маркировки.
//
// Параметры:
//  ДанныеШтрихкода - (См. ШтрихкодированиеИС.ИнициализироватьДанныеШтрихкода)
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
//  УникальныйИдентификатор - УникальныйИдентификатор - Уникальный идентификатор формы, во временное хранилище которой
//  надо поместить данные.
//  Форма - ФормаКлиентскогоПриложения - Форма, для которой выполняется обработка штрихкода.
// Возвращаемое значение:
//  Структура - содержит в себе информацию по результату обработки штрихкодов табачной продукции.
Функция РезультатОбработкиКодаМаркировки(ДанныеШтрихкода, ПараметрыСканирования, УникальныйИдентификатор, Форма = Неопределено) Экспорт
	
	РезультатОбработки = ШтрихкодированиеИСМПСлужебный.ИнициализироватьРезультатОбработкиШтрихкода(ДанныеШтрихкода);
	РезультатОбработки.ДанныеШтрихкода = ДанныеШтрихкода;
	ЗаполнитьЗначенияСвойств(РезультатОбработки, ДанныеШтрихкода);
	
	Если ДанныеШтрихкода.ТребуетсяВыборСерии Тогда
		
		РезультатОбработки.ТребуетсяУточнениеДанных = Истина;
		
	КонецЕсли;
	
	Если Не РезультатОбработки.ТребуетсяУточнениеДанных И Форма <> Неопределено Тогда
		
		РезультатОбработки = ШтрихкодированиеИС.ОбработатьДанныеШтрихкода(Форма, ДанныеШтрихкода, ПараметрыСканирования);
		
	Иначе
		
		СохранениеКодаМаркировкиВПул(РезультатОбработки, ДанныеШтрихкода, ПараметрыСканирования);
		
	КонецЕсли;
	
	Возврат РезультатОбработки;
	
КонецФункции

// Сохраняет код маркировкив ПулКодовМаркировкиСУЗ с проверкой необходимости.
// 
// Параметры:
// 	РезультатОбработки    - Структура - результа обработки штрихкода.
// 	ДанныеШтрихкода       - (См. ШтрихкодированиеИС.ИнициализироватьДанныеШтрихкода).
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
Процедура СохранениеКодаМаркировкиВПул(РезультатОбработки, ДанныеШтрихкода, ПараметрыСканирования) Экспорт
	
	Если Не ПараметрыСканирования.СохранятьКодыМаркировкиВПулИСМП
		Или Не ШтрихкодированиеИС.ОбработкаДанныхПоШтрихкодамУспешноЗавершена(РезультатОбработки)
		Или ДанныеШтрихкода.ЕстьВПулеКодовМаркировки Тогда
		Возврат;
	КонецЕсли;
	
	Если (ДанныеШтрихкода.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская
		Или ДанныеШтрихкода.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая)
		И ДанныеШтрихкода.ДанныеРазбора <> Неопределено
		И (ДанныеШтрихкода.ДанныеРазбора.СоставКодаМаркировки.ВключаетМРЦ
		Или ДанныеШтрихкода.ДанныеРазбора.СоставКодаМаркировки.ВключаетКодПроверки) Тогда
		
		ПараметрыНормализацииКМ = РазборКодаМаркировкиИССлужебныйКлиентСервер.НастройкиРазбораКодаМаркировкиДляСохраненияВПул();
		
		НормализованныйКод = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
			ДанныеШтрихкода.ДанныеРазбора,
			ДанныеШтрихкода.ВидПродукции,
			ПараметрыНормализацииКМ);
		
		Если НормализованныйКод <> ДанныеШтрихкода.ДанныеРазбора.КодМаркировки Тогда
			
			ДанныеЗаписи = Новый Структура();
			ДанныеЗаписи.Вставить("КодМаркировки", НормализованныйКод);
			
			РегистрыСведений.ПулКодовМаркировкиСУЗ.ЗаписатьДанныеКодаМаркировки(
				ДанныеШтрихкода,
				ПараметрыСканирования,
				ДанныеЗаписи);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает результат обработки штрихкода с описанием ошибки.
// 
// Параметры:
//  ДанныеШтрихкода - (См. ШтрихкодированиеИС.ИнициализироватьДанныеШтрихкода).
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
// Возвращаемое значение:
//  Структура - (См. ШтрихкодированиеИСМП.ИнициализироватьРезультатОбработкиШтрихкода).
Функция РезультатОбработкиКодаМаркировкиПриОшибках(ДанныеШтрихкода, ПараметрыСканирования) Экспорт
	
	РезультатДобавления = ШтрихкодированиеИСМПСлужебный.ИнициализироватьРезультатОбработкиШтрихкода(ДанныеШтрихкода);
	РезультатДобавления.ДанныеШтрихкода = ДанныеШтрихкода;
	ЗаполнитьЗначенияСвойств(РезультатДобавления, ДанныеШтрихкода);
	
	Если ЗначениеЗаполнено(ДанныеШтрихкода.ВидПродукции) Тогда
		РезультатДобавления.ВидыПродукции.Добавить(ДанныеШтрихкода.ВидПродукции);
	Иначе
		Для Каждого ВидПродукции Из ДанныеШтрихкода.ВидыПродукцииКодаМаркировки Цикл
			РезультатДобавления.ВидыПродукции.Добавить(ВидПродукции);
		КонецЦикла;
	КонецЕсли;
	
	Возврат РезультатДобавления;
	
КонецФункции

// Реализует обработку действий пользователя. Возвращает результат обработки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  Действие - Строка - Идентификатор действия.
//  Параметры - (См. ШтрихкодированиеИС.ИнициализироватьПараметрыОбработкиВыбора).
// Возвращаемое значение:
//  (См. ШтрихкодированиеИС.ИнициализироватьРезультатОбработкиШтрихкода).
Функция ВыполнитьДействие(Форма, Действие, Параметры) Экспорт

	Если Действие = "ОбработатьВыборСерии" Тогда
		
		РезультатВыбора             = Параметры.РезультатВыбора;
		РезультатОбработкиШтрихкода = Параметры.РезультатОбработкиШтрихкода;
		КэшированныеЗначения        = Параметры.КэшированныеЗначения;
		РезультатВыбора = ШтрихкодированиеИСМПСлужебный.ОбработатьВыборСерии(Форма, РезультатВыбора, РезультатОбработкиШтрихкода, КэшированныеЗначения);
		
		Возврат РезультатВыбора;
		
	КонецЕсли;
	
КонецФункции

// Возвращает структуру "ВложенныеШтрихкоды" по коллекции кодов марок. Для марок табачных пачек так же формируется дерево
// упаковок. Неизвестные марки будут созданы в базе.
// 
// Параметры:
//  ДанныеШтрихкодовСписок - Массив из Структура - Структура("Штрихкод, Количество").
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
//  ДляУпаковокТребоватьПодключениеМОТП - Булево - Требовать подключение МОТП для упаковок, если ранее не было проверено
//  наличие данных для построения структуры без обращения к сервису.
// Возвращаемое значение:
//  Структура - (См. ШтрихкодированиеМОТП.ИнициализацияРезультатаПолученияВложенныхШтрихкодовПоДаннымМОТП);
Функция ВложенныеШтрихкоды(ДанныеШтрихкодовСписок, ПараметрыСканирования, ДляУпаковокТребоватьПодключениеМОТП = Истина) Экспорт
	
	Если ПараметрыСканирования.ЗапрашиватьДанныеНеизвестныхУпаковокИСМП Тогда
		
		Возврат ВложенныеШтрихкодыПоДаннымМОТП(ДанныеШтрихкодовСписок, ПараметрыСканирования);
		
	Иначе
		
		Результат = ИнициализацияРезультатаФормированияВложенныхШтрихкодов();
		
		Если ДляУпаковокТребоватьПодключениеМОТП Тогда
			
			Для Каждого СтрокаШтрихкода Из ДанныеШтрихкодовСписок Цикл
				ВидПродукции = Неопределено;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаШтрихкода, "ВидПродукции") Тогда
					ВидПродукции = СтрокаШтрихкода.ВидПродукции;
				КонецЕсли;
				ДанныеРазбора = ШтрихкодированиеИС.НоваяСтруктураОбработкиШтрихкода(СтрокаШтрихкода.Штрихкод, ВидПродукции);
				Если ДанныеРазбора.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
					Или ДанныеРазбора.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
					
					Результат.ЕстьОшибки  = Истина;
					Результат.ТекстОшибки = ТекстОшибкиЗапрещеноЗапрашиватьДанныеВМОТП();
					
					Возврат Результат;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		ДанныеПоШтрихкодам = ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам(Ложь);
		ШтрихкодированиеИС.ПодготовитьДанныеКодовМаркировкиДляОбработки(
			ДанныеПоШтрихкодам.ДанныеКодовМаркировки, ДанныеШтрихкодовСписок, ПараметрыСканирования);
		ШтрихкодированиеИС.ИндексироватьКолонкиТаблицыДанныхКодовМаркировки(ДанныеПоШтрихкодам.ДанныеКодовМаркировки);
		
		ШтрихкодированиеИСМПСлужебный.ЗаполнитьДанныеКодовМаркировкиПоДаннымУПД(ДанныеПоШтрихкодам, ПараметрыСканирования);
		
		ЗаполнитьДанныеНеизвестныхТабачныхПачекБезЗапросаСведенийМОТП(ДанныеПоШтрихкодам, ПараметрыСканирования);
		ШтрихкодированиеИСМПСлужебный.ЗаполнитьСтрокиТаблицыДанныхПоГрупповымУпаковкам(ДанныеПоШтрихкодам.ДанныеКодовМаркировки);
		
		ДанныеПоШтрихкодам.ВложенныеШтрихкоды = ШтрихкодированиеИС.ИнициализацияВложенныхШтрихкодов();
		НормализоватьСвойстваКоллекцииВложенныхШтрихкодов(ДанныеПоШтрихкодам.ВложенныеШтрихкоды.ДеревоУпаковок);
		НормализоватьСвойстваКоллекцииВложенныхШтрихкодов(ДанныеПоШтрихкодам.ВложенныеШтрихкоды.МаркированныеТовары);
		
		Для Каждого СтрокаДанных Из ДанныеПоШтрихкодам.ДанныеКодовМаркировки Цикл
			
			НоваяСтрокаДерева = ДанныеПоШтрихкодам.ВложенныеШтрихкоды.ДеревоУпаковок.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДерева, СтрокаДанных);
			
			НоваяСтрокаТаблицы = ДанныеПоШтрихкодам.ВложенныеШтрихкоды.МаркированныеТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрокаДанных);
			НоваяСтрокаТаблицы.СтрокаДерева = НоваяСтрокаДерева;
			
		КонецЦикла;
		
		Результат.ВложенныеШтрихкоды = ДанныеПоШтрихкодам.ВложенныеШтрихкоды;
		
		Возврат Результат;
		
	КонецЕсли;
	
КонецФункции

// Выполняет запрос в МОТП, на основании которого формирует "ВложенныеШтрихкоды".
//
// Параметры:
//  МассивСтрокТаблицы - Массив - Список строк таблицы "ДанныеКодовМаркировки" См. ШтрихкодированиеИС.ИнициализацияТаблицыДанныхКодовМаркировки.
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
//  ТребуемаяДетализация - ПеречислениеСсылка.ДетализацияСтруктурыХраненияИС - Требуемая детализация
// Возвращаемое значение:
//  Структура - Описание:
// * ТекстОшибки - Строка - Текст ошибки получения данных из МОТП.
// * ЕстьОшибки - Булево - Истина, если возникла ошибка при попытке получения данных из МОТП.
// * ВложенныеШтрихкоды - Неопределено, Структура - Включает в себя дерево упаковок и маркированные товары.
Функция ДеревоУпаковокПоДаннымМОТП(МассивСтрокТаблицы, ПараметрыСканирования, ТребуемаяДетализация = Неопределено) Экспорт
	
	Если ТребуемаяДетализация = Неопределено Тогда
		Детализация = ПараметрыСканирования.ДетализацияСтруктурыХранения;
		
		ПравилаДетализацииДереваУпаковок = ПравилаДетализацииДереваУпаковок();
		ПравилоДетализации = ПравилаДетализацииДереваУпаковок[Детализация];
		
		// Полная детализация требуется для того, что бы в ДанныхКодовМаркировки можно
		// было найти информацию о вложенных единицах. В противном случае разрывается связь
		// между кодами из сервиса и считанными штрихкодами.
		Если ЗначениеЗаполнено(ПравилоДетализации) И ПравилоДетализации.РазрешеныПачки Тогда
			Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.Полная;
		КонецЕсли;
	Иначе
		Детализация = ТребуемаяДетализация;
	КонецЕсли;
	
	РезультатПолученияДерева = ИнтерфейсМОТП.ДеревоУпаковок(
		МассивСтрокТаблицы, Детализация, ПараметрыСканирования);
	
	Если РезультатПолученияДерева.ТребуетсяОбновлениеКлючаСессии Тогда
		РезультатПолученияДерева.ТекстОшибки = НСтр("ru = 'Не удалось получить данные из ИС МОТП.
		                                                  |По причине: Требуется обновление ключа сессии.'");
	КонецЕсли;
	
	Возврат РезультатПолученияДерева;
	
КонецФункции

// Получает данные из государтсвенных информационных систем и заполняет данные для упаковок, о которых нет никакой 
// информации в справочнике Штрихкоды упаковок.
// 
// Параметры:
//  ДанныеПоШтрихкодам - (См. ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам).
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
Процедура ЗаполнитьДанныеНеизвестныхУпаковок(ДанныеПоШтрихкодам, ПараметрыСканирования) Экспорт
	
	МассивСтрокТаблицы = Новый Массив;
	Для Каждого СтрокаДанных Из ДанныеПоШтрихкодам.ДанныеКодовМаркировки Цикл
		
		Если СтрокаДанных.ОбработанСОшибками Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанных.ВидПродукции)
			И Не ИнтеграцияИСКлиентСервер.ЭтоПродукцияМОТП(СтрокаДанных.ВидПродукции) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДанных.Идентифицирован Тогда
			Если Не ШтрихкодированиеИСМПСлужебный.СтруктураДанныхТребуетЗагрузкиВложенныхКодовМаркировки(СтрокаДанных, ПараметрыСканирования) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ПрисутствуетТабачнаяПродукция = ШтрихкодированиеИС.ПрисутствуетТабачнаяПродукция(СтрокаДанных.ВидыПродукцииКодаМаркировки);
		ЭтоЛогистическаяИлиГрупповаяУпаковка = ИнтеграцияИСКлиентСервер.ЭтоУпаковкаПоВиду(СтрокаДанных.ВидУпаковки);
		
		// В каких случаях требуется выдавать сообщение об ошибке, если ЗапрашиватьДанныеНеизвестныхУпаковок = Ложь
		// - если в упаковке нет GTIN
		// - В зависимости от детализации:
		//     * Полная                                          - сканируем короб или блок
		//     * Индивидуальные потребительские упаковки (пачки) - сканируем короб или блок
		//     * Блоки с пачками                                 - сканируем короб или блок
		//     * Короба с блоками                                - сканируем короб
		//     * Потребительские упаковки                        - сканируем короб
		Если ПрисутствуетТабачнаяПродукция
			И Не ПараметрыСканирования.ЗапрашиватьДанныеНеизвестныхУпаковокИСМП
			И Не ПараметрыСканирования.РазрешенаОбработкаНеНайденныхЛогистическихУпаковок Тогда
			
			ТекстОшибки = Неопределено;
			
			Если ЭтоЛогистическаяИлиГрупповаяУпаковка
				И Не ЗначениеЗаполнено(СтрокаДанных.GTIN) Тогда
				
				ТекстОшибки = НСтр(
					"ru = 'В коде упаковки не содержится GTIN, невозможно определить
					      |количество вложенных пачек.
					      |Включите опцию ""Контролировать статусы кодов маркировки""
					      |в панели администрирования ""Интеграция с ИС МП (обувь, одежда, табак...)""
					      |или отсканируйте содержимое упаковки.'");
				
			КонецЕсли;
			
			Если ЭтоЛогистическаяИлиГрупповаяУпаковка
				И ПараметрыСканирования.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.Полная Тогда
				
				ТекстОшибки = НСтр(
					"ru = 'В режиме детализации: ""Полная"" обработка логистических упаковок и блоков
					      |невозможна, так как выключена опция
					      |""Контролировать статусы кодов маркировки"".
					      |Включите опцию в панели администрирования ""Интеграция с ИС МП (обувь, одежда, табак...)""
					      |или отсканируйте вложенные пачки
					      |или измените режим детализации на ""Коробки с блоками"".'");
				
			КонецЕсли;
			
			Если ЭтоЛогистическаяИлиГрупповаяУпаковка
				И ПараметрыСканирования.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки Тогда
				
				ТекстОшибки = НСтр(
					"ru = 'В режиме детализации: ""Пачки"" обработка логистических упаковок и блоков
					      |невозможна, так как выключена опция
					      |""Контролировать статусы кодов маркировки"".
					      |Включите опцию в панели администрирования ""Интеграция с ИС МП (обувь, одежда, табак...)""
					      |или отсканируйте вложенные пачки
					      |или измените режим детализации на ""Коробки с блоками"".'");
				
			КонецЕсли;
			
			Если ЭтоЛогистическаяИлиГрупповаяУпаковка
				И ПараметрыСканирования.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими Тогда
				
				ТекстОшибки = НСтр(
					"ru = 'В режиме детализации: ""Блоки с пачками"" обработка логистических упаковок
					      |и блоков невозможна, так как выключена опция
					      |""Контролировать статусы кодов маркировки"".
					      |Включите опцию в панели администрирования ""Интеграция с ИС МП (обувь, одежда, табак...)""
					      |или отсканируйте вложенные пачки
					      |или измените режим детализации на ""Коробки с блоками"".'");
				
			КонецЕсли;
			
			Если СтрокаДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
				И ПараметрыСканирования.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками Тогда
				
				ТекстОшибки = НСтр(
					"ru = 'В режиме детализации: ""Коробки с блоками"" обработка логистических упаковок
					      |невозможна, так как выключена опция
					      |""Контролировать статусы кодов маркировки"".
					      |Включите опцию в панели администрирования ""Интеграция с ИС МП (обувь, одежда, табак...)""
					      |или отсканируйте вложенные блоки
					      |или измените режим детализации на ""Палеты с коробками"".'");
				
			КонецЕсли;
			
			Если СтрокаДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
				И ПараметрыСканирования.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками Тогда
				
				ТекстОшибки = НСтр(
					"ru = 'В режиме детализации: ""Блоки, пачки"" обработка логистических упаковок
					      |невозможна, так как выключена опция
					      |""Контролировать статусы кодов маркировки"".
					      |Включите опцию в панели администрирования ""Интеграция с ИС МП (обувь, одежда, табак...)""
					      |или отсканируйте вложенные блоки
					      |или измените режим детализации на ""Палеты с коробками"".'");
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекстОшибки) ТОгда
				Если ПустаяСтрока(СтрокаДанных.ТекстОшибки) Тогда
					СтрокаДанных.ТекстОшибки = ТекстОшибки;
				Иначе
					СтрокаДанных.ТекстОшибки = СтрШаблон(
						"%1
						|%2", СтрокаДанных.ТекстОшибки, ТекстОшибки);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтоЛогистическаяИлиГрупповаяУпаковка
			И Не СтрокаДанных.Идентифицирован
			И ПрисутствуетТабачнаяПродукция
			И Не ЗначениеЗаполнено(СтрокаДанных.ТекстОшибки) Тогда
			МассивСтрокТаблицы.Добавить(СтрокаДанных);
			СтрокаДанных.Идентифицирован = ЗначениеЗаполнено(СтрокаДанных.GTIN);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивСтрокТаблицы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// В маркировке товаров разрешено добавлять пустые упаковки при выключенном запросе статусов
	Если ПараметрыСканирования.ЗапрашиватьДанныеНеизвестныхУпаковокИСМП Тогда
		
		Результат = ДеревоУпаковокПоДаннымМОТП(МассивСтрокТаблицы, ПараметрыСканирования);
		
		Если Не ПустаяСтрока(Результат.ТекстОшибки) Тогда
			
			ДанныеПоШтрихкодам.ЕстьОшибки                     = Истина;
			ДанныеПоШтрихкодам.ТекстОшибки                    = Результат.ТекстОшибки;
			ДанныеПоШтрихкодам.ТребуетсяОбновлениеКлючаСессии = Результат.ТребуетсяОбновлениеКлючаСессии;
			
			Возврат;
			
		КонецЕсли;
		
		Если ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП
			И ПараметрыСканирования.ПроверятьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодовМОТП Тогда
			
			РезультатПроверкиСеройЗоны = ПроверитьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодов(
				Результат, ДанныеПоШтрихкодам.ДанныеКодовМаркировки, ПараметрыСканирования);
			
			Если Не ПустаяСтрока(РезультатПроверкиСеройЗоны.ТекстОшибки) Тогда
				
				ДанныеПоШтрихкодам.ЕстьОшибки                     = Истина;
				ДанныеПоШтрихкодам.ТекстОшибки                    = РезультатПроверкиСеройЗоны.ТекстОшибки;
				ДанныеПоШтрихкодам.ТребуетсяОбновлениеКлючаСессии = РезультатПроверкиСеройЗоны.ТребуетсяОбновлениеКлючаСессии;
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ОтключитьОтборПоВидуПродукции = Ложь;
		
		ОбработатьДеревоПолученноеИзМОТП(Результат, ДанныеПоШтрихкодам, ПараметрыСканирования, ОтключитьОтборПоВидуПродукции);
		
		// Заполнить только коэффициенты упаковок, если не заполнены ранее
		ШтрихкодированиеИСМПСлужебный.ЗаполнитьСтрокиТаблицыДанныхПоГрупповымУпаковкам(МассивСтрокТаблицы, Ложь);

	Иначе
		
		// Заполнить коэффициенты упаковок и количество вложенных пачек
		ШтрихкодированиеИСМПСлужебный.ЗаполнитьСтрокиТаблицыДанныхПоГрупповымУпаковкам(МассивСтрокТаблицы);
		
	КонецЕсли;
	
	ДополнитьДанныеПоШтрихкодамДаннымиПулаКодовМаркировки(ДанныеПоШтрихкодам, ПараметрыСканирования);
	
	ОбработкаДанныхПоШтрихкодамУчетМРЦ(ДанныеПоШтрихкодам, ПараметрыСканирования);
	
КонецПроцедуры

Функция ПроверитьПотребительскиеУпаковкиНаВхождениеВСеруюЗону(ЭлементыДанных, ПараметрыСканирования)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	
	КандидатыВСеруюЗону = Новый Массив;
	Для Каждого ЭлементДанных Из ЭлементыДанных Цикл
		
		Если ЭлементДанных.ВидПродукции = Перечисления.ВидыПродукцииИС.АльтернативныйТабак Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
			ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП;
		Иначе
			ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыМОТП;
		КонецЕсли;
		
		Если ДопустимыеСтатусыМОТП.Найти(ЭлементДанных.Статус) = Неопределено Тогда
			КандидатыВСеруюЗону.Добавить(ЭлементДанных);
		КонецЕсли;
	
	КонецЦикла;
	
	Если КандидатыВСеруюЗону.Количество() = 0 Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	РезультатПроверки = ИнтерфейсМОТП.ПроверитьСеруюЗонуКодовМаркировки(КандидатыВСеруюЗону);
	Если РезультатПроверки.СостояниеСеройЗоны <> Неопределено Тогда
		
		Для Каждого ЭлементДанных Из КандидатыВСеруюЗону Цикл
			
			СостояниеСеройЗоны = РезультатПроверки.СостояниеСеройЗоны[ЭлементДанных];
			
			Если СостояниеСеройЗоны = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЭлементДанных.ВСеройЗоне = СостояниеСеройЗоны.ВСеройЗоне;
			
		КонецЦикла;
		
	Иначе
		
		ВозвращаемоеЗначение.ТекстОшибки                    = РезультатПроверки.ТекстОшибки;
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = РезультатПроверки.ТребуетсяОбновлениеКлючаСессии;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПроверитьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодов(Результат, ДанныеКодовМаркировки, ПараметрыСканирования)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	
	ШтрихкодыEAN = Новый Массив;
	Для Каждого СтрокаТЧ Из Результат.GTIN Цикл
		ШтрихкодыEAN.Добавить(ШтрихкодированиеИСКлиентСервер.ШтрихкодEANИзGTIN(СтрокаТЧ.GTIN));
	КонецЦикла;
	
	ИнформацияПоШтрихкодамEAN = ШтрихкодированиеИС.ДанныеПоШтрихкодамEAN(ШтрихкодыEAN);
	СтандартнаяВложенностьУпаковок = Новый Соответствие;
	Для Каждого СтрокаТЧ Из ИнформацияПоШтрихкодамEAN Цикл
		СтандартнаяВложенностьУпаковок.Вставить(
			ШтрихкодированиеИСКлиентСервер.GTINПоШтрихкодуEAN(СтрокаТЧ.ШтрихкодEAN),
			СтрокаТЧ.Коэффициент);
	КонецЦикла;
	
	КандидатыВСеруюЗону = Новый Массив;
	Для Каждого СтрокаДерева Из Результат.ДеревоУпаковок.Строки Цикл
		
		НайтиУпаковкиДляПроверкиНаВхождениеВСеруюЗону(
			СтрокаДерева, КандидатыВСеруюЗону, СтандартнаяВложенностьУпаковок, ПараметрыСканирования);
		
	КонецЦикла;
	
	Если КандидатыВСеруюЗону.Количество() = 0 Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	РезультатПроверки = ИнтерфейсМОТП.ПроверитьСеруюЗонуКодовМаркировки(КандидатыВСеруюЗону);
	Если РезультатПроверки.СостояниеСеройЗоны <> Неопределено Тогда
		
		Для Каждого СтрокаДерева Из КандидатыВСеруюЗону Цикл
			
			СостояниеСеройЗоны = РезультатПроверки.СостояниеСеройЗоны[СтрокаДерева];
			
			Если СостояниеСеройЗоны = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДерева.ВСеройЗоне        = СостояниеСеройЗоны.ВСеройЗоне;
			СтрокаДерева.СодержитСерыеКоды = СостояниеСеройЗоны.СодержитСерыеКоды;
			
			Если СостояниеСеройЗоны.СодержитСерыеКоды
				И Не ПараметрыСканирования.ЭтоПроверкаКодовМаркировкиИСМП Тогда
				
				КоличествоПачекВСерыхБлоках = 0;
				Если СостояниеСеройЗоны.КоличествоБлоков > 0 Тогда
					GTINБлока = GTINВложеннойГрупповойУпаковки(СтрокаДерева);
					Если GTINБлока <> Неопределено Тогда
						КоличествоПачекВБлоке = СтандартнаяВложенностьУпаковок[GTINБлока];
						Если КоличествоПачекВБлоке <> Неопределено Тогда
							КоличествоПачекВСерыхБлоках = КоличествоПачекВБлоке * СостояниеСеройЗоны.КоличествоБлоков;
						КонецЕсли;
					ИначеЕсли СостояниеСеройЗоны.КоличествоВложенныхЕдиниц > 0 Тогда
						ПлановоеКоличествоВложенныхПачек = КоэффициентУпаковки(СтрокаДерева, СтандартнаяВложенностьУпаковок);
						Если ПлановоеКоличествоВложенныхПачек <> Неопределено Тогда
							РасчетноеКоличествоПачекВБлоке = ПлановоеКоличествоВложенныхПачек / СостояниеСеройЗоны.КоличествоВложенныхЕдиниц;
							Если РасчетноеКоличествоПачекВБлоке = Цел(РасчетноеКоличествоПачекВБлоке) Тогда
								КоличествоПачекВСерыхБлоках = РасчетноеКоличествоПачекВБлоке * СостояниеСеройЗоны.КоличествоБлоков;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				// Очистить вложенные упаковки, привести количество пачек к количеству, заданному произодителем
				СтрокаДерева.КоличествоПачек   = СтрокаДерева.КоличествоПачек  + СостояниеСеройЗоны.КоличествоПачек + КоличествоПачекВСерыхБлоках;
				Если СтрокаДерева.ВидУпаковки <> Перечисления.ВидыУпаковокИС.Групповая Тогда
					СтрокаДерева.КоличествоБлоков = 0;
				КонецЕсли;
				
				Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл
					ОчиститьСсылкиНаСрокиДереваРекурсивно(ВложеннаяСтрокаДерева, ДанныеКодовМаркировки);
				КонецЦикла;
				
				СтрокаДерева.Строки.Очистить();
				
			ИначеЕсли ЗначениеЗаполнено(СтрокаДерева.ДатаПроизводства)
				И СтрокаДерева.ДатаПроизводства < ПараметрыСканирования.ДатаПроизводстваНачалаКонтроляСтатусовКодовМаркировкиМОТП
				И Не ПараметрыСканирования.ЭтоПроверкаКодовМаркировкиИСМП Тогда
				
				// До первого июля не действует контроль...
				СтрокаДерева.КоличествоПачек   = СтандартнаяВложенностьУпаковок[СтрокаДерева.GTIN];
				Если СтрокаДерева.ВидУпаковки <> Перечисления.ВидыУпаковокИС.Групповая Тогда
					СтрокаДерева.КоличествоБлоков = 0;
				КонецЕсли;
				
				Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл
					ОчиститьСсылкиНаСрокиДереваРекурсивно(ВложеннаяСтрокаДерева, ДанныеКодовМаркировки);
				КонецЦикла;
				
				СтрокаДерева.Строки.Очистить();
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ВозвращаемоеЗначение.ТекстОшибки                    = РезультатПроверки.ТекстОшибки;
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = РезультатПроверки.ТребуетсяОбновлениеКлючаСессии;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура ОчиститьСсылкиНаСрокиДереваРекурсивно(СтрокаДерева, ДанныеКодовМаркировки)
	
	Если ЗначениеЗаполнено(СтрокаДерева.НормализованныйШтрихкод) Тогда
		СтрокаДанных = ДанныеКодовМаркировки.Найти(СтрокаДерева.НормализованныйШтрихкод, "НормализованныйШтрихкод");
		Если СтрокаДанных <> Неопределено Тогда
			СтрокаДанных.СтрокаДерева = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл
		
		ОчиститьСсылкиНаСрокиДереваРекурсивно(ВложеннаяСтрокаДерева, ДанныеКодовМаркировки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(СтрокаДерева, ДанныеКодовМаркировки)
	
	Если ДанныеКодовМаркировки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ДанныеКодовМаркировки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	СтрокаДанных = ДанныеКодовМаркировки.Найти(СтрокаДерева, "СтрокаДерева");
	Если СтрокаДанных <> Неопределено Тогда
		ДанныеКодовМаркировки.Удалить(СтрокаДанных);
	КонецЕсли;
	
	Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл
		УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(ВложеннаяСтрокаДерева, ДанныеКодовМаркировки);
	КонецЦикла;
	
КонецПроцедуры

Процедура НайтиУпаковкиДляПроверкиНаВхождениеВСеруюЗону(СтрокаДерева, КандидатыВСеруюЗону, СтандартнаяВложенностьУпаковок, ПараметрыСканирования)
	
	ДобавитьВКандидаты = Ложь;
	Если СтрокаДерева.Строки.Количество() > 0 Тогда
		
		ФактическоеКоличествоВложенныхУпаковок = 0;
		КоэффициентВложенныхЕдиниц             = Неопределено;
		Для Каждого СтрокаДереваВложенная Из СтрокаДерева.Строки Цикл
			
			Если СтрокаДереваВложенная.ВидПродукции = Перечисления.ВидыПродукцииИС.АльтернативныйТабак Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДереваВложенная.GTIN) Тогда
				
				КоэффициентТекущейУпаковки = КоэффициентУпаковки(СтрокаДереваВложенная, СтандартнаяВложенностьУпаковок);
				Если КоэффициентТекущейУпаковки = Неопределено
					И СтрокаДереваВложенная.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
					КоэффициентТекущейУпаковки = 1;
				КонецЕсли;
				
				Если КоэффициентВложенныхЕдиниц = Неопределено Тогда
					КоэффициентВложенныхЕдиниц = КоэффициентТекущейУпаковки;
					Если КоэффициентВложенныхЕдиниц = Неопределено
						И СтрокаДереваВложенная.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
						КоэффициентВложенныхЕдиниц = 1;
					КонецЕсли;
				ИначеЕсли КоэффициентВложенныхЕдиниц <> КоэффициентТекущейУпаковки Тогда
					// В упаковке содержится разная продукция
					КоэффициентВложенныхЕдиниц = 0;
				КонецЕсли;
				
				ФактическоеКоличествоВложенныхУпаковок = ФактическоеКоличествоВложенныхУпаковок + 1;
				
			КонецЕсли;
			
			НайтиУпаковкиДляПроверкиНаВхождениеВСеруюЗону(
				СтрокаДереваВложенная, КандидатыВСеруюЗону, СтандартнаяВложенностьУпаковок, ПараметрыСканирования);
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СтрокаДерева.GTIN) Тогда
			КоэффициентУпаковки = КоэффициентУпаковки(СтрокаДерева, СтандартнаяВложенностьУпаковок);
		Иначе
			КоэффициентУпаковки = Неопределено;
		КонецЕсли;
		Если КоэффициентВложенныхЕдиниц <> Неопределено
			И КоэффициентВложенныхЕдиниц <> 0
			И КоэффициентУпаковки <> Неопределено
			И КоэффициентУпаковки <> 0 Тогда
			
			ЕмкостьУпаковки = КоэффициентУпаковки / КоэффициентВложенныхЕдиниц;
			
			Если ЕмкостьУпаковки <> ФактическоеКоличествоВложенныхУпаковок
				И ЕмкостьУпаковки <> 1 Тогда
				ДобавитьВКандидаты = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли (СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
		Или СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая)
		И СтрокаДерева.ВидПродукции <> Перечисления.ВидыПродукцииИС.АльтернативныйТабак Тогда
		
		Если ЗначениеЗаполнено(СтрокаДерева.GTIN) Тогда
			КоэффициентУпаковки = КоэффициентУпаковки(СтрокаДерева, СтандартнаяВложенностьУпаковок);
		Иначе
			КоэффициентУпаковки = Неопределено;
		КонецЕсли;
		
		Если КоэффициентУпаковки <> Неопределено
			И КоэффициентУпаковки <> СтрокаДерева.КоличествоПачек Тогда
			ДобавитьВКандидаты = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ДобавитьВКандидаты Тогда
		
		Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
			ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП;
		Иначе
			ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыМОТП;
		КонецЕсли;
		
		Если ДопустимыеСтатусыМОТП.Найти(СтрокаДерева.Статус) = Неопределено Тогда
			ДобавитьВКандидаты = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДобавитьВКандидаты
		И СтрокаДерева.Статус <> Перечисления.СтатусыКодовМаркировкиМОТП.Неопределен Тогда
		КандидатыВСеруюЗону.Добавить(СтрокаДерева);
	КонецЕсли;
	
КонецПроцедуры

Функция КоэффициентУпаковки(СтрокаДерева, СтандартнаяВложенностьУпаковок)
	
	КоличествоВложенныхЕдиницGTIN02 = Неопределено;
	Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
		И СтрокаДерева.СоставКодаМаркировки <> Неопределено Тогда
		СтрокаДерева.СоставКодаМаркировки.Свойство("КоличествоВложенныхЕдиниц", КоличествоВложенныхЕдиницGTIN02);
	КонецЕсли;
	
	Если КоличествоВложенныхЕдиницGTIN02 <> Неопределено Тогда
		КоэффициентУпаковки = КоличествоВложенныхЕдиницGTIN02;
	Иначе
		КоэффициентУпаковки = СтандартнаяВложенностьУпаковок[СтрокаДерева.GTIN];
	КонецЕсли;
	
	Возврат КоэффициентУпаковки;
	
КонецФункции

Функция GTINВложеннойГрупповойУпаковки(СтрокаДерева)
	
	Если СтрокаДерева.Строки.Количество() > 0 Тогда
		
		Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл
			Если ВложеннаяСтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
				Возврат ВложеннаяСтрокаДерева.GTIN;
			ИначеЕсли ВложеннаяСтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
				Возврат GTINВложеннойГрупповойУпаковки(ВложеннаяСтрокаДерева);
			КонецЕсли;
		КонецЦикла;
		
		Возврат Неопределено;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Формирует вложенные штрихкоды по данным, полученным в системе МОТП.
// 
// Параметры:
//  ДанныеШтрихкодовСписок - Массив из Структура - Описание:
// * Штрихкод - Строка - Код маркировки.
// * Количество - Число - Количество.
//  ПараметрыСканирования - Структура - Описание:
// Возвращаемое значение:
//  Структура - (См. ИнициализацияФормированияПолученияВложенныхШтрихкодов).
Функция ВложенныеШтрихкодыПоДаннымМОТП(ДанныеШтрихкодовСписок, ПараметрыСканирования)
	
	РезультатФормированияВложенныхШтрихкодов = ИнициализацияРезультатаФормированияВложенныхШтрихкодов();
	
	РезультатФормированияВложенныхШтрихкодов.Вставить("ВложенныеШтрихкоды",             Неопределено);
	РезультатФормированияВложенныхШтрихкодов.Вставить("ЕстьОшибки",                     Ложь);
	РезультатФормированияВложенныхШтрихкодов.Вставить("ТекстОшибки",                    "");
	РезультатФормированияВложенныхШтрихкодов.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	
	ДанныеПоШтрихкодам = ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам(Ложь);
	ШтрихкодированиеИС.ПодготовитьДанныеКодовМаркировкиДляОбработки(
		ДанныеПоШтрихкодам.ДанныеКодовМаркировки, ДанныеШтрихкодовСписок, ПараметрыСканирования);
	
	Если ШтрихкодированиеИС.ПрисутствуетТабачнаяПродукция(ПараметрыСканирования.ДопустимыеВидыПродукции)
		Или ШтрихкодированиеИС.ПрисутствуетПродукцияИСМП(ПараметрыСканирования.ДопустимыеВидыПродукции) Тогда
		МодульШтрихкодированиеИСМПСлужебный = ОбщегоНазначения.ОбщийМодуль("ШтрихкодированиеИСМПСлужебный");
		МодульШтрихкодированиеИСМПСлужебный.ОпределениеВидаПродукции(ДанныеПоШтрихкодам, ПараметрыСканирования, Истина);
		Если ДанныеПоШтрихкодам.ЕстьОшибки Тогда
			РезультатФормированияВложенныхШтрихкодов.ЕстьОшибки                     = ДанныеПоШтрихкодам.ЕстьОшибки;
			РезультатФормированияВложенныхШтрихкодов.ТребуетсяОбновлениеКлючаСессии = ДанныеПоШтрихкодам.ТребуетсяОбновлениеКлючаСессии;
			РезультатФормированияВложенныхШтрихкодов.ТекстОшибки                    = ДанныеПоШтрихкодам.ТекстОшибки;
			Если РезультатФормированияВложенныхШтрихкодов.ЕстьОшибки Тогда
				Возврат РезультатФормированияВложенныхШтрихкодов;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ШтрихкодированиеИС.ИндексироватьКолонкиТаблицыДанныхКодовМаркировки(ДанныеПоШтрихкодам.ДанныеКодовМаркировки);
	
	// При получении вложенных штрихкодов в сценариях загрузки дерева документа поступления
	// требуется в точности обеспечить требуемую детализацию.
	// Однако, при сканировании кодов логистических упаковок в случае детализации
	// Пачки или Блоки с пачками требуется детализация более высокого порядка.
	ТребуемаяДетализация = ПараметрыСканирования.ДетализацияСтруктурыХранения;
	РезультатПолученияДерева = ДеревоУпаковокПоДаннымМОТП(
		ДанныеПоШтрихкодам.ДанныеКодовМаркировки, ПараметрыСканирования, ТребуемаяДетализация);
	
	РезультатФормированияВложенныхШтрихкодов.ТекстОшибки                    = РезультатПолученияДерева.ТекстОшибки;
	РезультатФормированияВложенныхШтрихкодов.ТребуетсяОбновлениеКлючаСессии = РезультатПолученияДерева.ТребуетсяОбновлениеКлючаСессии;
	РезультатФормированияВложенныхШтрихкодов.ЕстьОшибки                     = Не ПустаяСтрока(РезультатПолученияДерева.ТекстОшибки);
	
	Если РезультатФормированияВложенныхШтрихкодов.ЕстьОшибки Тогда
		Возврат РезультатФормированияВложенныхШтрихкодов;
	КонецЕсли;
	
	Если ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП
		И ПараметрыСканирования.ПроверятьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодовМОТП Тогда
		
		РезультатПроверкиСеройЗоны = ПроверитьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодов(
			РезультатПолученияДерева, ДанныеПоШтрихкодам.ДанныеКодовМаркировки, ПараметрыСканирования);
		
		Если Не ПустаяСтрока(РезультатПроверкиСеройЗоны.ТекстОшибки) Тогда
			
			РезультатФормированияВложенныхШтрихкодов.ЕстьОшибки                     = Истина;
			РезультатФормированияВложенныхШтрихкодов.ТекстОшибки                    = РезультатПроверкиСеройЗоны.ТекстОшибки;
			РезультатФормированияВложенныхШтрихкодов.ТребуетсяОбновлениеКлючаСессии = РезультатПроверкиСеройЗоны.ТребуетсяОбновлениеКлючаСессии;
			
			Возврат РезультатФормированияВложенныхШтрихкодов;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбработатьДеревоПолученноеИзМОТП(РезультатПолученияДерева, ДанныеПоШтрихкодам, ПараметрыСканирования);
	
	ШтрихкодированиеИС.ЗаполнитьКоэффициентыВложенностиУпаковокПоШтрихкодамEAN(
		ДанныеПоШтрихкодам.ДанныеКодовМаркировки, ПараметрыСканирования);
	// Заполнить только коэффициенты упаковок, если не заполнены ранее
	ШтрихкодированиеИСМПСлужебный.ЗаполнитьСтрокиТаблицыДанныхПоГрупповымУпаковкам(
		ДанныеПоШтрихкодам.ДанныеКодовМаркировки, Ложь);
	
	РезультатФормированияВложенныхШтрихкодов.ВложенныеШтрихкоды = ДанныеПоШтрихкодам.ВложенныеШтрихкоды;
	
	Возврат РезультатФормированияВложенныхШтрихкодов;
	
КонецФункции

// Инициализирует результат формирования вложенных штрихкодов по кодам маркировки МОТП.
// 
// Возвращаемое значение:
//  Структура - Описание:
// * ВложенныеШтрихкоды - Структура - Описание:
// * ЕстьОшибки - Булево - Истина, если есть ошибки.
// * ТекстОшибки - Строка - Описание ошибки.
// * ТребуетсяОбновлениеКлючаСессии - Булево - Истина, если требуется авторизация.
Функция ИнициализацияРезультатаФормированияВложенныхШтрихкодов()
	
	РезультатФормированияВложенныхШтрихкодов = Новый Структура;
	
	РезультатФормированияВложенныхШтрихкодов.Вставить("ВложенныеШтрихкоды",             Неопределено);
	РезультатФормированияВложенныхШтрихкодов.Вставить("ЕстьОшибки",                     Ложь);
	РезультатФормированияВложенныхШтрихкодов.Вставить("ТекстОшибки",                    "");
	РезультатФормированияВложенныхШтрихкодов.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	
	Возврат РезультатФормированияВложенныхШтрихкодов;
	
КонецФункции

// Инициализирует структуру правил для проверки на ошибки данных по кодам маркировки.
// 
// Параметры:
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
//  ДанныеПоШтрихкодам - (См. ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам).
// Возвращаемое значение:
//  Структура - Описание:
// * КонтрольВладельца - Массив - коллекция, куда требуется поместить строки с ошибками при контроле владельца.
// * КонтролироватьРасхождениеСоставаУпаковокМеждуИБиИСМП - Массив - коллекция, куда требуется поместить строки с ошибками при контроле состава упаковок.
// * КонтрольСпособаВводаВОборот - Массив - коллекция, куда требуется поместить строки с ошибками при контроле способа ввода в оборот.
// * КонтрольСерий - Массив - коллекция, куда требуется поместить строки с ошибками при контроле серий.
// * КонтрольСтатусов - Массив - коллекция, куда требуется поместить строки с ошибками при контроле допустимых статусов.
Функция ПравилаПроверкиНаОшибки(ПараметрыСканирования, ДанныеПоШтрихкодам, ПроверенныеШтрихкоды = Неопределено)
	
	ПравилаПроверкиНаОшибки = Новый Структура;
	ПравилаПроверкиНаОшибки.Вставить("ПроверенныеШтрихкоды", Новый Соответствие);
	
	Если ПараметрыСканирования.ЭтоПроверкаКодовМаркировкиИСМП Тогда
		Возврат ПравилаПроверкиНаОшибки;
	КонецЕсли;
	
	Если Не ПараметрыСканирования.Свойство("ДопустимыеСтатусыМОТП") Тогда
		Возврат ПравилаПроверкиНаОшибки;
	КонецЕсли;
	
	Если ПараметрыСканирования.ДопустимыеСтатусыМОТП.Количество() > 0
		И ПараметрыСканирования.ЗапрашиватьСтатусыИСМП Тогда
		
		ПравилоКонтроляСтатусов = Новый Структура;
		ПравилоКонтроляСтатусов.Вставить("СтрокиСОшибками",  Новый Массив);
		ПравилаПроверкиНаОшибки.Вставить("КонтрольСтатусов", ПравилоКонтроляСтатусов);
		
	КонецЕсли;
	
	Если ПараметрыСканирования.ПараметрыУказанияСерий <> Неопределено Тогда
		ПравилаПроверкиНаОшибки.Вставить("КонтрольСерий", Новый Массив);
	КонецЕсли;
	
	Если ПараметрыСканирования.КонтрольПустыхУпаковок
		И Не ПараметрыСканирования.ЭтоАгрегацияКодовМаркировки
		И Не ПараметрыСканирования.РазрешенаОбработкаНеНайденныхЛогистическихУпаковок Тогда
		ПравилаПроверкиНаОшибки.Вставить("КонтрольПустыхУпаковок", Новый Массив);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыСканирования.ДопустимыйСпособВводаВОборот) Тогда
		Если ПараметрыСканирования.ЗапрашиватьСтатусыИСМП Тогда
			ПравилаПроверкиНаОшибки.Вставить("КонтрольСпособаВводаВОборот",        Новый Массив);
		Иначе
			ПравилаПроверкиНаОшибки.Вставить("КонтрольСпособаВводаВОборотОффлайн", Новый Массив);
		КонецЕсли;
	КонецЕсли;

	Если ПараметрыСканирования.КонтролироватьРасхождениеСоставаУпаковокМеждуИБиИСМП
		И ДанныеПоШтрихкодам.ДеревоПоДаннымСервиса <> Неопределено Тогда
		
		ПравилаПроверкиНаОшибки.Вставить("КонтролироватьРасхождениеСоставаУпаковокМеждуИБиИСМП", Новый Массив);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыСканирования.Владелец)
		И ПараметрыСканирования.ЗапрашиватьСтатусыИСМП Тогда
		ПравилаПроверкиНаОшибки.Вставить("КонтрольВладельца", Новый Массив);
	КонецЕсли;
	
	Если ПараметрыСканирования.ТребоватьПолныйКодМаркировкиИСМП Тогда
		ПравилаПроверкиНаОшибки.Вставить("КонтрольПолногоКодаМаркировки", Новый Массив);
	КонецЕсли;
	
	Возврат ПравилаПроверкиНаОшибки;
	
КонецФункции

// Дополняет данные по штрихкодам информацией по табачным пачкам без запроса сведений из МОТП.
// 
// Параметры:
//  ДанныеПоШтрихкодам - (См. ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам).
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
Процедура ЗаполнитьДанныеНеизвестныхТабачныхПачекБезЗапросаСведенийМОТП(ДанныеПоШтрихкодам, ПараметрыСканирования)
	
	КодыДляАнализа = Новый Массив;
	Для Каждого СтрокаТаблицы Из ДанныеПоШтрихкодам.ДанныеКодовМаркировки Цикл
		
		Если СтрокаТаблицы.ОбработанСОшибками Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ВозможнаПродукцияМОТП(СтрокаТаблицы) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицы.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
			
			СтрокаТаблицы.КоличествоПачек  = 1;
			СтрокаТаблицы.ШтрихкодУпаковки = ШтрихкодированиеИС.СоздатьМаркированныйТоварПоДаннымШтрихкода(СтрокаТаблицы, ПараметрыСканирования);
			СтрокаТаблицы.Идентифицирован  = Истина;
			
		Иначе
			
			КодыДляАнализа.Добавить(СтрокаТаблицы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполнить только коэффициенты упаковок, если не заполнены ранее
	ШтрихкодированиеИСМПСлужебный.ЗаполнитьСтрокиТаблицыДанныхПоГрупповымУпаковкам(КодыДляАнализа, Ложь);
	
	Для Каждого СтрокаТаблицы Из КодыДляАнализа Цикл
		
		Если СтрокаТаблицы.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
			
			СтрокаТаблицы.КоличествоПачек  = 1;
			СтрокаТаблицы.ШтрихкодУпаковки = ШтрихкодированиеИС.СоздатьМаркированныйТоварПоДаннымШтрихкода(СтрокаТаблицы, ПараметрыСканирования);
			СтрокаТаблицы.Идентифицирован  = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Запрашивает сведения из МОТП по кодам марировки табачных пачек. Дополняет данные по штрихкодам полученными сведениями.
// 
// Параметры:
//  ДанныеПоШтрихкодам - (См. ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам).
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
Процедура ЗаполнитьДанныеНеизвестныхТабачныхПачекСЗапросомСведенийМОТП(ДанныеПоШтрихкодам, ПараметрыСканирования)
	
	МассивСтрокТаблицы = Новый Массив;
	Для Каждого СтрокаТаблицы Из ДанныеПоШтрихкодам.ДанныеКодовМаркировки Цикл
		
		Если СтрокаТаблицы.ОбработанСОшибками
				Или ЗначениеЗаполнено(СтрокаТаблицы.ТекстОшибки) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не СтрокаТаблицы.Идентифицирован
			И ВозможнаПродукцияМОТП(СтрокаТаблицы)
			И (СтрокаТаблицы.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская
				Или СтрокаТаблицы.ВидУпаковки = Перечисления.ВидыУпаковокИС.ПустаяСсылка()) Тогда
			МассивСтрокТаблицы.Добавить(СтрокаТаблицы);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивСтрокТаблицы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ДеревоУпаковокПоДаннымМОТП(МассивСтрокТаблицы, ПараметрыСканирования);
	
	Если Не ПустаяСтрока(Результат.ТекстОшибки) Тогда
		
		ДанныеПоШтрихкодам.ЕстьОшибки                     = Истина;
		ДанныеПоШтрихкодам.ТекстОшибки                    = Результат.ТекстОшибки;
		ДанныеПоШтрихкодам.ТребуетсяОбновлениеКлючаСессии = Результат.ТребуетсяОбновлениеКлючаСессии;
		
		Возврат;
	КонецЕсли;
	
	Если ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП
		И ПараметрыСканирования.ПроверятьПотребительскиеУпаковкиНаВхождениеВСеруюЗонуМОТП Тогда
		
		РезультатПроверкиСеройЗоны = ПроверитьПотребительскиеУпаковкиНаВхождениеВСеруюЗону(Результат.ДеревоУпаковок.Строки, ПараметрыСканирования);
		
		Если Не ПустаяСтрока(РезультатПроверкиСеройЗоны.ТекстОшибки) Тогда
			
			ДанныеПоШтрихкодам.ЕстьОшибки                     = Истина;
			ДанныеПоШтрихкодам.ТекстОшибки                    = РезультатПроверкиСеройЗоны.ТекстОшибки;
			ДанныеПоШтрихкодам.ТребуетсяОбновлениеКлючаСессии = РезультатПроверкиСеройЗоны.ТребуетсяОбновлениеКлючаСессии;
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОтключитьОтборПоВидуПродукции = Ложь;
	
	ОбработатьДеревоПолученноеИзМОТП(Результат, ДанныеПоШтрихкодам, ПараметрыСканирования, ОтключитьОтборПоВидуПродукции);
	
КонецПроцедуры

// Расчитывает МРЦ по строкам дерева по групповой упаковке в родительской строке.
// 
// Параметры:
// 	ВычисляемыеСтроки - Массив из СтрокаДереваЗначений - данные для расчета МРЦ по строкам.
Процедура РасчетМРЦПоСтрокамДерева(ВычисляемыеСтроки) Экспорт
	
	Если ВычисляемыеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из ВычисляемыеСтроки Цикл
		
		РодительСтроки = СтрокаДерева.Родитель;
		Если РодительСтроки = Неопределено
			Или ЗначениеЗаполнено(СтрокаДерева.МРЦ)
			Или Не ЗначениеЗаполнено(РодительСтроки.МРЦ)
			Или Не ЗначениеЗаполнено(РодительСтроки.КоличествоПачек) Тогда
			Продолжить;
		КонецЕсли;
		
		Если РодительСтроки.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая
			И СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
			СтрокаДерева.МРЦ = РодительСтроки.МРЦ / РодительСтроки.КоличествоПачек;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Рассчитывает инвариантный хэш: из кода исключается МРЦ, убираются скобки
// 
// Параметры:
//  СтрокаДанных  - Массив из СтрокаТаблицыЗначений: См. ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодама, Структура
//  - Строка данных для расчета.
//  ДанныеРазбора - см. РазборКодаМаркировкиИССлужебныйКлиентСервер.НовыйРезультатРазбораКодаМаркировки.
Процедура РассчитатьХэшСуммуНормализации(СтрокаДанных, ДанныеРазбора) Экспорт
	
	Если ДанныеРазбора = Неопределено
		Или СтрокаДанных.СоставКодаМаркировки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеРазбора.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская
		Или ШтрихкодированиеИСКлиентСервер.ВозможнаГрупповаяУпаковка(ДанныеРазбора.ВидУпаковки, ДанныеРазбора) Тогда
		
		ПараметрыНормализацииКМ = РазборКодаМаркировкиИССлужебныйКлиентСервер.НастройкиРазбораКодаМаркировкиДляХэшаНормализации();
		НормализованныйШтрихкод = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
			ДанныеРазбора, СтрокаДанных.ВидПродукции, ПараметрыНормализацииКМ);
		
		СтрокаДанных.НормализованныйШтрихкод = НормализованныйШтрихкод;
		СтрокаДанных.ХэшСуммаНормализации    = Справочники.ШтрихкодыУпаковокТоваров.ХэшСуммаСтроки(НормализованныйШтрихкод);
		
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает код маркировки с МРЦ для передачи на ККТ по данным пула.
// 
// Параметры:
// 	Коллекция - Соответствие - Ключ: код маркировки для поиска,
//                             Значение: Строка данных для установки штрихкода.
// Возвращаемое значение:
// 	Соответствие - Ключ: Код маркировки, для которого не найдено искомое значение.
Функция УстановитьШтрихкодДляПечатиККТ(Коллекция) Экспорт
	
	ОшибочныеКоды = Новый Соответствие();
	КодыМаркировки = ШтрихкодированиеИСМП.НоваяТаблицаПоискаКодаМаркировкиВПуле();
	Для Каждого КлючИЗначение Из Коллекция Цикл
		ШтрихкодированиеИСМП.ДобавитьКодМаркировкиВТаблицуДляПоискаВПуле(
			КлючИЗначение.Ключ,
			КодыМаркировки);
		ОшибочныеКоды.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	ПараметрыНормализацииКМ = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПараметрыНормализацииКодаМаркировки();
	ПараметрыНормализацииКМ.ВключатьМРЦ = Истина;
	
	КодыМаркировкиВПуле = ШтрихкодированиеИСМП.РезультатПоискаВПулеКодовМаркировки(
		КодыМаркировки,
		"ПолныйКодМаркировки");
		
	Для Каждого СтрокаТаблицы Из КодыМаркировкиВПуле Цикл
		
		ПолныйКодМаркировки = ШтрихкодированиеИСКлиентСервер.Base64ВШтрихкод(СтрокаТаблицы.ПолныйКодМаркировки);
		
		СтрокаДанных = Коллекция.Получить(СтрокаТаблицы.КодМаркировки);
		ДанныеРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(
			ПолныйКодМаркировки,
			СтрокаДанных.ВидПродукции);
			
		Если ДанныеРазбора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеРазбора.ТипШтрихкода = Перечисления.ТипыШтрихкодов.DataMatrix Тогда
			СтрокаДанных.Штрихкод = ПолныйКодМаркировки;
		Иначе
			СтрокаДанных.Штрихкод = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
				ДанныеРазбора, СтрокаДанных.ВидПродукции, ПараметрыНормализацииКМ);
		КонецЕсли;
		
		СтрокаДанных.ПолныйКодУстановлен = Истина;
		
		ОшибочныеКоды.Удалить(СтрокаТаблицы.КодМаркировки);
		
	КонецЦикла;
	
	Возврат ОшибочныеКоды;
	
КонецФункции

Функция НормализованныйШтрихкод(Штрихкод, ВидПродукции, КэшДанныхРазбора = Неопределено) Экспорт
	
	НормализованныйШтрихкод = "";
	
	Если КэшДанныхРазбора = Неопределено Тогда
		ПримечаниеКРезультатуРазбора = Неопределено;
		ДанныеРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(Штрихкод, ВидПродукции, ПримечаниеКРезультатуРазбора);
	Иначе
		ДанныеРазбораИРезультат = КэшДанныхРазбора[Штрихкод];
		Если ДанныеРазбораИРезультат <> Неопределено Тогда
			ПримечаниеКРезультатуРазбора = ДанныеРазбораИРезультат.ПримечаниеКРазборуШтрихкода;
			ДанныеРазбора                = ДанныеРазбораИРезультат.ДанныеРазбора;
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеРазбора = Неопределено Тогда
		Возврат Штрихкод;
	КонецЕсли;
	
	Если ДанныеРазбора.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская
		Или ШтрихкодированиеИСКлиентСервер.ВозможнаГрупповаяУпаковка(ДанныеРазбора.ВидУпаковки, ДанныеРазбора) Тогда
		
		ПараметрыНормализацииКМ = РазборКодаМаркировкиИССлужебныйКлиентСервер.НастройкиРазбораКодаМаркировкиДляХэшаНормализации();
		НормализованныйШтрихкод = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
			ДанныеРазбора, ВидПродукции, ПараметрыНормализацииКМ);
		
	ИначеЕсли ДанныеРазбора.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Логистическая") Тогда
		НормализованныйШтрихкод = Штрихкод;
	Иначе
		НормализованныйШтрихкод = ДанныеРазбора.НормализованныйКодМаркировки;
	КонецЕсли;
	
	Возврат НормализованныйШтрихкод;
	
КонецФункции

Процедура ПривестиСтрокиКоллекцииПоУчетуМРЦ(ДанныеКодовМаркировки, Кэш, ВключенУчетМРЦ)
	
	Для Каждого СтрокаКоллекции Из ДанныеКодовМаркировки Цикл
		
		Если ТипЗнч(СтрокаКоллекции) = Тип("СтрокаДереваЗначений") Тогда
			ПривестиСтрокиКоллекцииПоУчетуМРЦ(СтрокаКоллекции.Строки, Кэш, ВключенУчетМРЦ)
		КонецЕсли;
		
		Если СтрокаКоллекции.ВидПродукции = Перечисления.ВидыПродукцииИС.Табак
			И ВключенУчетМРЦ
			И ЗначениеЗаполнено(СтрокаКоллекции.МРЦ)
			И Не УчитыватьМРЦПоСтрокеКоллекции(СтрокаКоллекции, Кэш) Тогда
			СтрокаКоллекции.МРЦ = 0;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РасчетКоэффициентовПоСтатистике(ДеревоУпаковок, УточнениеКоэффициентовУпаковок, ПараметрыСканирования) Экспорт
	
	ДоляКоличестваОтклонений = 10; // допускается <= 10% упаковок с отклонением по количеству
	СодержитСерыеКоды        = Новый Соответствие();
	
	ДанныеДляОбработки = Новый ТаблицаЗначений();
	ДанныеДляОбработки.Колонки.Добавить("GTIN",           Метаданные.ОпределяемыеТипы.GTIN.Тип);
	ДанныеДляОбработки.Колонки.Добавить("ВидУпаковки",    Новый ОписаниеТипов("ПеречислениеСсылка.ВидыУпаковокИС"));
	ДанныеДляОбработки.Колонки.Добавить("ИсходныеДанные", Неопределено);
	ДанныеДляОбработки.Колонки.Добавить("СтрокиДерева",   Неопределено);
	
	ДанныеДляОбработки.Индексы.Добавить("GTIN,ВидУпаковки");
	
	Для Каждого СтрокаУточнения Из УточнениеКоэффициентовУпаковок Цикл
		
		НоваяСтрока = ДанныеДляОбработки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУточнения);
		
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("GTIN",              СтрокаУточнения.GTIN);
		СтруктураПоиска.Вставить("ВидУпаковки",       СтрокаУточнения.ВидУпаковки);
		
		НоваяСтрока.ИсходныеДанные = СтрокаУточнения;
		НоваяСтрока.СтрокиДерева   = ДеревоУпаковок.Строки.НайтиСтроки(СтруктураПоиска, Истина);
		
	КонецЦикла;
	
	Если ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП
		И Не ПараметрыСканирования.ПроверятьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодовМОТП Тогда
		
		МассивСтрокДляПроверкиСеройЗоны = Новый Массив();
		
		Для Каждого СтрокаДанных Из ДанныеДляОбработки Цикл
			
			Для Каждого СтрокаДерева Из СтрокаДанных.СтрокиДерева Цикл
				МассивСтрокДляПроверкиСеройЗоны.Добавить(СтрокаДерева);
			КонецЦикла;
		
		КонецЦикла;
		
		Если МассивСтрокДляПроверкиСеройЗоны.Количество() Тогда
			
			РезультатПроверки = ИнтерфейсМОТП.ПроверитьСеруюЗонуКодовМаркировки(МассивСтрокДляПроверкиСеройЗоны);
			Если РезультатПроверки.СостояниеСеройЗоны <> Неопределено Тогда
				
				Для Каждого СтрокаДерева Из МассивСтрокДляПроверкиСеройЗоны Цикл
					
					СостояниеСеройЗоны = РезультатПроверки.СостояниеСеройЗоны[СтрокаДерева];
					
					Если СостояниеСеройЗоны = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					Если СостояниеСеройЗоны.СодержитСерыеКоды Тогда
						СодержитСерыеКоды.Вставить(СтрокаДерева, СостояниеСеройЗоны);
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого СтрокаДанных Из ДанныеДляОбработки Цикл
		
		ТаблицаРасчетаКоэффициентов = Новый ТаблицаЗначений;
		ТаблицаРасчетаКоэффициентов.Колонки.Добавить("Количество",         ОбщегоНазначения.ОписаниеТипаЧисло(10));
		ТаблицаРасчетаКоэффициентов.Колонки.Добавить("КоличествоУпаковок", ОбщегоНазначения.ОписаниеТипаЧисло(10));
		
		Для Каждого СтрокаДерева Из СтрокаДанных.СтрокиДерева Цикл
			
			Если СтрокаДерева.СодержитСерыеКоды
				Или СодержитСерыеКоды.Получить(СтрокаДерева) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока                    = ТаблицаРасчетаКоэффициентов.Добавить();
			НоваяСтрока.Количество         = СтрокаДерева.КоличествоПачек;
			НоваяСтрока.КоличествоУпаковок = 1;
			
		КонецЦикла;
		
		ТаблицаРасчетаКоэффициентов.Свернуть("Количество", "КоличествоУпаковок");
		ВсегоУпаковок = ТаблицаРасчетаКоэффициентов.Итог("КоличествоУпаковок");
		
		Для Каждого СтрокаТаблицы Из ТаблицаРасчетаКоэффициентов Цикл
			Если (СтрокаТаблицы.КоличествоУпаковок / ВсегоУпаковок * 100) >= (100 - ДоляКоличестваОтклонений) Тогда
				СтрокаДанных.ИсходныеДанные.Коэффициент = СтрокаТаблицы.Количество;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьВидУпаковкиПоДаннымУПД(ДанныеКодовМаркировки, ПараметрыСканирования, ДанныеНоменклатурыПоДаннымУПД = Неопределено) Экспорт
	
	Если ПараметрыСканирования.ДопустимыеВидыПродукции.Найти(Перечисления.ВидыПродукцииИС.АльтернативныйТабак) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаОбъект = ПараметрыСканирования.СсылкаНаОбъект;
	Если Не (ЗначениеЗаполнено(СсылкаНаОбъект) И ПроверкаИПодборПродукцииИСМПКлиентСервер.ЭтоДокументПриобретения(СсылкаНаОбъект)) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныйДокумент = ОбменСКонтрагентами.СтатусДокументооборота(СсылкаНаОбъект).ЭлектронныйДокумент;
	
	Если Не ЗначениеЗаполнено(ЭлектронныйДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиБезВидаУпаковки = Новый Массив;
	Для Каждого СтрокаДанных Из ДанныеКодовМаркировки Цикл
		Если ЗначениеЗаполнено(СтрокаДанных.ВидУпаковки) Тогда
			Продолжить;
		ИначеЕсли ЗначениеЗаполнено(СтрокаДанных.ВидПродукции) И СтрокаДанных.ВидПродукции <> Перечисления.ВидыПродукцииИС.АльтернативныйТабак Тогда
			Продолжить;
		ИначеЕсли СтрокаДанных.ДанныеРазбора = Неопределено
			Или СтрокаДанных.ДанныеРазбора.ВидыПродукции.Найти(Перечисления.ВидыПродукцииИС.АльтернативныйТабак) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрокиБезВидаУпаковки.Добавить(СтрокаДанных);
	КонецЦикла;
	
	Если СтрокиБезВидаУпаковки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеНоменклатурыПоДаннымУПД = ШтрихкодированиеИСМПСлужебный.ДанныеМаркируемойНоменклатурыПоДаннымУПД(ПараметрыСканирования.СсылкаНаОбъект, ЭлектронныйДокумент);
	Если ДанныеНоменклатурыПоДаннымУПД.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ШтрихкодыУпаковок = Новый Массив;
	Для Каждого КлючЗначение Из ДанныеНоменклатурыПоДаннымУПД Цикл
		ШтрихкодыУпаковок.Добавить(КлючЗначение.Ключ);
	КонецЦикла;
	
	Для Каждого ШтрихкодУпаковки Из ШтрихкодыУпаковок Цикл
		ДанныеРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(ШтрихкодУпаковки, ПараметрыСканирования.ДопустимыеВидыПродукции);
		Если ДанныеРазбора = Неопределено Или ШтрихкодУпаковки = ДанныеРазбора.НормализованныйКодМаркировки Тогда
			Продолжить;
		КонецЕсли;
		ДанныеНоменклатурыПоДаннымУПД[ДанныеРазбора.НормализованныйКодМаркировки] = ДанныеНоменклатурыПоДаннымУПД[ШтрихкодУпаковки];
	КонецЦикла;
	
	Для Каждого СтрокаДанных Из СтрокиБезВидаУпаковки Цикл
		
		ДанныеПоУПД = ДанныеНоменклатурыПоДаннымУПД.Получить(СтрокаДанных.Штрихкод);
		Если ДанныеПоУПД = Неопределено Или Не ЗначениеЗаполнено(ДанныеПоУПД.ВидУпаковки) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не РазборКодаМаркировкиИССлужебныйКлиентСервер.ВидУпаковкиСоответствуетРазбору(
			СтрокаДанных.ВидПродукции, ДанныеПоУПД.ВидУпаковки, СтрокаДанных.ДанныеРазбора, Истина) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДанных.ВидУпаковки               = ДанныеПоУПД.ВидУпаковки;
		СтрокаДанных.ДанныеРазбора.ВидУпаковки = ДанныеПоУПД.ВидУпаковки;
		
		Если СтрокаДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
			СтрокаДанных.ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
		ИначеЕсли СтрокаДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
			СтрокаДанных.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар;
		КонецЕсли;
		
		РассчитатьХэшСуммуНормализации(СтрокаДанных, СтрокаДанных.ДанныеРазбора);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОписаниеТиповКолонкиСтатус() Экспорт
	
	ТипыЗначенийКолонкиСтатус = Новый Массив();
	ТипыЗначенийКолонкиСтатус.Добавить(Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыКодовМаркировкиМОТП"));
	ТипыЗначенийКолонкиСтатус.Добавить(Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыКодовМаркировкиИСМП"));
	
	Возврат Новый ОписаниеТипов(ТипыЗначенийКолонкиСтатус);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает текст ошибки о запрещении запрашивать данные по неизвестным кодам в МОТП.
// 
// Возвращаемое значение:
//  Строка - Текст ошибки.
Функция ТекстОшибкиЗапрещеноЗапрашиватьДанныеВМОТП()
	
	Возврат НСтр("ru = 'Запрещено запрашивать данные по неизвестным штрихкодам в МОТП.'");
	
КонецФункции

// Дополняет данные по штрихкодам спецификой, исключая информацию МОТП.
//
// Параметры:
//  ДанныеПоШтрихкодам - (См. ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам).
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
Процедура ДополнитьДанныеПоШтрихкодамСпецификойБезЗапросаСтатусовМОТП(ДанныеПоШтрихкодам, ПараметрыСканирования)
	
	СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок = Новый Соответствие;
	
	СтрокиТаблицыДанныхДляПолученияСпецифики = СтрокиТаблицыДанныхДляПолученияСпецифики(
		ДанныеПоШтрихкодам.ДанныеКодовМаркировки,
		СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок,
		ПараметрыСканирования);
	
	Если СтрокиТаблицыДанныхДляПолученияСпецифики.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДеревоУпаковок = Неопределено;
	
	Если ДанныеПоШтрихкодам.Свойство("ВложенныеШтрихкоды")
		И ЗначениеЗаполнено(ДанныеПоШтрихкодам.ВложенныеШтрихкоды) Тогда
		
		ДеревоУпаковок = ДанныеПоШтрихкодам.ВложенныеШтрихкоды.ДеревоУпаковок;
		
		Если ДанныеПоШтрихкодам.ВложенныеШтрихкоды.Свойство("МаркированныеТовары") Тогда
			МаркированныеТовары = ДанныеПоШтрихкодам.ВложенныеШтрихкоды.МаркированныеТовары;
		Иначе
			МаркированныеТовары = ДанныеПоШтрихкодам.ДанныеКодовМаркировки;
		КонецЕсли;
		
		Для Каждого Строка Из МаркированныеТовары Цикл
			Строка.КоличествоПачек = Строка.СтрокаДерева.КоличествоПачек;
		КонецЦикла;
		
	КонецЕсли;
	
	ПараметрыДерева = ИнтерфейсМОТП.ПараметрыПостроенияДерева(ПараметрыСканирования);
	
	Для Каждого СтрокаДанных Из СтрокиТаблицыДанныхДляПолученияСпецифики Цикл
		
		Если ДеревоУпаковок <> Неопределено Тогда
			ДанныеСтроки = ДеревоУпаковок.Строки.Найти(СтрокаДанных.НормализованныйШтрихкод, "НормализованныйШтрихкод");
		Иначе
			ДанныеСтроки = Неопределено;
		КонецЕсли;
			
		Если ДанныеСтроки <> Неопределено Тогда
			СтрокаДанных.КоличествоПачек  = ДанныеСтроки.КоличествоПачек;
			СтрокаДанных.КоличествоБлоков = ДанныеСтроки.КоличествоБлоков;
		Иначе
			СтрокаДанных.КоличествоПачек  = 1;
			СтрокаДанных.КоличествоБлоков = 0;
			Если ПараметрыДерева.УчитыватьМРЦ
				И СтрокаДанных.СоставКодаМаркировки <> Неопределено Тогда
				СтрокаДанных.СоставКодаМаркировки.Свойство("МРЦ", СтрокаДанных.МРЦ);
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаДанных.СоставКодаМаркировки <> Неопределено
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДанных.СоставКодаМаркировки, "GTIN") Тогда
			СтрокаДанных.СоставКодаМаркировки.Свойство("GTIN", СтрокаДанных.GTIN);
		КонецЕсли;
		
		Если ШтрихкодированиеИСМПСлужебный.СтруктураДанныхТребуетЗагрузкиВложенныхКодовМаркировки(
			СтрокаДанных, ПараметрыСканирования) Тогда
			СтрокаДанных.Идентифицирован = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Дополняет данные по штрихкодам спецификой по данным пула.
//
// Параметры:
//  ДанныеПоШтрихкодам    - (См. ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам).
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
Процедура ДополнитьДанныеПоШтрихкодамДаннымиПулаКодовМаркировки(ДанныеПоШтрихкодам, ПараметрыСканирования)
	
	Если Не ПараметрыСканирования.СохранятьКодыМаркировкиВПулИСМП Тогда
		Возврат;
	КонецЕсли;
	
	КодыМаркировки = ШтрихкодированиеИСМП.НоваяТаблицаПоискаКодаМаркировкивПуле();
	
	СтрокиТаблицыПоКодамМаркировки = Новый Соответствие;
	
	Для Каждого СтрокаДанных Из ДанныеПоШтрихкодам.ДанныеКодовМаркировки Цикл
		
		Если СтрокаДанных.ОбработанСОшибками Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДанных.ВидУпаковки <> Перечисления.ВидыУпаковокИС.Потребительская Тогда
			Продолжить;
		КонецЕсли;
		
		ШтрихкодированиеИСМП.ДобавитьКодМаркировкиВТаблицуДляПоискаВПуле(
			СтрокаДанных,
			КодыМаркировки);
		
		СтрокиТаблицыПоКодамМаркировки.Вставить(СтрокаДанных.Штрихкод, СтрокаДанных);
		
	КонецЦикла;
	
	Если КодыМаркировки.Количество() > 0 Тогда
		
		КодыМаркировкиВПуле = ШтрихкодированиеИСМП.РезультатПоискаВПулеКодовМаркировки(КодыМаркировки, "ВидПродукции");
		
		Для Каждого СтрокаТаблицы Из КодыМаркировкиВПуле Цикл
			
			СтрокаДанных                          = СтрокиТаблицыПоКодамМаркировки.Получить(СтрокаТаблицы.КодМаркировки);
			СтрокаДанных.ЕстьВПулеКодовМаркировки = Истина;
			
			Если Не ЗначениеЗаполнено(СтрокаДанных.ВидПродукции) Тогда
				СтрокаДанных.ВидПродукции = СтрокаТаблицы.ВидПродукции;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Получение специфичных данных, используемых только для табачной продукции
// 
// Параметры:
//  ШтрихкодыДляПолученияСпецифики - Массив - Коды маркировок.
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
// Возвращаемое значение:
//  Структура - Описание:
//   * СпецификаШтрихкодов - Неопределено, соответствие - Ключ - код маркировки, значение - данные, полученные из МОТП.
//   * ЕстьОшибки - Булево - Истина, если при попытке получения данных из МОТП возникла ошибка.
//   * ТекстОшибки - Строка - Описание ошибки.
Функция СпецификаДляДополненияДанныхПоШтрихкодам(СтрокиТаблицыДанныхДляПолученияСпецифики, ПараметрыСканирования)
	
	Результат = Новый Структура;
	Результат.Вставить("СпецификаШтрихкодов",            Неопределено);
	Результат.Вставить("ЕстьОшибки",                     Ложь);
	Результат.Вставить("ТекстОшибки",                    "");
	Результат.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	
	ДанныеПоШтрихкодамМОТП = ИнтерфейсМОТП.ЗапроситьСтатусыКодовМаркировки(
		СтрокиТаблицыДанныхДляПолученияСпецифики, ПараметрыСканирования.Организация);
	
	Если ДанныеПоШтрихкодамМОТП.ТребуетсяОбновлениеКлючаСессии Тогда
		Результат.ЕстьОшибки  = Истина;
		Результат.ТекстОшибки = НСтр("ru = 'Не удалось получить данные из ИС МП.
		                                   |По причине: Требуется обновление ключа сессии.'");
		Результат.ТребуетсяОбновлениеКлючаСессии = Истина;
		
		Возврат Результат;
	ИначеЕсли ЗначениеЗаполнено(ДанныеПоШтрихкодамМОТП.ТекстОшибки) Тогда
		Результат.ЕстьОшибки  = Истина;
		Результат.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось получить данные из ИС МОТП.
			           |По причине: %1'"), ДанныеПоШтрихкодамМОТП.ТекстОшибки);
		
		Возврат Результат;
	КонецЕсли;
	
	Результат.СпецификаШтрихкодов = ДанныеПоШтрихкодамМОТП.СтатусыКодовМаркировки;
	
	Возврат Результат;
	
КонецФункции

// Удаляет строки дерева упаковок по массиву удаляемых строк. Удаление происходит путем копирования структуры дерева и
// его заполнения, исключая удаляемые строки.
//
// Параметры:
//  ДеревоУпаковок - ДеревоЗначений - Дерево упаковок. Будет заменено.
//  МассивУдаляемыхСтрок - Массив - Строки, дерева упаковок, которые нужно удалить.
//  МаркированныеТовары - ТаблицаЗначений - Таблица связанных с деревом вложенных упаковок. Будет заменена.
//  ДанныеКодовМаркировки - ТаблицаЗначений - Таблица связанных с деревом внешних упаковок. Будет обновлена.
Процедура УдалитьСтрокиДереваУпаковокПоДетализации(ДеревоУпаковок, МассивУдаляемыхСтрок, МаркированныеТовары, ДанныеКодовМаркировки)
	
	ДеревоУпаковокПриемник = Новый ДеревоЗначений;
	Для Каждого Колонка Из ДеревоУпаковок.Колонки Цикл
		ДеревоУпаковокПриемник.Колонки.Добавить(Колонка.Имя);
	КонецЦикла;

	СоответствиеСтрокИсточникаПриемника = Новый Соответствие;
	СкопироватьСтрокиДереваСУчетомИсключаемыхСтрок(
		ДеревоУпаковокПриемник.Строки, ДеревоУпаковок.Строки, МассивУдаляемыхСтрок,
		СоответствиеСтрокИсточникаПриемника, Неопределено);
	
	Если МаркированныеТовары <> Неопределено Тогда
		
		МаркированныеТоварыПриемник = МаркированныеТовары.СкопироватьКолонки();
		Для Каждого СтрокаТЧ Из МаркированныеТовары Цикл

			СсылкаНаСтрокуДерева = СоответствиеСтрокИсточникаПриемника.Получить(СтрокаТЧ.СтрокаДерева);
			Если СсылкаНаСтрокуДерева <> Неопределено Тогда
				НоваяСтрокаПриемник = МаркированныеТоварыПриемник.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаПриемник, СтрокаТЧ);
				НоваяСтрокаПриемник.СтрокаДерева = СсылкаНаСтрокуДерева;
				НоваяСтрокаПриемник.УпаковкаВерхнегоУровня = Неопределено;
			КонецЕсли;

		КонецЦикла;

		МаркированныеТовары = МаркированныеТоварыПриемник;

	КонецЕсли;
	
	Если ДанныеКодовМаркировки <> Неопределено Тогда

		Для Каждого СтрокаТЧ Из ДанныеКодовМаркировки Цикл
			СсылкаНаСтрокуДерева = СоответствиеСтрокИсточникаПриемника.Получить(СтрокаТЧ.СтрокаДерева);
			СтрокаТЧ.СтрокаДерева = СсылкаНаСтрокуДерева;
		КонецЦикла;

		// Определение вида продукции для удаляемых строк.
		// Вид продукции в дереве рассчитан по иерархии, если строка дерева удаляется,
		// то в некоторых сценариях становится невозможным определить вид продукции в данных штрихкодов.
		ПараметрыОтбора = Новый Структура("НормализованныйШтрихкод");
		Для Каждого СтрокаДерева Из МассивУдаляемыхСтрок Цикл
			ПараметрыОтбора.НормализованныйШтрихкод = СтрокаДерева.НормализованныйШтрихкод;
			НайденныеСтроки = ДанныеКодовМаркировки.НайтиСтроки(ПараметрыОтбора);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Если Не ЗначениеЗаполнено(НайденнаяСтрока.ВидПродукции) Тогда
					НайденнаяСтрока.ВидПродукции = СтрокаДерева.ВидПродукции;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;

	КонецЕсли;
	
	ДеревоУпаковок = ДеревоУпаковокПриемник;
	
КонецПроцедуры

// Производит копирование значений строк дерева источника в строки дерева приемника, исключая строки, входящие в
// массив удаляемых строк.
//
// Параметры:
//  СтрокиПриемника - КоллекцияСтрокДереваЗначений - Строки дерева значений приемника.
//  СтрокиИсточника - КоллекцияСтрокДереваЗначений - Строки дерева значений источника.
//  МассивУдаляемыхСтрок - Массив из СтрокаДереваЗначений - Строки дерева, которые должны быть удалены.
//  СоответствиеСтрокИсточникаПриемника - Соответствие - Строки дерева значений источника.
//  ВерхнийУровень - СтрокаДереваЗначений - Верхняя строка иерархии.
Процедура СкопироватьСтрокиДереваСУчетомИсключаемыхСтрок(СтрокиПриемника, СтрокиИсточника, МассивУдаляемыхСтрок,
														СоответствиеСтрокИсточникаПриемника, ВерхнийУровень)
	
	Для Каждого СтрокаИсточника Из СтрокиИсточника Цикл
		
		Если МассивУдаляемыхСтрок.Найти(СтрокаИсточника) = Неопределено Тогда
			СтрокаПриемника = СтрокиПриемника.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПриемника, СтрокаИсточника);
			СоответствиеСтрокИсточникаПриемника.Вставить(СтрокаИсточника, СтрокаПриемника);
			
			Если Не ЗначениеЗаполнено(ВерхнийУровень) Тогда
				ВерхнийУровень = СтрокаИсточника;
			КонецЕсли;
			
			СкопироватьСтрокиДереваСУчетомИсключаемыхСтрок(
				СтрокаПриемника.Строки, СтрокаИсточника.Строки, МассивУдаляемыхСтрок, СоответствиеСтрокИсточникаПриемника, ВерхнийУровень);
				
		Иначе
			
			СкопироватьСтрокиДереваСУчетомИсключаемыхСтрок(
				СтрокиПриемника, СтрокаИсточника.Строки, МассивУдаляемыхСтрок, СоответствиеСтрокИсточникаПриемника, ВерхнийУровень);
				
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Определяет строки дерева, которые необходимо удалить с соответствие с детализацией.
//
// Параметры:
//  СтрокиДерева - КоллекцияСтрокДереваЗначений - Строки дерева упаковок.
//  ПравилоДетализации - Структура - правило, в соответствие которому требуется удалить строки.
//  МассивУдаляемыхСтрок - Массив - Коллекция строк дерева, которые должны быть удалены.
//  из маркированных товаров.
Процедура ОпределитьУдаляемыеСтрокиДереваПоДетализации(СтрокиДерева, Детализация, МассивУдаляемыхСтрок, МаркированныеТовары, ДанныеКодовМаркировки)
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
			Или СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда // Логистическая упаковка или блок
			
			Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая
				И (Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками
					Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами
					Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковки) Тогда
				
				Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл
					УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(ВложеннаяСтрокаДерева, МаркированныеТовары);
					УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(ВложеннаяСтрокаДерева, ДанныеКодовМаркировки);
				КонецЦикла;
				
				СтрокаДерева.Строки.Очистить();
				Продолжить;
				
			КонецЕсли;
			
			Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
				И Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами Тогда
				
				GTIN = СтрокаДерева.GTIN;
				
				Если ЗначениеЗаполнено(GTIN) Тогда
					
					Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл
						УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(ВложеннаяСтрокаДерева, МаркированныеТовары);
						УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(ВложеннаяСтрокаДерева, ДанныеКодовМаркировки);
					КонецЦикла;
					
					СтрокаДерева.Строки.Очистить();
					Продолжить;

				КонецЕсли;
				
			КонецЕсли;
			
			GTINКоробаВерхнегоУровня = "";
			Если СтрокаДерева.Родитель.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
				GTINКоробаВерхнегоУровня = СтрокаДерева.Родитель.GTIN;
			КонецЕсли;
			
			ПропуститьУпаковку =
				// В детализации Пачки - пропускаются все упаковки
				(Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки)
				// В детализации Блоки с пачками - пропускаются все упаковки кроме блоков
				Или (Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими
					И СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая)
				// В детализации Групповые упаковки - пропускаются все упаковки кроме блоков
				Или (Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковки
					И СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая)
				Или (Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами
					И Не ПустаяСтрока(GTINКоробаВерхнегоУровня));
			
			Если ПропуститьУпаковку Тогда
				МассивУдаляемыхСтрок.Добавить(СтрокаДерева);
			КонецЕсли;
			
			ОпределитьУдаляемыеСтрокиДереваПоДетализации(
				СтрокаДерева.Строки, Детализация, МассивУдаляемыхСтрок,
				МаркированныеТовары, ДанныеКодовМаркировки);
			
		Иначе
			
			Если Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами
				Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками Тогда
				Если СтрокиДерева.Родитель.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
					ДобавлятьПачку = Истина;
				Иначе
					ДобавлятьПачку = Ложь;
				КонецЕсли;
			Иначе
				// Детализация: Полная, Пачки, Блоки с пачками
				ДобавлятьПачку = Истина;
			КонецЕсли;
			
			Если Не ДобавлятьПачку Тогда
				МассивУдаляемыхСтрок.Добавить(СтрокаДерева);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует правила детализации.
//
// Параметры:
// Возвращаемое значение:
//  Соответствие - Ключ - ПеречислениеСсылка.ДетализацияСтруктурыХраненияИС, значение - свойство
//      правила. (См. ШтрихкодированиеМОТП.СвойствоПравилаДетализации).
Функция ПравилаДетализацииДереваУпаковок()
	
	ПравилаДетализации = Новый Соответствие;
	
	ДетализацияБлокиСПачками = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими;
	ДетализацияКоробки       = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами;
	ДетализацияКоробкиИБлоки = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками;
	ДетализацияПолная        = Перечисления.ДетализацияСтруктурыХраненияИС.Полная;
	ДетализацияПачки         = Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки;
	
	ПравилаДетализации.Вставить(ДетализацияПолная,        СвойствоПравилаДетализации(Истина, Истина, Истина));
	ПравилаДетализации.Вставить(ДетализацияКоробки,       СвойствоПравилаДетализации(Истина, Ложь,   Ложь));
	ПравилаДетализации.Вставить(ДетализацияКоробкиИБлоки, СвойствоПравилаДетализации(Истина, Истина, Ложь));
	ПравилаДетализации.Вставить(ДетализацияБлокиСПачками, СвойствоПравилаДетализации(Ложь,   Истина, Истина));
	ПравилаДетализации.Вставить(ДетализацияПачки,         СвойствоПравилаДетализации(Ложь,   Ложь,   Истина));
	
	Возврат ПравилаДетализации;
	
КонецФункции

// Формирует свойство правила детализации.
//
// Параметры:
//  РазрешеныКоробки - Булево - Истина, в дереве разрешено показывать упаковки.
//  РазрешеныБлоки - Булево - Истина, в дереве разрешено показывать табачные блоки.
//  РазрешеныПачки - Булево - Истина, в дереве разрешено показывать пачки.
// Возвращаемое значение:
//  Структура - Описание:
// * РазрешеныКоробки - Булево - Истина, в дереве разрешено показывать упаковки.
// * РазрешеныБлоки - Булево - Истина, в дереве разрешено показывать табачные блоки.
// * РазрешеныПачки - Булево - Истина, в дереве разрешено показывать пачки.
Функция СвойствоПравилаДетализации(РазрешеныКоробки, РазрешеныБлоки, РазрешеныПачки)
	
	Возврат Новый Структура("РазрешеныКоробки, РазрешеныБлоки, РазрешеныПачки",
							РазрешеныКоробки, РазрешеныБлоки, РазрешеныПачки);
	
КонецФункции

// Выполняет дополнение дерева упаковок и маркированных товаров, информация по которым была получена из МОТП.
//
// Параметры:
//  ВложенныеШтрихкоды - Структура - Описание:
// * ШтрихкодыПродукцииДляСопоставления - Массив - коллекция штрихкодов EAN, которые необходимо идентифицировать.
// * ВидыПродукции - Массив из ПеречислениеСсылка.ВидыПродукцииИС - виды продукции, присутствующие в дереве упаковок.
// * МаркированныеТовары - ТаблицаЗначений - Таблица с маркированной продукцией.
// * ДеревоУпаковок - ДеревоЗначений - Дерево упаковок, построенное в соответствие с хранением в справочнике ШтрихкодыУпаковок.
//  ТаблицаEAN - Неопределено, ТаблицаЗначений - Описание:
// * GTIN - Строка - штрихкод GTIN.
// * МРЦ - Число - максимальная розничная цена.
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
Процедура ОбработатьДеревоПолученноеИзМОТП(Результат, ДанныеПоШтрихкодам, ПараметрыСканирования, ОтключитьОтборПоВидуПродукции = Истина) Экспорт
	
	Если ПараметрыСканирования <> Неопределено
		И (ПараметрыСканирования.ОтборПоВидуПродукции И Не ОтключитьОтборПоВидуПродукции)
		И ПараметрыСканирования.ДопустимыеВидыПродукции.Количество() = 1 Тогда
		ШтрихкодированиеИС.ОтобратьСтрокиДереваИСМППоВидуПродукции(
			Результат.ДеревоУпаковок,
			ПараметрыСканирования.ДопустимыеВидыПродукции[0]);
	КонецЕсли;
	
	ТаблицаGTIN = Результат.GTIN;
	ТаблицаGTIN.Свернуть("GTIN");
	
	// Если сканирование выполняется в форме проверки и подбора, то заполнение таблицы маркированных товаров не требуется
	ИнициализироватьМаркированныеТовары = Не ПараметрыСканирования.ИспользуетсяСоответствиеШтрихкодовСтрокДерева;
	
	ВложенныеШтрихкоды = ИнициализацияВложенныхШтрихкодов(
		Результат.ДеревоУпаковок, ИнициализироватьМаркированныеТовары);
	НормализоватьДанныеДереваУпаковок(
		ВложенныеШтрихкоды.ДеревоУпаковок, ПараметрыСканирования);
	
	ДополнительныеКолонки = Новый Структура;
	ПараметрыДерева = ИнтерфейсМОТП.ПараметрыПостроенияДерева(ПараметрыСканирования);
	ШтрихкодированиеМОТП.КоллекцияДополнительныхКолонокДереваУпаковокМОТП(ПараметрыДерева, ДополнительныеКолонки);
	Если ПараметрыСканирования.ЭтоПроверкаКодовМаркировкиИСМП Тогда
		ШтрихкодированиеМОТП.КоллекцияДополнительныхКолонокДереваУпаковокДляФормыПроверкиКодовМаркировки(ДополнительныеКолонки);
	КонецЕсли;
	ИменаКолонокДляКопированияСвойств = Новый Массив;
	Для Каждого КлючИЗначение Из ДополнительныеКолонки Цикл
		ИменаКолонокДляКопированияСвойств.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	ДобавленныеСтроки = Новый Массив;
	ШтрихкодированиеИС.ДополнитьТаблицуДанныеКодовМаркировкиПоСтрокамДереваУпаковок(
		ДанныеПоШтрихкодам.ДанныеКодовМаркировки, ВложенныеШтрихкоды.ДеревоУпаковок,
		ДобавленныеСтроки, ПараметрыСканирования, ИменаКолонокДляКопированияСвойств);
	// Если форма проверки и подбора загружается по данным сервиса из
	// документа приемки или поступления товаров - то нужно поискать сопоставленные товары в штрихкодах упаковок
	ШтрихкодированиеИС.ЗаполнитьДанныеИзвестнойМаркируемойПродукции(ДанныеПоШтрихкодам, ДобавленныеСтроки, ПараметрыСканирования);
	ШтрихкодированиеИС.ЗаполнитьСведенияПоШтрихкодамEAN(ДобавленныеСтроки, ПараметрыСканирования);
	
	ШтрихкодированиеИСМПСлужебный.ЗаполнитьПредставлениеНоменклатурыОстаточныхШтрихкодов(
		ДанныеПоШтрихкодам.ДанныеКодовМаркировки, ПараметрыСканирования);
	
	ТребуетсяСопоставление                 = Ложь;
	МассивНеизвестныхEAN                   = Новый Массив;
	СтрокиДанныхДляЗаполненияПредставления = Новый Массив;
	Для Каждого СтрокаДанных Из ДобавленныеСтроки Цикл
		
		Если СтрокаДанных.ТребуетсяСопоставление Тогда
			ТребуетсяСопоставление = Истина;
		КонецЕсли;
		
		Если СтрокаДанных.ТребуетсяСопоставление
			И Не ЗначениеЗаполнено(СтрокаДанных.ПредставлениеНоменклатуры) Тогда
			МассивНеизвестныхEAN.Добавить(СтрокаДанных.EAN);
			СтрокиДанныхДляЗаполненияПредставления.Добавить(СтрокаДанных);
		КонецЕсли;
		
	КонецЦикла;
	МассивНеизвестныхEAN = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивНеизвестныхEAN);
	
	Если ТребуетсяСопоставление И ПараметрыСканирования.СопоставлятьНоменклатуру Тогда
		
		НормализоватьДанныеВложенныхШтрихкодов(
			ВложенныеШтрихкоды, ПараметрыСканирования, ДанныеПоШтрихкодам.ДанныеКодовМаркировки);
		
		ШтрихкодированиеИС.ДобавитьВДанныеШтрихкодовВложенныеШтрихкоды(
			ДанныеПоШтрихкодам, ВложенныеШтрихкоды, ПараметрыСканирования);
		
		Возврат;
		
	КонецЕсли;
	
	ШтрихкодированиеИСМПСлужебный.ЗаполнитьДанныеКодовМаркировкиПоДаннымУПД(ДанныеПоШтрихкодам, ПараметрыСканирования);
	
	Если СтрокиДанныхДляЗаполненияПредставления.Количество() > 0 Тогда
		ЗаполнитьПредставлениеНоменклатурыПоДаннымМОТП(
			ДанныеПоШтрихкодам, СтрокиДанныхДляЗаполненияПредставления, МассивНеизвестныхEAN);
	КонецЕсли;
	
	НормализоватьДанныеДереваУпаковок(
		ВложенныеШтрихкоды.ДеревоУпаковок, ПараметрыСканирования, ДанныеПоШтрихкодам.ДанныеКодовМаркировки);
	СоздатьЭлементыШтрихкодовУпаковокПоДереву(ВложенныеШтрихкоды.ДеревоУпаковок, ПараметрыСканирования);
	
	Для Каждого ДанныеКодаМаркировки Из ДанныеПоШтрихкодам.ДанныеКодовМаркировки Цикл
		Если ДанныеКодаМаркировки.СтрокаДерева <> Неопределено Тогда
			ДанныеКодаМаркировки.ШтрихкодУпаковки = ДанныеКодаМаркировки.СтрокаДерева.ШтрихкодУпаковки;
		КонецЕсли;
	КонецЦикла;
	
	// Если сканирование выполняется в форме проверки и подбора, то заполнение таблицы маркированных товаров не требуется
	Если Не ПараметрыСканирования.ИспользуетсяСоответствиеШтрихкодовСтрокДерева Тогда
		НормализоватьДанныеТаблицыМаркированныеТовары(
			ВложенныеШтрихкоды.ДеревоУпаковок, ВложенныеШтрихкоды.МаркированныеТовары);
	КонецЕсли;
	
	ШтрихкодированиеИС.ДобавитьВДанныеШтрихкодовВложенныеШтрихкоды(
		ДанныеПоШтрихкодам, ВложенныеШтрихкоды, ПараметрыСканирования);
	
	ВидыПродукцииНоменклатуры = ДанныеПоШтрихкодам.ДанныеКодовМаркировки.ВыгрузитьКолонку("ВидПродукции");
	ДанныеПоШтрихкодам.ВидыПродукции = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВидыПродукцииНоменклатуры);
	
КонецПроцедуры

// Выполняет заполнение представления номенклатуры по данным, полученным из сервиса МОТП.
// 
// Параметры:
//  ДанныеПоШтрихкодам - См. ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам
//  ДанныеКодовМаркировки - ТаблицаЗначений, Массив из СтрокаТаблицыЗначений - Описание
//  СписокEAN - Массив из Строка - Список штрихкодов формата EAN.
Процедура ЗаполнитьПредставлениеНоменклатурыПоДаннымМОТП(ДанныеПоШтрихкодам, СтрокиДанныхДляСопоставления, СписокEAN)
	
	РезультатЗапроса = ИнтерфейсМОТП.ДанныеПродукцииПоШтрихкодуEAN(СписокEAN);
	
	Если РезультатЗапроса.ТребуетсяОбновлениеКлючаСессии Тогда
		
		ДанныеПоШтрихкодам.ТребуетсяОбновлениеКлючаСессии = РезультатЗапроса.ТребуетсяОбновлениеКлючаСессии;
		ДанныеПоШтрихкодам.ТекстОшибки                    = РезультатЗапроса.ТекстОшибки;
		ДанныеПоШтрихкодам.ЕстьОшибки                     = Истина;
		
	ИначеЕсли ЗначениеЗаполнено(РезультатЗапроса.ТекстОшибки) Тогда
		
		Для Каждого СтрокаДанных Из СтрокиДанныхДляСопоставления Цикл
			СтрокаДанных.ПредставлениеНоменклатуры = НСтр("ru = '<Не загружено>'");
		КонецЦикла;
		
	Иначе
		
		Для Каждого СтрокаДанных Из СтрокиДанныхДляСопоставления Цикл
			
			СведенияПоEAN = РезультатЗапроса.ДанныеПродукцииПоШтрихкодуEAN.Получить(СтрокаДанных.EAN);
			Если СведенияПоEAN = Неопределено Тогда
				СтрокаДанных.ПредставлениеНоменклатуры = НСтр("ru = '<Не загружено>'");
			Иначе
				СтрокаДанных.ПредставлениеНоменклатуры = СведенияПоEAN.Наименование;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует дерево упаковок на основании данных полученных из МОТП.
//
// Параметры:
//  ДеревоУпаковок - ДеревоЗначений - Дерево упаковок, построенное в соответствие с хранением в справочнике ШтрихкодыУпаковок.
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
Процедура СоздатьЭлементыШтрихкодовУпаковокПоДереву(ДеревоУпаковок, ПараметрыСканирования)
	
	Если Не ПараметрыСканирования.СоздаватьШтрихкодУпаковки Тогда
		Возврат;
	КонецЕсли;
	
	Если ДеревоУпаковок.Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из ДеревоУпаковок.Строки Цикл
		Если СтрокаДерева.Статус = Перечисления.СтатусыКодовМаркировкиМОТП.Неопределен
			Или СтрокаДерева.КоличествоПачек = 0 Тогда
			
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ДеревоУпаковок.Колонки.Добавить("СтатусПроверки");
	ДеревоУпаковок.Колонки.Добавить("КоличествоПодчиненнойПродукции", Новый ОписаниеТипов("Число"));
	
	ТаблицаШтрихкодовВерхнегоУровня = Новый ТаблицаЗначений;
	ТаблицаШтрихкодовВерхнегоУровня.Колонки.Добавить("ШтрихкодУпаковки");
	ТаблицаШтрихкодовВерхнегоУровня.Колонки.Добавить("Штрихкод");
	
	НачатьТранзакцию();
	
	Попытка
		
		Справочники.ШтрихкодыУпаковокТоваров.РезультатСозданияШтрихкодовУпаковокПоДеревуМаркируемойПродукции(
			ДеревоУпаковок, ТаблицаШтрихкодовВерхнегоУровня);
		
		ЗаполнитьУпаковкуВерхнегоУровняДерева(ДеревоУпаковок);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСобытияЖурналРегистрации = НСтр("ru = 'Создание элементов справочника штрихкоды упаковок.'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналРегистрации, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
		
		ВызватьИсключение ПодробноеПредставлениеОшибки;
		
	КонецПопытки;
	
КонецПроцедуры

// Заполняет во всех строках дерева упаковку верхнего уровня.
//
// Параметры:
//  ДеревоУпаковок - ДеревоЗначений - Дерево упаковок, построенное в соответствие с хранением в справочнике ШтрихкодыУпаковок.
//  УпаковкаВерхнегоУровня - СтрокаДереваЗначений - верхний уровень дерева.
Процедура ЗаполнитьУпаковкуВерхнегоУровняДерева(ДеревоУпаковок, УпаковкаВерхнегоУровня = Неопределено)
	
	Для Каждого СтрокаДерева Из ДеревоУпаковок.Строки Цикл
		
		Если УпаковкаВерхнегоУровня = Неопределено Тогда
			УпаковкаВерхнегоУровня = СтрокаДерева.ШтрихкодУпаковки;
		КонецЕсли;
		
		СтрокаДерева.УпаковкаВерхнегоУровня = УпаковкаВерхнегоУровня;
		ЗаполнитьУпаковкуВерхнегоУровняДерева(СтрокаДерева, УпаковкаВерхнегоУровня);
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует представление для перечисления СтатусыКодовМаркировкиМОТП.
//
// Параметры:
// Возвращаемое значение:
//  Соответствие - Ключ - ПеречислениеСсылка.СтатусыКодовМаркировкиМОТП, значение - представление статуса.
Функция ПредставленияСтатусов()
	
	ПредставленияСтатусов = Новый Соответствие();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтатусыКодовМаркировкиМОТП.Ссылка                КАК Статус,
	|	ПРЕДСТАВЛЕНИЕ(СтатусыКодовМаркировкиМОТП.Ссылка) КАК ПредставлениеСтатуса
	|ИЗ
	|	Перечисление.СтатусыКодовМаркировкиМОТП КАК СтатусыКодовМаркировкиМОТП");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПредставленияСтатусов.Вставить(Выборка.Статус, Выборка.ПредставлениеСтатуса);
	КонецЦикла;
	
	Возврат ПредставленияСтатусов;
	
КонецФункции

#Область ПроверкаНаОшибки

// Выполняет проверку на ошибки по заданным правилам.
//
// Параметры:
//  ДанныеПоШтрихкодам - (См. ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам).
//  ПравилаПроверкиНаОшибки - Структура - Описание:
//   * КонтрольСерий - Массив - Коллекция строк, где были выявлены ошибки по контролю серий.
//   * КонтрольСтатусов - Массив - Массив из Структура:
//     * СтрокиСОшибками - Массив - Коллекция строк, где были выявлены ошибки по контролю статусов.
//     * ДоступныеСтатусы - Массив - Коллекция строк, где были выявлены ошибки по контролю статусов.
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
//  ЕстьОшибки - Булево - Истина, если найдена ошибка.
Процедура ПроверитьНаОшибкиПоПравилам(ДанныеПоШтрихкодам, ПравилаПроверкиНаОшибки, ПараметрыСканирования, ЕстьОшибки)
	
	ПредставленияСтатусов = Неопределено;
	
	Если ДанныеПоШтрихкодам.ВложенныеШтрихкоды <> Неопределено Тогда
		
		ДеревоУпаковок = ДанныеПоШтрихкодам.ВложенныеШтрихкоды.ДеревоУпаковок;
		
		ПроверитьНаОшибкиСтрокиДерева(
			ДеревоУпаковок.Строки, ПравилаПроверкиНаОшибки, ПараметрыСканирования, ДанныеПоШтрихкодам, ЕстьОшибки);
		ДанныеПоШтрихкодам.ЕстьОшибкиВДеревеУпаковок = ЕстьОшибки;
		
		// Приоритет 1.
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольСтатусов")
			И ПравилаПроверкиНаОшибки.КонтрольСтатусов.СтрокиСОшибками.Количество() > 0 Тогда
			
			Если ПредставленияСтатусов = Неопределено Тогда
				ПредставленияСтатусов = ПредставленияСтатусов();
			КонецЕсли;
			
			Для Каждого СтрокаДерева Из ПравилаПроверкиНаОшибки.КонтрольСтатусов.СтрокиСОшибками Цикл
				
				Если СтрокаДерева.ЕстьОшибки Тогда
					Продолжить;
				КонецЕсли;
				
				ПредставлениеСтатуса = ПредставленияСтатусов.Получить(СтрокаДерева.Статус);
				Если ПредставлениеСтатуса = Неопределено Тогда
					ПредставлениеСтатуса = НСтр("ru='<Неопределен>'");
				КонецЕсли;
				
				СтрокаДерева.ТекстОшибки = СтрШаблон(НСтр("ru = 'Статус: %1'"), ПредставлениеСтатуса);
				СтрокаДерева.ЕстьОшибки  = Истина;
				
				ВидДополнения = ШтрихкодированиеИСМПСлужебный.ВидДополненияПредставленияОшибки();
				ВидДополнения.Статус          = СтрокаДерева.Статус;
				ВидДополнения.ВидОперацииИСМП = ПараметрыСканирования.ВидОперацииИСМП;
				ШтрихкодированиеИСМПСлужебный.ДополнитьПредставлениеОшибки(СтрокаДерева, ВидДополнения);
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Приоритет 2.
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольПустыхУпаковок")
			И ПравилаПроверкиНаОшибки.КонтрольПустыхУпаковок.Количество() > 0 Тогда
			
			Для Каждого СтрокаДерева Из ПравилаПроверкиНаОшибки.КонтрольПустыхУпаковок Цикл
				
				Если СтрокаДерева.ЕстьОшибки Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаДерева.ТекстОшибки = НСтр("ru = 'Пустая упаковка'");
				СтрокаДерева.ЕстьОшибки = Истина;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Приоритет 3.
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольВладельца")
			И ПравилаПроверкиНаОшибки.КонтрольВладельца.Количество() > 0 Тогда
			
			Для Каждого СтрокаДерева Из ПравилаПроверкиНаОшибки.КонтрольВладельца Цикл
				
				Если СтрокаДерева.ЕстьОшибки Тогда
					Продолжить;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаДерева.Владелец) Тогда
					ТекстОшибки = СтрШаблон(
						НСтр("ru = 'Владелец: %1 (%2)'"),
						СтрокаДерева.Владелец,
						СтрокаДерева.ИННВладельца);
				ИначеЕсли ЗначениеЗаполнено(СтрокаДерева.ИННВладельца) Тогда
					ТекстОшибки = СтрШаблон(
						НСтр("ru = 'ИНН владельца: %1'"),
						СтрокаДерева.ИННВладельца);
				Иначе
					ТекстОшибки = НСтр("ru = 'Владелец неопределен'");
				КонецЕсли;
				
				СтрокаДерева.ТекстОшибки = ТекстОшибки;
				СтрокаДерева.ЕстьОшибки  = Истина;
				
				ВидДополнения = ШтрихкодированиеИСМПСлужебный.ВидДополненияПредставленияОшибки();
				ВидДополнения.Владелец        = Истина;
				ВидДополнения.ВидОперацииИСМП = ПараметрыСканирования.ВидОперацииИСМП;
				ШтрихкодированиеИСМПСлужебный.ДополнитьПредставлениеОшибки(СтрокаДерева, ВидДополнения);
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Приоритет 4.
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольПолногоКодаМаркировки")
			И ПравилаПроверкиНаОшибки.КонтрольПолногоКодаМаркировки.Количество() > 0 Тогда
			
			Для Каждого СтрокаДерева Из ПравилаПроверкиНаОшибки.КонтрольПолногоКодаМаркировки Цикл
				
				Если СтрокаДерева.ЕстьОшибки Тогда
					Продолжить;
				КонецЕсли;
				
				ТекстОшибки = НСтр("ru = 'Требуется полный код маркировки (включая МРЦ)'");
				
				СтрокаДерева.ТекстОшибки = ТекстОшибки;
				СтрокаДерева.ЕстьОшибки  = Истина;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Приоритет 5.
		Если ПравилаПроверкиНаОшибки.Свойство("КонтролироватьРасхождениеСоставаУпаковокМеждуИБиИСМП") Тогда
			
			ГрупповыеУпаковкиБезПотребительских = Ложь;
			Если ПараметрыСканирования.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками Тогда
				ГрупповыеУпаковкиБезПотребительских = Истина;
			КонецЕсли;
			
			ЕстьРасхождения = Ложь;
			ШтрихкодированиеИС.ВыявитьРасхожденияВСоставахДеревьев(
				ДеревоУпаковок, ДанныеПоШтрихкодам.ДеревоПоДаннымСервиса,
				ЕстьРасхождения, ГрупповыеУпаковкиБезПотребительских);
			
			Если ЕстьРасхождения Тогда
				// Правило является исключением, проверка выполняется после завершения всех остальных проверок.
				// Установка флага обязательна.
				ЕстьОшибки = Истина;
				ДанныеПоШтрихкодам.ЕстьОшибкиВДеревеУпаковок = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПроверитьНаОшибкиТаблицуДанныеКодовМаркировки(
		ДанныеПоШтрихкодам, ПравилаПроверкиНаОшибки,
		ПараметрыСканирования, ЕстьОшибки);
	
	Если ПравилаПроверкиНаОшибки.Свойство("КонтрольСтатусов")
		И ПравилаПроверкиНаОшибки.КонтрольСтатусов.СтрокиСОшибками.Количество() > 0 Тогда
		
		Если ПредставленияСтатусов = Неопределено Тогда
			ПредставленияСтатусов = ПредставленияСтатусов();
		КонецЕсли;
		
		Для Каждого СтрокаДанных Из ПравилаПроверкиНаОшибки.КонтрольСтатусов.СтрокиСОшибками Цикл
			
			Если ЗначениеЗаполнено(СтрокаДанных.ТекстОшибки) Тогда
				Продолжить;
			КонецЕсли;
			
			ПредставлениеСтатуса = ПредставленияСтатусов.Получить(СтрокаДанных.Статус);
			Если ПредставлениеСтатуса = Неопределено Тогда
				ПредставлениеСтатуса = НСтр("ru='<Неопределен>'");
			КонецЕсли;
			
			СтрокаДанных.ТекстОшибки = СтрШаблон(НСтр("ru = 'Статус: %1'"), ПредставлениеСтатуса);
			
			ВидДополнения = ШтрихкодированиеИСМПСлужебный.ВидДополненияПредставленияОшибки();
			ВидДополнения.Статус          = СтрокаДанных.Статус;
			ВидДополнения.ВидОперацииИСМП = ПараметрыСканирования.ВидОперацииИСМП;
			ШтрихкодированиеИСМПСлужебный.ДополнитьПредставлениеОшибки(СтрокаДанных, ВидДополнения);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПравилаПроверкиНаОшибки.Свойство("КонтрольСпособаВводаВОборот")
		И ПравилаПроверкиНаОшибки.КонтрольСпособаВводаВОборот.Количество() > 0 Тогда

		Для Каждого СтрокаДерева Из ПравилаПроверкиНаОшибки.КонтрольСпособаВводаВОборот Цикл

			Если ЗначениеЗаполнено(СтрокаДерева.ТекстОшибки) Тогда
				Продолжить;
			КонецЕсли;

			СтрокаДерева.ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Способ ввода в оборот: %1'"),
				СтрокаДерева.СпособВводаВОборот);

		КонецЦикла;

	КонецЕсли;

	Если ПравилаПроверкиНаОшибки.Свойство("КонтрольСпособаВводаВОборотОффлайн")
		И ПравилаПроверкиНаОшибки.КонтрольСпособаВводаВОборотОффлайн.Количество() > 0 Тогда

		Для Каждого СтрокаДерева Из ПравилаПроверкиНаОшибки.КонтрольСпособаВводаВОборотОффлайн Цикл

			Если ЗначениеЗаполнено(СтрокаДерева.ТекстОшибки) Тогда
				Продолжить;
			КонецЕсли;

			СтрокаДерева.ТекстОшибки = НСтр("ru = 'Способ ввода в оборот: маркировка остатков'");

		КонецЦикла;

	КонецЕсли;

	Если ПравилаПроверкиНаОшибки.Свойство("КонтрольВладельца")
		И ПравилаПроверкиНаОшибки.КонтрольВладельца.Количество() > 0 Тогда
		
		Для Каждого СтрокаДанных Из ПравилаПроверкиНаОшибки.КонтрольВладельца Цикл
			
			Если ЗначениеЗаполнено(СтрокаДанных.ТекстОшибки) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДанных.Владелец) Тогда
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Владелец: %1 (%2)'"),
					СтрокаДанных.Владелец,
					СтрокаДанных.ИННВладельца);
			ИначеЕсли ЗначениеЗаполнено(СтрокаДанных.ИННВладельца) Тогда
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'ИНН владельца: %1'"),
					СтрокаДанных.ИННВладельца);
			Иначе
				ТекстОшибки = НСтр("ru = 'Владелец неопределен'");
			КонецЕсли;
			
			СтрокаДанных.ТекстОшибки = ТекстОшибки;
			
			ВидДополнения = ШтрихкодированиеИСМПСлужебный.ВидДополненияПредставленияОшибки();
			ВидДополнения.Владелец        = Истина;
			ВидДополнения.ВидОперацииИСМП = ПараметрыСканирования.ВидОперацииИСМП;
			ШтрихкодированиеИСМПСлужебный.ДополнитьПредставлениеОшибки(СтрокаДанных, ВидДополнения);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПравилаПроверкиНаОшибки.Свойство("КонтрольПолногоКодаМаркировки")
		И ПравилаПроверкиНаОшибки.КонтрольПолногоКодаМаркировки.Количество() > 0 Тогда
		
		Для Каждого СтрокаДанных Из ПравилаПроверкиНаОшибки.КонтрольПолногоКодаМаркировки Цикл
			
			Если ЗначениеЗаполнено(СтрокаДанных.ТекстОшибки) Тогда
				Продолжить;
			КонецЕсли;
			
			ТекстОшибки = НСтр("ru = 'Требуется полный код маркировки (включая МРЦ)'");
			
			СтрокаДанных.ТекстОшибки = ТекстОшибки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ШтрихкодированиеИС.ПроконтролироватьЗаполнениеСерийСУчетомСохраненногоВыбора(
		ПравилаПроверкиНаОшибки, ПараметрыСканирования);
	
КонецПроцедуры



// Определяет необходимость указания серии для маркируемой продукции.
// 
// Параметры:
//  ДанныеШтрихкода - (См. ШтрихкодированиеИС.ИнициализироватьДанныеШтрихкода).
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
// Возвращаемое значение:
//  Булево - Истина, если требуется указать серию.
Функция ТребуетсяВыборСерии(ДанныеШтрихкода, ПараметрыСканирования)
	
	ТребуетсяВыбор = Ложь;
	
	Если (ДанныеШтрихкода.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар
		Или ДанныеШтрихкода.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая)
		И Не ЗначениеЗаполнено(ДанныеШтрихкода.Серия) Тогда
		
		ТребуетсяВыбор = ИнтеграцияИС.ТребуетсяВыборСерии(ДанныеШтрихкода, ПараметрыСканирования);
		
	КонецЕсли;
	
	Возврат ТребуетсяВыбор;
	
КонецФункции

// Выполняет проверку на ошибки по заданным правилам.
//
// Параметры:
//  ДанныеПоШтрихкодам - (См. ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам).
//  ПравилаПроверкиНаОшибки - Структура - Описание:
//   * КонтрольСерий - Массив - Коллекция строк, где были выявлены ошибки по контролю серий.
//   * КонтрольСтатусов - Массив - Массив структур:
//     * СтрокиСОшибками - Массив - Коллекция строк, где были выявлены ошибки по контролю статусов.
//     * ДоступныеСтатусы - Массив из ПеречислениеСсылка.СтатусыКодовМаркировкиМОТП - Коллекция строк, где были выявлены
//                          ошибки по контролю статусов.
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
//  ЕстьОшибки - Булево - Истина, если найдена ошибка.
Процедура ПроверитьНаОшибкиТаблицуДанныеКодовМаркировки(ДанныеПоШтрихкодам, ПравилаПроверкиНаОшибки, ПараметрыСканирования, ЕстьОшибки)
	
	ВладелецМожетБытьПустым = Ложь;
	Если ПравилаПроверкиНаОшибки.Свойство("КонтрольВладельца") Тогда
		ВладелецМожетБытьПустым = ПроверкаИПодборПродукцииИСМПКлиентСервер.ЭтоДокументПриобретения(ПараметрыСканирования.СсылкаНаОбъект);
	КонецЕсли;
	
	Для Каждого СтрокаДанных Из ДанныеПоШтрихкодам.ДанныеКодовМаркировки Цикл
		
		Если СтрокаДанных.ЭтоШтрихкодНоменклатуры Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольСерий") Тогда
			Если ТребуетсяВыборСерии(СтрокаДанных, ПараметрыСканирования) Тогда
				ПравилаПроверкиНаОшибки.КонтрольСерий.Добавить(СтрокаДанных);
			КонецЕсли;
		КонецЕсли;
		
		Если ПравилаПроверкиНаОшибки.ПроверенныеШтрихкоды.Получить(СтрокаДанных.Штрихкод) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольВладельца") Тогда
			
			СведенияОбОрганизации = Неопределено;
			Если ДанныеПоШтрихкодам.СведенияОбОрганизациях = Неопределено Тогда
				ДанныеПоШтрихкодам.СведенияОбОрганизациях = Новый Соответствие;
			Иначе
				СведенияОбОрганизации = ДанныеПоШтрихкодам.СведенияОбОрганизациях[ПараметрыСканирования.Владелец];
			КонецЕсли;
			Если СведенияОбОрганизации = Неопределено Тогда
				СведенияОбОрганизации = ИнтеграцияИСВызовСервера.ИННКПППоОрганизацииКонтрагенту(ПараметрыСканирования.Владелец);
				ДанныеПоШтрихкодам.СведенияОбОрганизациях.Вставить(ПараметрыСканирования.Владелец, СведенияОбОрганизации);
			КонецЕсли;
			
			ОжидаемыйИННВладельца = СведенияОбОрганизации.ИНН;
			
			Если ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП
				И ПараметрыСканирования.ПроверятьПотребительскиеУпаковкиНаВхождениеВСеруюЗонуМОТП Тогда
				ВыполнятьКонтрольСУчетомСеройЗоны = Не СтрокаДанных.ВСеройЗоне;
			Иначе
				ВыполнятьКонтрольСУчетомСеройЗоны = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДанных.ДатаПроизводства)
				И ВыполнятьКонтрольСУчетомСеройЗоны Тогда
				ДатаПроизводстваДопускаетКонтроль = СтрокаДанных.ДатаПроизводства >= ПараметрыСканирования.ДатаПроизводстваНачалаКонтроляСтатусовКодовМаркировкиМОТП;
			Иначе
				ДатаПроизводстваДопускаетКонтроль = Истина;
			КонецЕсли;
			
			Если ВладелецМожетБытьПустым И Не ЗначениеЗаполнено(СтрокаДанных.ИННВладельца) Тогда
			ИначеЕсли СтрокаДанных.ИННВладельца <> ОжидаемыйИННВладельца
				И ДатаПроизводстваДопускаетКонтроль Тогда
				
				ЕстьОшибки = Истина;
				ПравилаПроверкиНаОшибки.КонтрольВладельца.Добавить(СтрокаДанных);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольСтатусов") Тогда
			
			Если СтрокаДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
				ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП;
			Иначе
				ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыМОТП;
			КонецЕсли;
			
			Если ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП
				И ПараметрыСканирования.ПроверятьПотребительскиеУпаковкиНаВхождениеВСеруюЗонуМОТП Тогда
				ВыполнятьКонтрольСУчетомСеройЗоны = Не СтрокаДанных.ВСеройЗоне;
			Иначе
				ВыполнятьКонтрольСУчетомСеройЗоны = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДанных.ДатаПроизводства)
				И ВыполнятьКонтрольСУчетомСеройЗоны Тогда
				ДатаПроизводстваДопускаетКонтроль = СтрокаДанных.ДатаПроизводства >= ПараметрыСканирования.ДатаПроизводстваНачалаКонтроляСтатусовКодовМаркировкиМОТП;
			Иначе
				ДатаПроизводстваДопускаетКонтроль = Истина;
			КонецЕсли;
			
			Если ДопустимыеСтатусыМОТП.Найти(СтрокаДанных.Статус) = Неопределено
				И ДатаПроизводстваДопускаетКонтроль
				И Не СтрокаДанных.ВСеройЗоне Тогда
				
				ЕстьОшибки = Истина;
				ПравилаПроверкиНаОшибки.КонтрольСтатусов.СтрокиСОшибками.Добавить(СтрокаДанных);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольСпособаВводаВОборот") Тогда
			
			Если ЗначениеЗаполнено(СтрокаДанных.СпособВводаВОборот) // Агрегация, новые упаковки.
				И СтрокаДанных.СпособВводаВОборот <> ПараметрыСканирования.ДопустимыйСпособВводаВОборот Тогда
				
				ЕстьОшибки = Истина;
				ПравилаПроверкиНаОшибки.КонтрольСпособаВводаВОборот.Добавить(СтрокаДанных);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольСпособаВводаВОборотОффлайн") Тогда
		
			Если ШтрихкодированиеИСКлиентСервер.ЭтоШтрихкодВводаОстатков(СтрокаДанных.Штрихкод, Истина)
				И ПараметрыСканирования.ДопустимыйСпособВводаВОборот <> Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков Тогда
				
				ЕстьОшибки = Истина;
				ПравилаПроверкиНаОшибки.КонтрольСпособаВводаВОборотОффлайн.Добавить(СтрокаДанных);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольПолногоКодаМаркировки") Тогда
			
			Если СтрокаДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская
				И СтрокаДанных.ВидПродукции = Перечисления.ВидыПродукцииИС.Табак Тогда
				
				СоставКодаМаркировки   = СтрокаДанных.СоставКодаМаркировки;
				КодВключаетКодПроверки = Ложь;
				КодВключаетМРЦ         = Ложь;
				
				Если СоставКодаМаркировки <> Неопределено Тогда
					Если СоставКодаМаркировки.Свойство("ВключаетМРЦ") Тогда
						КодВключаетМРЦ = СоставКодаМаркировки.ВключаетМРЦ;
					КонецЕсли;
					Если СоставКодаМаркировки.Свойство("ВключаетКодПроверки") Тогда
						КодВключаетКодПроверки = СоставКодаМаркировки.ВключаетКодПроверки;
					КонецЕсли;
				КонецЕсли;
				
				Если Не (КодВключаетКодПроверки Или КодВключаетМРЦ)
					И Не СтрокаДанных.ЕстьВПулеКодовМаркировки Тогда
					
					ЕстьОшибки = Истина;
					ПравилаПроверкиНаОшибки.КонтрольПолногоКодаМаркировки.Добавить(СтрокаДанных);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет проверку строк дерева на ошибки.
//
// Параметры:
//  СтрокиДерева - КоллекцияСтрокДереваЗначений - Строки дерева упаковок.
//  ПравилаПроверкиНаОшибки - Структура - правила, по которым выполняется проверка.
// * КонтрольПустыхУпаковок - Массив из СтрокаДереваЗначений - Коллекция строк дерева с ошибками.
// * КонтрольСерий - для дерева заполнение серий не контролируется.
// * КонтрольВладельца - Массив - Коллекция строк дерева, в которых ИНН владельца не соответствует ожидаемому.
// * КонтрольСтатусов - Массив - Коллекция строк дерева, в которых статус не соответствует ожидаемому.
//  ПараметрыСканирования - См. ШтрихкодированиеИС.ПараметрыСканирования.
//  ЕстьОшибки - Булево - Истина, если при проверке выявлены ошибки.
Процедура ПроверитьНаОшибкиСтрокиДерева(СтрокиДерева, ПравилаПроверкиНаОшибки, ПараметрыСканирования, ДанныеПоШтрихкодам, ЕстьОшибки)
	
	ВладелецМожетБытьПустым = Ложь;
	Если ПравилаПроверкиНаОшибки.Свойство("КонтрольВладельца") Тогда
		
		Если ЗначениеЗаполнено(ПараметрыСканирования.Владелец) Тогда
			
			СведенияОбОрганизации = Неопределено;
			Если ДанныеПоШтрихкодам.СведенияОбОрганизациях = Неопределено Тогда
				ДанныеПоШтрихкодам.СведенияОбОрганизациях = Новый Соответствие;
			Иначе
				СведенияОбОрганизации = ДанныеПоШтрихкодам.СведенияОбОрганизациях[ПараметрыСканирования.Владелец];
			КонецЕсли;
			Если СведенияОбОрганизации = Неопределено Тогда
				СведенияОбОрганизации = ИнтеграцияИСВызовСервера.ИННКПППоОрганизацииКонтрагенту(ПараметрыСканирования.Владелец);
				ДанныеПоШтрихкодам.СведенияОбОрганизациях.Вставить(ПараметрыСканирования.Владелец, СведенияОбОрганизации);
			КонецЕсли;
			
			ОжидаемыйИННВладельца = СведенияОбОрганизации.ИНН;
			
		Иначе
			
			ОжидаемыйИННВладельца = "";
			
		КонецЕсли;
		
		ВладелецМожетБытьПустым = ПроверкаИПодборПродукцииИСМПКлиентСервер.ЭтоДокументПриобретения(ПараметрыСканирования.СсылкаНаОбъект);
		
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольПустыхУпаковок") Тогда
			
			Если ИнтеграцияИСКлиентСервер.ЭтоУпаковка(СтрокаДерева.ТипУпаковки)
				И СтрокаДерева.Строки.Количество() = 0
				И СтрокаДерева.КоличествоПачек = 0 Тогда
				ЕстьОшибки = Истина;
				ПравилаПроверкиНаОшибки.КонтрольПустыхУпаковок.Добавить(СтрокаДерева);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольСтатусов") Тогда
			
			Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
				ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП;
			Иначе
				ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыМОТП;
			КонецЕсли;
			
			Если ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП
				И ПараметрыСканирования.ПроверятьПотребительскиеУпаковкиНаВхождениеВСеруюЗонуМОТП Тогда
				ВыполнятьКонтрольСУчетомСеройЗоны = Не СтрокаДерева.ВСеройЗоне;
			Иначе
				ВыполнятьКонтрольСУчетомСеройЗоны = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДерева.ДатаПроизводства)
				И ВыполнятьКонтрольСУчетомСеройЗоны Тогда
				ДатаПроизводстваДопускаетКонтроль = СтрокаДерева.ДатаПроизводства >= ПараметрыСканирования.ДатаПроизводстваНачалаКонтроляСтатусовКодовМаркировкиМОТП;
			Иначе
				ДатаПроизводстваДопускаетКонтроль = Истина;
			КонецЕсли;
			
			Если ДопустимыеСтатусыМОТП.Найти(СтрокаДерева.Статус) = Неопределено
				И ДатаПроизводстваДопускаетКонтроль Тогда
				
				ЕстьОшибки = Истина;
				ПравилаПроверкиНаОшибки.КонтрольСтатусов.СтрокиСОшибками.Добавить(СтрокаДерева);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольВладельца") Тогда
			
			Если СтрокаДерева.Статус <> Перечисления.СтатусыКодовМаркировкиМОТП.Неопределен
				И СтрокаДерева.Статус <> Неопределено
				И СтрокаДерева.ИННВладельца <> ОжидаемыйИННВладельца Тогда
				
				Если ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП
					И ПараметрыСканирования.ПроверятьПотребительскиеУпаковкиНаВхождениеВСеруюЗонуМОТП Тогда
					ВыполнятьКонтрольСУчетомСеройЗоны = Не СтрокаДерева.ВСеройЗоне;
				Иначе
					ВыполнятьКонтрольСУчетомСеройЗоны = Истина;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаДерева.ДатаПроизводства)
					И ВыполнятьКонтрольСУчетомСеройЗоны Тогда
					ДатаПроизводстваДопускаетКонтроль = СтрокаДерева.ДатаПроизводства >= ПараметрыСканирования.ДатаПроизводстваНачалаКонтроляСтатусовКодовМаркировкиМОТП;
				Иначе
					ДатаПроизводстваДопускаетКонтроль = Истина;
				КонецЕсли;
				
				Если ВладелецМожетБытьПустым И Не ЗначениеЗаполнено(СтрокаДерева.ИННВладельца) Тогда
				ИначеЕсли ДатаПроизводстваДопускаетКонтроль Тогда
					ЕстьОшибки = Истина;
					ПравилаПроверкиНаОшибки.КонтрольВладельца.Добавить(СтрокаДерева);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольСпособаВводаВОборот") Тогда

			Если СтрокаДерева.Статус <> Перечисления.СтатусыКодовМаркировкиИСМП.Неопределен
				И СтрокаДерева.СпособВводаВОборот <> ПараметрыСканирования.ДопустимыйСпособВводаВОборот Тогда

				ЕстьОшибки = Истина;
				ПравилаПроверкиНаОшибки.КонтрольСпособаВводаВОборот.Добавить(СтрокаДерева);

			КонецЕсли;

		КонецЕсли;

		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольСпособаВводаВОборотОффлайн") Тогда

			Если ШтрихкодированиеИСКлиентСервер.ЭтоШтрихкодВводаОстатков(СтрокаДерева.Штрихкод, Истина)
				И ПараметрыСканирования.ДопустимыйСпособВводаВОборот <> Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков Тогда

				ЕстьОшибки = Истина;
				ПравилаПроверкиНаОшибки.КонтрольСпособаВводаВОборотОффлайн.Добавить(СтрокаДерева);

			КонецЕсли;

		КонецЕсли;

		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольПолногоКодаМаркировки") Тогда
			
			Если СтрокаДерева.ВидПродукции = Перечисления.ВидыПродукцииИС.Табак
				И СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская
				И (СтрокаДерева.Родитель = Неопределено
				Или СтрокаДерева.Родитель.ВидУпаковки <> Перечисления.ВидыУпаковокИС.Групповая
				Или ПараметрыСканирования.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки) Тогда
				
				СоставКодаМаркировки   = СтрокаДерева.СоставКодаМаркировки;
				КодВключаетКодПроверки = Ложь;
				КодВключаетМРЦ         = Ложь;
				
				Если СоставКодаМаркировки <> Неопределено Тогда
					Если СоставКодаМаркировки.Свойство("ВключаетМРЦ") Тогда
						КодВключаетМРЦ = СоставКодаМаркировки.ВключаетМРЦ;
					КонецЕсли;
					Если СоставКодаМаркировки.Свойство("ВключаетКодПроверки") Тогда
						КодВключаетКодПроверки = СоставКодаМаркировки.ВключаетКодПроверки;
					КонецЕсли;
				КонецЕсли;
				
				Если Не (КодВключаетКодПроверки Или КодВключаетМРЦ)
					И Не СтрокаДерева.ЕстьВПулеКодовМаркировки Тогда
					
					ЕстьОшибки = Истина;
					ПравилаПроверкиНаОшибки.КонтрольПолногоКодаМаркировки.Добавить(СтрокаДерева);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ПравилаПроверкиНаОшибки.ПроверенныеШтрихкоды.Вставить(СтрокаДерева.Штрихкод, Истина);
		ПроверитьНаОшибкиСтрокиДерева(СтрокаДерева.Строки, ПравилаПроверкиНаОшибки, ПараметрыСканирования, ДанныеПоШтрихкодам, ЕстьОшибки);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ДополнениеДанныхШтрихкодовСпецификой

// Дополняет свойства таблицы значений - "МаркированныеТовары" или дерево значение - "ДеревоУпаковок" колонками,
// специфичными для табачной продукции.
//
// Параметры:
//  Коллекция - ТаблицаЗначений, ДеревоЗначений - "МаркированныеТовары" или "ДеревоУпаковок"
//  ПараметрыСканирования - См. ШтрихкодированиеИС.ПараметрыСканирования
Процедура НормализоватьСвойстваКоллекцииВложенныхШтрихкодов(Коллекция, ПараметрыСканирования = Неопределено) Экспорт
	
	Если ТипЗнч(Коллекция) = Тип("ДеревоЗначений") Тогда
		КоллекцияОбязательныхКолонок = ШтрихкодированиеИС.КолонкиДереваУпаковок();
	ИначеЕсли ТипЗнч(Коллекция) = Тип("ТаблицаЗначений") Тогда 
		КоллекцияОбязательныхКолонок = ШтрихкодированиеИС.КолонкиТаблицыМаркированныеТовары();
	КонецЕсли;
	
	ПараметрыДерева = ИнтерфейсМОТП.ПараметрыПостроенияДерева(ПараметрыСканирования);
	
	ШтрихкодированиеМОТП.КоллекцияДополнительныхКолонокДереваУпаковокМОТП(ПараметрыДерева, КоллекцияОбязательныхКолонок);
	Если ТипЗнч(Коллекция) = Тип("ТаблицаЗначений") Тогда
		Если КоллекцияОбязательныхКолонок.Свойство("МРЦ") Тогда
			КоллекцияОбязательныхКолонок.Удалить("МРЦ");
		КонецЕсли;
		Если КоллекцияОбязательныхКолонок.Свойство("КоличествоБлоков") Тогда
			КоллекцияОбязательныхКолонок.Удалить("КоличествоБлоков");
		КонецЕсли;
	КонецЕсли;
	
	КоллекцияОбязательныхКолонок.Вставить("Владелец",                  Неопределено);
	КоллекцияОбязательныхКолонок.Вставить("GTIN",                      Метаданные.ОпределяемыеТипы.GTIN.Тип);
	КоллекцияОбязательныхКолонок.Вставить("EAN",                       Метаданные.ОпределяемыеТипы.GTIN.Тип);
	КоллекцияОбязательныхКолонок.Вставить("ПредставлениеСтатуса",      Новый ОписаниеТипов("Строка"));
	
	КоллекцияОбязательныхКолонок.Вставить("НоменклатураСопоставленаПоУПД", Новый ОписаниеТипов("Булево"));
	
	КоллекцияОбязательныхКолонок.Вставить("ЕстьВПулеКодовМаркировки",      Новый ОписаниеТипов("Булево"));
	
	ШтрихкодированиеМОТП.НормализироватьДанныеДереваУпаковокПоПереданнымКолонкам(Коллекция, КоллекцияОбязательныхКолонок);
	
КонецПроцедуры

#Область НормализацияДанныхВложенныхШтрихкодов

// Дополняет входящие в состав "Вложенных штрихкодов" коллекции - "Дерево упаковок" и "Маркированные товары" свойствами
// специфичными для табачной продукции и заполняет на основании данных - "Специфика штрихкодов".
//
// Параметры:
//  ВложенныеШтрихкоды - Структура - Включает в себя таблицу значений "Маркированные товары" и "Дерево упаковок".
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
Процедура НормализоватьДанныеВложенныхШтрихкодов(ВложенныеШтрихкоды, ПараметрыСканирования, ДанныеКодовМаркировки = Неопределено) Экспорт
	
	ДеревоУпаковок = ВложенныеШтрихкоды.ДеревоУпаковок;
	НормализоватьДанныеДереваУпаковок(ДеревоУпаковок, ПараметрыСканирования, ДанныеКодовМаркировки);
	
	// Если сканирование выполняется в форме проверки и подбора, то заполнение таблицы маркированных товаров не требуется
	Если Не ПараметрыСканирования.ИспользуетсяСоответствиеШтрихкодовСтрокДерева Тогда
		МаркированныеТовары = ВложенныеШтрихкоды.МаркированныеТовары;
		НормализоватьДанныеТаблицыМаркированныеТовары(ДеревоУпаковок, МаркированныеТовары);
	КонецЕсли;
	
КонецПроцедуры

// Дополняет таблицу значений "Маркированные товары" свойствами специфичными для табачной продукции и заполняет
// на основании данных - "Дерева упаковок".
//
// Параметры:
//  ДеревоУпаковок - ДеревоЗначений - Дерево упаковок, построенное в соответствие с хранением в справочнике ШтрихкодыУпаковок.
//  МаркированныеТовары - ТаблицаЗначений - Таблица с маркируемой продукцией.
Процедура НормализоватьДанныеТаблицыМаркированныеТовары(ДеревоУпаковок, МаркированныеТовары)
	
	МаркированныеТовары.Очистить();
	НормализоватьСвойстваКоллекцииВложенныхШтрихкодов(МаркированныеТовары);
	ШтрихкодированиеИС.ЗаполнитьТаблицуМаркированныеТоварыПоСтрокамДереваУпаковок(ДеревоУпаковок.Строки, МаркированныеТовары);
	
КонецПроцедуры

#Область НормализацияДанныхДереваУпаковок

Функция КоллекцияДополнительныхКолонокДереваУпаковокДляФормыПроверкиКодовМаркировки(КоллекцияДополнительныхКолонок = Неопределено) Экспорт
	
	Если КоллекцияДополнительныхКолонок = Неопределено Тогда
		КоллекцияДополнительныхКолонок = Новый Структура;
	КонецЕсли;
	
	КоллекцияДополнительныхКолонок.Вставить("ДатаЭмиссии",               Новый ОписаниеТипов("Дата"));
	КоллекцияДополнительныхКолонок.Вставить("ДатаВводаВОборот",          Новый ОписаниеТипов("Дата"));
	КоллекцияДополнительныхКолонок.Вставить("ДатаСписания",              Новый ОписаниеТипов("Дата"));
	КоллекцияДополнительныхКолонок.Вставить("ИННПроизводителя",          Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("НаименованиеПроизводителя", Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("ПредставлениеНоменклатуры", Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("ИННАгента",                 Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("НаименованиеАгента",        Новый ОписаниеТипов("Строка"));
	
	Возврат КоллекцияДополнительныхКолонок;
	
КонецФункции

Функция КоллекцияДополнительныхКолонокДереваУпаковокИСМП(ПараметрыДерева, КоллекцияДополнительныхКолонок = Неопределено, ДляВложенныхСтрокДерева = Ложь, ИмяКолонкиКоличество = "КоличествоПотребительскихУпаковок") Экспорт
	
	Если КоллекцияДополнительныхКолонок = Неопределено Тогда
		КоллекцияДополнительныхКолонок = Новый Структура;
	КонецЕсли;
	
	КоллекцияДополнительныхКолонок.Вставить("ИННВладельца",         Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("ИННАгента",            Новый ОписаниеТипов("Строка"));
	
	КоллекцияДополнительныхКолонок.Вставить("СпособВводаВОборот",   Новый ОписаниеТипов("ПеречислениеСсылка.СпособыВводаВОборотСУЗ"));
	КоллекцияДополнительныхКолонок.Вставить("РодительскаяУпаковка", Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("ДатаПроизводства",     Новый ОписаниеТипов("Дата"));
	
	Если Не ДляВложенныхСтрокДерева И ЗначениеЗаполнено(ИмяКолонкиКоличество) Тогда
		КоллекцияДополнительныхКолонок.Вставить(ИмяКолонкиКоличество, Новый ОписаниеТипов("Число"));
	КонецЕсли;
	
	Если Не ДляВложенныхСтрокДерева Тогда
		КоллекцияДополнительныхКолонок.Вставить("ГоденДо", Новый ОписаниеТипов("Дата"));
	КонецЕсли;

	КоллекцияДополнительныхКолонок.Вставить("ПредставлениеНоменклатуры", Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("Статус",                    ОписаниеТиповКолонкиСтатус());
	КоллекцияДополнительныхКолонок.Вставить("ОсобоеСостояние",           ОписаниеТиповКолонкиСтатус());
	
	Возврат КоллекцияДополнительныхКолонок;
	
КонецФункции

Функция КоллекцияДополнительныхКолонокДереваУпаковокМОТП(ПараметрыДерева, КоллекцияДополнительныхКолонок = Неопределено, ДляВложенныхСтрокДерева = Ложь) Экспорт
	
	Если КоллекцияДополнительныхКолонок = Неопределено Тогда
		КоллекцияДополнительныхКолонок = Новый Структура;
	КонецЕсли;
	
	КоллекцияДополнительныхКолонок.Вставить("ИННВладельца",         Новый ОписаниеТипов("Строка"));
	
	КоллекцияДополнительныхКолонок.Вставить("СпособВводаВОборот",   Новый ОписаниеТипов("ПеречислениеСсылка.СпособыВводаВОборотСУЗ"));
	КоллекцияДополнительныхКолонок.Вставить("РодительскаяУпаковка", Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("ДатаПроизводства",     Новый ОписаниеТипов("Дата"));
	
	Если Не ДляВложенныхСтрокДерева Тогда
		КоллекцияДополнительныхКолонок.Вставить("КоличествоПачек",  Новый ОписаниеТипов("Число"));
		КоллекцияДополнительныхКолонок.Вставить("КоличествоБлоков", Новый ОписаниеТипов("Число"));
	КонецЕсли;
	
	Если ПараметрыДерева.УчитыватьМРЦ И Не ДляВложенныхСтрокДерева Тогда
		КоллекцияДополнительныхКолонок.Вставить("МРЦ", Новый ОписаниеТипов("Число"));
	КонецЕсли;
	
	Если ПараметрыДерева.ИспользуетсяСераяЗона И Не ДляВложенныхСтрокДерева Тогда
		КоллекцияДополнительныхКолонок.Вставить("ВСеройЗоне",        Новый ОписаниеТипов("Булево"));
		КоллекцияДополнительныхКолонок.Вставить("СодержитСерыеКоды", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	КоллекцияДополнительныхКолонок.Вставить("ПредставлениеНоменклатуры", Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("Статус",                    ОписаниеТиповКолонкиСтатус());
	
	Возврат КоллекцияДополнительныхКолонок;
	
КонецФункции

Процедура НормализироватьДанныеДереваУпаковокПоПереданнымКолонкам(Коллекция, КоллекцияДополнительныхКолонок) Экспорт
	
	Для Каждого КлючЗначение Из КоллекцияДополнительныхКолонок Цикл
		
		ИмяКолонки    = КлючЗначение.Ключ;
		ОписаниеТипов = КлючЗначение.Значение;
		
		Если Коллекция.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
			Коллекция.Колонки.Добавить(ИмяКолонки, ОписаниеТипов);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Дополняет дерево упаковок колонками, специфичными для табачной продукции. Заполняет значения специфичных колонок.
//
// Параметры:
//  ДеревоУпаковок - ДеревоЗначений - Дерево упаковок, построенное в соответствие с хранением в справочнике ШтрихкодыУпаковок.
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
//  ДанныеКодовМаркировки - (См. ШтрихкодированиеИС.ИнициализацияТаблицыДанныхКодовМаркировки).
Процедура НормализоватьДанныеДереваУпаковок(ДеревоУпаковок, ПараметрыСканирования, ДанныеКодовМаркировки = Неопределено)
	
	НормализоватьСвойстваКоллекцииВложенныхШтрихкодов(ДеревоУпаковок, ПараметрыСканирования);
	
	Если ПараметрыСканирования.ЭтоПроверкаКодовМаркировкиИСМП Тогда
		КоллекцияДополнительныхКолонок = КоллекцияДополнительныхКолонокДереваУпаковокДляФормыПроверкиКодовМаркировки();
		НормализироватьДанныеДереваУпаковокПоПереданнымКолонкам(ДеревоУпаковок, КоллекцияДополнительныхКолонок);
	КонецЕсли;
	
	ПараметрыДерева = ИнтерфейсМОТП.ПараметрыПостроенияДерева(ПараметрыСканирования);
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ДанныеКодовМаркировки",  ДанныеКодовМаркировки);
	ПараметрыЗаполнения.Вставить("Кэш",                    Новый Структура());
	ПараметрыЗаполнения.Вставить("ПараметрыСканирования",  ПараметрыСканирования);
	ПараметрыЗаполнения.Вставить("ПараметрыДерева",        ПараметрыДерева);
	
	ПараметрыЗаполнения.Кэш.Вставить("КэшНоменклатуры",       Новый Соответствие);
	ПараметрыЗаполнения.Кэш.Вставить("ЗапросИУстановкаМРЦ",   Новый Массив);
	ПараметрыЗаполнения.Кэш.Вставить("ВычислениеМРЦ",         Новый Массив);
	ПараметрыЗаполнения.Кэш.Вставить("ЗаполняемыеКолонки",    Неопределено);
	
	ЗаполнитьСтрокиДереваПриНормализацииРекурсивно(
		ДеревоУпаковок,
		ПараметрыСканирования.ВариантПолученияМРЦ,
		Неопределено,
		ПараметрыЗаполнения);
	
	ЗапросИРасчетМРЦПоСтрокамДерева(
		ПараметрыЗаполнения.Кэш.ЗапросИУстановкаМРЦ,
		ПараметрыЗаполнения.Кэш.ВычислениеМРЦ, 
		ПараметрыСканирования);
	
КонецПроцедуры

// Заполняет строки дерева упаковок данными специфичными для табачной продукции.
//
// Параметры:
// ПараметрыЗаполнения - Структура:
//  *СтрокаВерхнегоУровня   - СтрокаДереваЗначений - Строка дерева упаковок.
//  *ДанныеКодовМаркировки  - (См. ШтрихкодированиеИС.ИнициализацияТаблицыДанныхКодовМаркировки).
//  *ПараметрыСканирования  - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
//  *УчитыватьМРЦ           - Булево - ведение учета МРЦ в системе.
//  *Кэш - Структура:
//   ** КэшНоменклатуры     - Соответствие -
//   ** ЗапросИУстановкаМРЦ - Массив -
//   ** ВычислениеМРЦ       - Массив -
//  *ВариантПолученияМРЦ    - Строка - Вариант получения МРЦ. 
//  *УпаковкаВерхнегоУровня - СтрокаДереваЗначений - Самая верхняя строка иерархии дерева упаковок.
Процедура ЗаполнитьСтрокиДереваПриНормализацииРекурсивно(СтрокаВерхнегоУровня, ВариантПолученияМРЦ, УпаковкаВерхнегоУровня, ПараметрыЗаполнения)
	
	ОчиститьКоличествоБлоковИПачек = Истина;
	ПараметрыДерева                = ПараметрыЗаполнения.ПараметрыДерева;
	
	Для Каждого СтрокаДерева Из СтрокаВерхнегоУровня.Строки Цикл
		
		Если ОчиститьКоличествоБлоковИПачек Тогда
			Если ТипЗнч(СтрокаВерхнегоУровня) = Тип("СтрокаДереваЗначений") Тогда
				СтрокаВерхнегоУровня.КоличествоПачек  = 0;
				СтрокаВерхнегоУровня.КоличествоБлоков = 0;
				ОчиститьКоличествоБлоковИПачек = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДерева.ВидПродукции)
			И Не ИнтеграцияИСКлиентСервер.ЭтоПродукцияМОТП(СтрокаДерева.ВидПродукции) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДерева.Родитель = Неопределено Тогда
			УпаковкаВерхнегоУровня = СтрокаДерева.ШтрихкодУпаковки;
		КонецЕсли;
		
		СтрокаДерева.УпаковкаВерхнегоУровня = УпаковкаВерхнегоУровня;
		
		ШтрихкодированиеИСМПСлужебный.ЗаполнитьСтрокуПоДаннымРазбораКодаМаркировки(
			СтрокаДерева,
			ПараметрыЗаполнения.ПараметрыСканирования);
		
		ЭтоКодМаркировкиБлока = (СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая);
		
		Если ПараметрыДерева.УчитыватьМРЦ
			И Не ЗначениеЗаполнено(СтрокаДерева.МРЦ)
			И (СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская
				Или ЭтоКодМаркировкиБлока) Тогда
			
			СоставКодаМаркировки = СтрокаДерева.СоставКодаМаркировки;
			
			Если СоставКодаМаркировки <> Неопределено
				И СоставКодаМаркировки.Свойство("МРЦ")
				И ЗначениеЗаполнено(СоставКодаМаркировки.МРЦ) Тогда
				СтрокаДерева.МРЦ = СоставКодаМаркировки.МРЦ;
			КонецЕсли;
			
		КонецЕсли;
		
		ВложенныйВариантПолученияМРЦ = ВариантПолученияМРЦ;
		
		Если ПараметрыДерева.УчитыватьМРЦ Тогда
			Если ЭтоКодМаркировкиБлока Тогда
				Если ЗначениеЗаполнено(СтрокаДерева.МРЦ) Тогда
					ВложенныйВариантПолученияМРЦ = "ВычислениеОтРодителя";
				ИначеЕсли ВариантПолученияМРЦ = "ВычислениеИЗапрос" Тогда
					ПараметрыЗаполнения.Кэш.ЗапросИУстановкаМРЦ.Добавить(СтрокаДерева);
					ВложенныйВариантПолученияМРЦ = "ВычислениеОтРодителя";
				КонецЕсли;
			ИначеЕсли ВариантПолученияМРЦ = "ВычислениеОтРодителя" Тогда
				ПараметрыЗаполнения.Кэш.ВычислениеМРЦ.Добавить(СтрокаДерева);
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьСтрокиДереваПриНормализацииРекурсивно(
			СтрокаДерева,
			ВложенныйВариантПолученияМРЦ,
			УпаковкаВерхнегоУровня,
			ПараметрыЗаполнения);
		
		Если ПараметрыЗаполнения.ДанныеКодовМаркировки <> Неопределено
			И ЗначениеЗаполнено(СтрокаДерева.НормализованныйШтрихкод) Тогда
			
			СтрокаДанных = ПараметрыЗаполнения.ДанныеКодовМаркировки.Найти(СтрокаДерева.НормализованныйШтрихкод, "НормализованныйШтрихкод");
			
			Если СтрокаДанных <> Неопределено Тогда
				
				Если ПараметрыЗаполнения.Кэш.ЗаполняемыеКолонки = Неопределено Тогда
					
					ПараметрыЗаполнения.Кэш.ЗаполняемыеКолонки = Новый Массив;
					
					КолонкиДерева = СтрокаДерева.Владелец().Колонки;
					Для Каждого Колонка Из ПараметрыЗаполнения.ДанныеКодовМаркировки.Колонки Цикл
						
						ИмяКолонки = Колонка.Имя;
						
						Если КолонкиДерева.Найти(ИмяКолонки) = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						
						ПараметрыЗаполнения.Кэш.ЗаполняемыеКолонки.Добавить(ИмяКолонки);
						
					КонецЦикла;
					
				КонецЕсли;
				
				ЗаполнитьСтрокуДереваПоДаннымТаблицыКодыМаркировок(СтрокаДерева, СтрокаДанных, ПараметрыЗаполнения);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ЗаполнитьХарактеристикиСтрокиДереваПоПодчиненнымСтрокам(СтрокаДерева, СтрокаДанных);
		
		РассчитатьКоличественныеПоказателиСтрокиДерева(СтрокаДерева);
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет вид упаковки строки дерева, вычисляет принадлежность упаковки к монотоварной и мультитоварной.
// 
// Параметры:
//  СтрокаДерева - СтрокаДереваЗначений - Строка дерева упаковок.
//  СтрокаДанных - СтрокаТаблицыЗначений - Строка данных.
Процедура ЗаполнитьХарактеристикиСтрокиДереваПоПодчиненнымСтрокам(СтрокаДерева, СтрокаДанных)
	
	Если СтрокаДерева.Строки.Количество() = 0 Тогда
		
		Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
			СтрокаДерева.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар;
		Иначе
			// Групповая упаковка - всегда монотоварная.
			// Логистическая упаковка без вложений - с большой вероятностью является монотоварной.
			СтрокаДерева.ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
		КонецЕсли;
		
		Если СтрокаДерева.Номенклатура = Неопределено Тогда
			СтрокаДерева.Номенклатура = ИнтеграцияИС.ПустоеЗначениеОпределяемогоТипа("Номенклатура");
		КонецЕсли;
		
		Если СтрокаДерева.Характеристика = Неопределено Тогда
			СтрокаДерева.Характеристика = ИнтеграцияИС.ПустоеЗначениеОпределяемогоТипа("ХарактеристикаНоменклатуры");
		КонецЕсли;
		
		Если СтрокаДерева.Серия = Неопределено Тогда
			СтрокаДерева.Серия = ИнтеграцияИС.ПустоеЗначениеОпределяемогоТипа("СерияНоменклатуры");
		КонецЕсли;
		
	Иначе
		
		ПроверятьНоменклатуру   = Истина;
		ПроверятьХарактеристику = Истина;
		ПроверятьСерию          = Истина;
		
		СтрокаДерева.Номенклатура   = Неопределено;
		СтрокаДерева.Характеристика = Неопределено;
		СтрокаДерева.Серия          = Неопределено;
		
		СтрокаДерева.ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
		
		Для Каждого Строка Из СтрокаДерева.Строки Цикл
			
			Если ПроверятьНоменклатуру Тогда
				Если СтрокаДерева.Номенклатура = Неопределено Тогда
					СтрокаДерева.Номенклатура = Строка.Номенклатура;
				ИначеЕсли СтрокаДерева.Номенклатура <> Строка.Номенклатура Тогда
					СтрокаДерева.Номенклатура   = Неопределено;
					СтрокаДерева.Характеристика = Неопределено;
					СтрокаДерева.Серия          = Неопределено;
					ПроверятьНоменклатуру   = Ложь;
					ПроверятьХарактеристику = Ложь;
					ПроверятьСерию          = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			Если ПроверятьХарактеристику Тогда
				Если СтрокаДерева.Характеристика = Неопределено Тогда
					СтрокаДерева.Характеристика = Строка.Характеристика;
				ИначеЕсли СтрокаДерева.Характеристика <> Строка.Характеристика Тогда
					СтрокаДерева.Номенклатура   = Неопределено;
					СтрокаДерева.Характеристика = Неопределено;
					СтрокаДерева.Серия          = Неопределено;
					ПроверятьНоменклатуру   = Ложь;
					ПроверятьХарактеристику = Ложь;
					ПроверятьСерию          = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			Если ПроверятьСерию Тогда
				Если СтрокаДерева.Серия = Неопределено Тогда
					СтрокаДерева.Серия = Строка.Серия;
				ИначеЕсли СтрокаДерева.Серия <> Строка.Серия Тогда
					СтрокаДерева.Серия = Неопределено;
					ПроверятьСерию = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			Если Не ПроверятьНоменклатуру Или Не ПроверятьХарактеристику Тогда
				СтрокаДерева.ТипУпаковки = Перечисления.ТипыУпаковок.МультитоварнаяУпаковка;
			КонецЕсли;
			
			Если Не ПроверятьНоменклатуру И Не ПроверятьХарактеристику И Не ПроверятьСерию Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтрокаДанных <> Неопределено Тогда
			
			СтрокаДанных.Номенклатура   = СтрокаДерева.Номенклатура;
			СтрокаДанных.Характеристика = СтрокаДерева.Характеристика;
			СтрокаДанных.Серия          = СтрокаДерева.Серия;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет строка дерева упаковок данными таблицы кодов маркировки.
// 
// Параметры:
//  СтрокаДерева - СтрокаДереваЗначений - Строка Дерева упаковок.
//  ДанныеКодовМаркировки - (См. ШтрихкодированиеИС.ИнициализацияТаблицыДанныхКодовМаркировки).
Процедура ЗаполнитьСтрокуДереваПоДаннымТаблицыКодыМаркировок(СтрокаДерева, СтрокаДанных, ПараметрыЗаполнения)
	
	Для Каждого ИмяКолонки Из ПараметрыЗаполнения.Кэш.ЗаполняемыеКолонки Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаДанных[ИмяКолонки]) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДерева[ИмяКолонки] = СтрокаДанных[ИмяКолонки];
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(СтрокаДерева.Статус) Тогда
		СтрокаДерева.Статус = Перечисления.СтатусыКодовМаркировкиМОТП.Неопределен;
	КонецЕсли;

	Если ПустаяСтрока(СтрокаДерева.ПредставлениеСтатуса) Тогда
		СтрокаДерева.ПредставлениеСтатуса = Строка(СтрокаДерева.Статус);
	КонецЕсли;

КонецПроцедуры

// Выполняет расчет количественных показателей строки дерева, таких как: КоличествоПачек, КоличествоБлоков.
//
// Параметры:
//  СтрокаДерева - СтрокаДереваЗначений - Строка дерева упаковок.
Процедура РассчитатьКоличественныеПоказателиСтрокиДерева(СтрокаДерева)
	
	Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
		СтрокаДерева.КоличествоПачек = 1;
	ИначеЕсли СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
		СтрокаДерева.КоличествоБлоков = 1;
		// Количество пачек загружено из справочника. Актуально для детализации: Короба с блоками
		Если СтрокаДерева.КоличествоПачек = 0
			И СтрокаДерева.Строки.Количество() = 0 Тогда
			СтрокаДерева.КоличествоПачек = СтрокаДерева.КоличествоПотребительскихУпаковокПоДаннымИБ;
		КонецЕсли;
	ИначеЕсли СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
		Если СтрокаДерева.КоличествоПачек = 0
			И СтрокаДерева.Строки.Количество() = 0 Тогда
			// Количество блоков можно расчитать по данным GTIN
			СтрокаДерева.КоличествоПачек = СтрокаДерева.КоличествоПотребительскихУпаковокПоДаннымИБ;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаДерева.Родитель <> Неопределено Тогда
		
		СтрокаДерева.Родитель.КоличествоПачек = СтрокаДерева.Родитель.КоличествоПачек
			+ СтрокаДерева.КоличествоПачек;
		
		СтрокаДерева.Родитель.КоличествоБлоков = СтрокаДерева.Родитель.КоличествоБлоков
			+ СтрокаДерева.КоличествоБлоков;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет замену значений строки дерева со значениями Неопределено на пустые ссылки.
// 
// Параметры:
//  СтрокаДерева - СтрокаДереваЗначений - Описание
Процедура ЗаменитьЗначенияНеопределеноНаПустыеСсылкиВСтрокеДерева(СтрокаДерева) Экспорт
	
	ПустаяНоменклатура   = ИнтеграцияИС.ПустоеЗначениеОпределяемогоТипа("Номенклатура");
	ПустаяХарактеристика = ИнтеграцияИС.ПустоеЗначениеОпределяемогоТипа("ХарактеристикаНоменклатуры");
	ПустаяСерия          = ИнтеграцияИС.ПустоеЗначениеОпределяемогоТипа("СерияНоменклатуры");
	
	Если СтрокаДерева.Номенклатура = Неопределено Тогда
		СтрокаДерева.Номенклатура = ПустаяНоменклатура;
	КонецЕсли;
	
	Если СтрокаДерева.Характеристика = Неопределено Тогда
		СтрокаДерева.Характеристика = ПустаяХарактеристика;
	КонецЕсли;
	
	Если СтрокаДерева.Серия = Неопределено Тогда
		СтрокаДерева.Серия = ПустаяСерия;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// Выполняет обработку выбора номенклатуры.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма документа.
//  РезультатВыбора - Структура - результат выбора номенклатуры пользователем.
//  РезультатОбработкиШтрихкода - (См. ШтрихкодированиеИС.ИнициализироватьРезультатОбработкиШтрихкода).
//  КэшированныеЗначения - Структура - закэшированные данные формы.
// Возвращаемое значение:
//  Неопределено, Структура - (См. ШтрихкодированиеИС.ИнициализироватьРезультатОбработкиШтрихкода).
Функция ОбработатьВыборНоменклатуры(Форма, РезультатВыбора, РезультатОбработкиШтрихкода, КэшированныеЗначения)
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

Процедура ЗапросИРасчетМРЦПоСтрокамДерева(ЗапрашиваемыеСтроки, ВычисляемыеСтроки, ПараметрыСканирования) Экспорт
	
	СтрокиЗапроса    = Новый Массив();
	СтрокиВычисления = Новый Массив();
	КэшРезультат     = Новый Соответствие();
	
	Если Не ИнтеграцияИСМПКлиентСерверПовтИсп.УчитыватьМРЦ()
		И Не ПараметрыСканирования.ЭтоПроверкаКодовМаркировкиИСМП Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из ЗапрашиваемыеСтроки Цикл
		
		Если УчитыватьМРЦПоСтрокеКоллекции(СтрокаДерева, КэшРезультат) Тогда
			СтрокиЗапроса.Добавить(СтрокаДерева);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаДерева Из ВычисляемыеСтроки Цикл
		
		Если УчитыватьМРЦПоСтрокеКоллекции(СтрокаДерева, КэшРезультат) Тогда
			СтрокиВычисления.Добавить(СтрокаДерева);
		КонецЕсли;
		
	КонецЦикла;
	
	ТекущиеСтрокиЗапроса = СтрокиЗапроса;
	Пока ТекущиеСтрокиЗапроса.Количество() > 0
		Или СтрокиВычисления.Количество() > 0 Цикл
		
		ИнтерфейсМОТП.ЗапросМРЦПоСтрокамДерева(ТекущиеСтрокиЗапроса);
		РасчетМРЦПоСтрокамДерева(СтрокиВычисления);
		
		ТекущиеСтрокиЗапроса = Новый Массив();
		Для Каждого СтрокаРасчета Из СтрокиВычисления Цикл
			Если Не ЗначениеЗаполнено(СтрокаРасчета.МРЦ) Тогда
				ТекущиеСтрокиЗапроса.Добавить(СтрокаРасчета);
			КонецЕсли;
		КонецЦикла;
		
		СтрокиВычисления.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует вложенные штрихкоды путем получения базовых коллекций "ДеревоУпаковок" и "МаркированныеТовары" и дополнения
// их колонками специфичными для табачной продукции.
//
// Параметры:
//  ДеревоУпаковок - См. ИнициализироватьДеревоУпаковок
//  ИнициализироватьМаркированныеТовары - Булево - Признак инициализации таблицы МаркированныеТовары
//
// Возвращаемое значение:
//  (См. ШтрихкодированиеИС.ИнициализацияВложенныхШтрихкодов).
Функция ИнициализацияВложенныхШтрихкодов(ДеревоУпаковок = Неопределено, ИнициализироватьМаркированныеТовары = Истина)
	
	ВложенныеШтрихкоды = ШтрихкодированиеИС.ИнициализацияВложенныхШтрихкодов(
		ДеревоУпаковок, ИнициализироватьМаркированныеТовары);
	
	НормализоватьСвойстваКоллекцииВложенныхШтрихкодов(ВложенныеШтрихкоды.ДеревоУпаковок);
	
	Если ИнициализироватьМаркированныеТовары Тогда
		НормализоватьСвойстваКоллекцииВложенныхШтрихкодов(ВложенныеШтрихкоды.МаркированныеТовары);
	КонецЕсли;
	
	Возврат ВложенныеШтрихкоды;
	
КонецФункции

// Инициализирует структуру, описывающую результат получения вложенных штрихкодов по данным МОТП.
// 
// Параметры:
// Возвращаемое значение:
// 	Структура - Описание:
// * ТекстОшибки - Строка - Ошибка, возникшая в результате запроса данных из МОТП.
// * ЕстьОшибки - Булево - Истина, если возникла ошибка.
// * ВложенныеШтрихкоды - (См. ИнициализацияВложенныхШтрихкодов).
Функция ИнициализацияРезультатаПолученияВложенныхШтрихкодовПоДаннымМОТП()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВложенныеШтрихкоды",             Неопределено);
	Результат.Вставить("ЕстьОшибки",                     Ложь);
	Результат.Вставить("ТекстОшибки",                    "");
	Результат.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	Результат.Вставить("GTIN",                           Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Инициализирует дерево упаковок для табачной продукции.
//
// Возвращаемое значение:
//  ДеревоЗначений - Иерархия упаковок.
Функция ИнициализироватьДеревоУпаковок() Экспорт
	
	ДеревоУпаковок = ШтрихкодированиеИС.ИнициализироватьДеревоУпаковок();
	НормализоватьСвойстваКоллекцииВложенныхШтрихкодов(ДеревоУпаковок);
	
	Возврат ДеревоУпаковок;
	
КонецФункции

// Дополняет таблицу "Маркированные товары" табачными блоками, которые присутствуют в "Дереве упаковок".
//
// Параметры:
//  СтрокиДерева - КоллекцияСтрокДереваЗначений - Строки "Дерева упаковок".
//  МаркированныеТовары - ТаблицаЗначений - таблица с маркированными товарами.
//  УпаковкаВерхнегоУровня - СтрокаДереваЗначений - Самая верхняя строка в иерархии.
Процедура ДополнитьМаркированныеТоварыБлокамиПоСтрокамДерева(СтрокиДерева, МаркированныеТовары, УпаковкаВерхнегоУровня = Неопределено)

	Для Каждого СтрокаДерева Из СтрокиДерева Цикл

		Если УпаковкаВерхнегоУровня = Неопределено Тогда
			УпаковкаВерхнегоУровня = СтрокаДерева.ШтрихкодУпаковки;
		КонецЕсли;

		Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
			НоваяСтрока = МаркированныеТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева);
			НоваяСтрока.СтрокаДерева = СтрокаДерева;
			НоваяСтрока.УпаковкаВерхнегоУровня = УпаковкаВерхнегоУровня;
		КонецЕсли;

		ДополнитьМаркированныеТоварыБлокамиПоСтрокамДерева(СтрокаДерева.Строки, МаркированныеТовары, УпаковкаВерхнегоУровня);

	КонецЦикла;

КонецПроцедуры

// Дополняет данные по штрихкодам спецификой табачной продукции, полученной из МОТП.
//
// Параметры:
//  ДанныеПоШтрихкодам - (См. ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам).
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
Процедура ДополнитьДанныеПоШтрихкодамСпецификойСЗапросомСтатусовМОТП(ДанныеПоШтрихкодам, ПараметрыСканирования)
	
	СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок = СформироватьДеревоУпаковокПоДаннымСервиса(
		ДанныеПоШтрихкодам, ПараметрыСканирования);
	
	ПотребительскиеУпаковки = СтрокиТаблицыДанныхДляПолученияСпецифики(
		ДанныеПоШтрихкодам.ДанныеКодовМаркировки, СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок, ПараметрыСканирования);
	
	Если ПотребительскиеУпаковки.Количество() = 0
		И СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ПотребительскиеУпаковки.Количество() > 0 Тогда
		
		Результат = СпецификаДляДополненияДанныхПоШтрихкодам(
			ПотребительскиеУпаковки,
			ПараметрыСканирования);
		Если Результат.ЕстьОшибки Тогда
			
			ДанныеПоШтрихкодам.ЕстьОшибки                     = Истина;
			ДанныеПоШтрихкодам.ТекстОшибки                    = Результат.ТекстОшибки;
			ДанныеПоШтрихкодам.ТребуетсяОбновлениеКлючаСессии = Результат.ТребуетсяОбновлениеКлючаСессии;
			
			Возврат;
			
		Иначе
			СпецификаШтрихкодовПотребительскихУпаковок = Результат.СпецификаШтрихкодов;
		КонецЕсли;
		
	Иначе
		СпецификаШтрихкодовПотребительскихУпаковок = Новый Соответствие;
	КонецЕсли;
	
	ДополнитьТаблицуДанныеКодовМаркировкиСпецификой(
		СпецификаШтрихкодовПотребительскихУпаковок,
		СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок,
		ПараметрыСканирования);
	
	СтрокиДанныхДляЗаполненияПредставления = Новый Массив;
	МассивНеизвестныхEAN                   = Новый Массив;
	Для Каждого СтрокаДанных Из ПотребительскиеУпаковки Цикл
		Если СтрокаДанных.ТребуетсяСопоставление
			И Не ЗначениеЗаполнено(СтрокаДанных.ПредставлениеНоменклатуры) Тогда
			МассивНеизвестныхEAN.Добавить(СтрокаДанных.EAN);
			СтрокиДанныхДляЗаполненияПредставления.Добавить(СтрокаДанных);
		КонецЕсли;
	КонецЦикла;
	МассивНеизвестныхEAN = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивНеизвестныхEAN);
	
	Если СтрокиДанныхДляЗаполненияПредставления.Количество() > 0 Тогда
		ЗаполнитьПредставлениеНоменклатурыПоДаннымМОТП(
			ДанныеПоШтрихкодам, СтрокиДанныхДляЗаполненияПредставления, МассивНеизвестныхEAN);
	КонецЕсли;
	
	Если ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП
		И ПараметрыСканирования.ПроверятьПотребительскиеУпаковкиНаВхождениеВСеруюЗонуМОТП Тогда
		
		// Логистические упаковки проверяются отдельно
		РезультатПроверкиСеройЗоны = ПроверитьПотребительскиеУпаковкиНаВхождениеВСеруюЗону(ПотребительскиеУпаковки, ПараметрыСканирования);
		
		Если Не ПустаяСтрока(РезультатПроверкиСеройЗоны.ТекстОшибки) Тогда
			
			ДанныеПоШтрихкодам.ЕстьОшибки                     = Истина;
			ДанныеПоШтрихкодам.ТекстОшибки                    = РезультатПроверкиСеройЗоны.ТекстОшибки;
			ДанныеПоШтрихкодам.ТребуетсяОбновлениеКлючаСессии = РезультатПроверкиСеройЗоны.ТребуетсяОбновлениеКлючаСессии;
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет строки таблицы Данные кодов маркировки спецификой, полученной из МОТП.
// 
// Параметры:
//  СпецификаШтрихкодов - Соответствие - Ключ - строка таблицы Данные кодов маркировки, значение - специфика, полученная
//                                       из сервиса МОТП.
//  ДеревоПоДаннымСервиса - ДеревоЗначений - Дерево кодов маркировки по данным сервиса.
//  ПараметрыСканирования - См. ШтрихкодированиеИСКлиент.ПараметрыСканирования.
Процедура ДополнитьТаблицуДанныеКодовМаркировкиСпецификой(
	СпецификаШтрихкодовПотребительскихУпаковок,
	СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок, ПараметрыСканирования)
	
	ПредставленияСтатусов = ПредставленияСтатусов();
	
	НаличиеКолонокВДанных = Новый Соответствие;
	Для Каждого КлючЗначение Из СпецификаШтрихкодовПотребительскихУпаковок Цикл
		
		СтрокаТаблицыДанных = КлючЗначение.Ключ;
		СпецификаСтроки     = КлючЗначение.Значение;
		
		Если ЗначениеЗаполнено(СпецификаСтроки) Тогда
			
			ПоляДляЗаполнения = Новый Массив;
			Для Каждого КлючИЗначение Из СпецификаСтроки Цикл
				
				ИмяСвойства  = КлючИЗначение.Ключ;
				ЕстьСвойство = НаличиеКолонокВДанных.Получить(ИмяСвойства);
				Если ЕстьСвойство = Неопределено Тогда
					ЕстьСвойство = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицыДанных, ИмяСвойства);
					НаличиеКолонокВДанных.Вставить(ИмяСвойства, ЕстьСвойство);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(КлючИЗначение.Значение)
					И ЕстьСвойство Тогда
					ПоляДляЗаполнения.Добавить(КлючИЗначение.Ключ);
				КонецЕсли;
				
			КонецЦикла;
			
			Если ПоляДляЗаполнения.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыДанных, СпецификаСтроки, СтрСоединить(ПоляДляЗаполнения, ","));
			КонецЕсли;
			
			Если СтрокаТаблицыДанных.СтрокаДерева = Неопределено Тогда
				Если СтрокаТаблицыДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
					КоличествоПачек = 0;
					Если СпецификаСтроки <> Неопределено Тогда
						КоличествоПачек = СпецификаСтроки.ВложенныеУпаковки.Количество();
					КонецЕсли;
					СтрокаТаблицыДанных.КоличествоБлоков = 1;
					СтрокаТаблицыДанных.КоличествоПачек  = КоличествоПачек;
				ИначеЕсли СтрокаТаблицыДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
					СтрокаТаблицыДанных.КоличествоБлоков = 0;
					СтрокаТаблицыДанных.КоличествоПачек  = 1;
				Иначе
					СтрокаТаблицыДанных.КоличествоБлоков = 0;
					СтрокаТаблицыДанных.КоличествоПачек  = СтрокаТаблицыДанных.Коэффициент;
				КонецЕсли;
			Иначе
				СтрокаТаблицыДанных.КоличествоБлоков = СтрокаТаблицыДанных.СтрокаДерева.КоличествоБлоков;
				СтрокаТаблицыДанных.КоличествоПачек  = СтрокаТаблицыДанных.СтрокаДерева.КоличествоПачек;
			КонецЕсли;
			
			СтрокаТаблицыДанных.ПредставлениеСтатуса = ПредставленияСтатусов.Получить(СтрокаТаблицыДанных.Статус);
			
			ШтрихкодированиеИСМПСлужебный.ЗаполнитьСтрокуПоДаннымРазбораКодаМаркировки(СтрокаТаблицыДанных, ПараметрыСканирования);
			
			Если ШтрихкодированиеИСМПСлужебный.ТребуетсяЗагрузкаВложенныхКодовМаркировки(
				СпецификаСтроки, СтрокаТаблицыДанных, ПараметрыСканирования) Тогда
				СтрокаТаблицыДанных.Идентифицирован = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДополнительныеКолонки = Новый Структура;
	ПараметрыДерева = ИнтерфейсМОТП.ПараметрыПостроенияДерева(ПараметрыСканирования);
	ШтрихкодированиеМОТП.КоллекцияДополнительныхКолонокДереваУпаковокМОТП(ПараметрыДерева, ДополнительныеКолонки);
	Если ПараметрыСканирования.ЭтоПроверкаКодовМаркировкиИСМП Тогда
		ШтрихкодированиеМОТП.КоллекцияДополнительныхКолонокДереваУпаковокДляФормыПроверкиКодовМаркировки(ДополнительныеКолонки);
	КонецЕсли;
	ИменаКолонокДляКопированияСвойств = Новый Массив;
	Для Каждого КлючИЗначение Из ДополнительныеКолонки Цикл
		ИменаКолонокДляКопированияСвойств.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	Для Каждого КлючЗначение Из СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок Цикл
		
		СтрокаТаблицыДанных = КлючЗначение.Ключ;
		СпецификаСтроки     = КлючЗначение.Значение;
		
		Если ЗначениеЗаполнено(СпецификаСтроки) Тогда
			
			ПоляДляЗаполнения = Новый Массив;
			Для Каждого ИмяСвойства Из ИменаКолонокДляКопированияСвойств Цикл
				
				Если ЗначениеЗаполнено(СпецификаСтроки[ИмяСвойства]) Тогда
					СтрокаТаблицыДанных[ИмяСвойства] = СпецификаСтроки[ИмяСвойства];
				КонецЕсли;
				
			КонецЦикла;
			
			Если СтрокаТаблицыДанных.СодержитСерыеКоды
				И СтрокаТаблицыДанных.СтрокаДерева <> Неопределено Тогда
				
				СтрокаТаблицыДанных.СтрокаДерева.ВСеройЗоне        = СтрокаТаблицыДанных.ВСеройЗоне;
				СтрокаТаблицыДанных.СтрокаДерева.СодержитСерыеКоды = СтрокаТаблицыДанных.СодержитСерыеКоды;
				СтрокаТаблицыДанных.СтрокаДерева.КоличествоПачек   = СтрокаТаблицыДанных.КоличествоПачек;
				СтрокаТаблицыДанных.СтрокаДерева.КоличествоБлоков  = СтрокаТаблицыДанных.КоличествоБлоков;
				СтрокаТаблицыДанных.СтрокаДерева.Строки.Очистить();
				
			КонецЕсли;
			
			СтрокаТаблицыДанных.ПредставлениеСтатуса = ПредставленияСтатусов.Получить(СтрокаТаблицыДанных.Статус);
			
			ШтрихкодированиеИСМПСлужебный.ЗаполнитьСтрокуПоДаннымРазбораКодаМаркировки(СтрокаТаблицыДанных, ПараметрыСканирования);
			
			Если ШтрихкодированиеИСМПСлужебный.ТребуетсяЗагрузкаВложенныхКодовМаркировки(
				СпецификаСтроки, СтрокаТаблицыДанных, ПараметрыСканирования) Тогда
				СтрокаТаблицыДанных.Идентифицирован = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает все коды маркировки, находящиеся в данных по штрихкодам.
// 
// Параметры:
//  ДанныеПоШтрихкодам                                 - См. ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам
//  СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок - Соответствие
//  ПараметрыСканирования                              - См. ШтрихкодированиеИС.ПараметрыСканирования
// Возвращаемое значение:
//  Массив из Строка - Коды маркировки.
Функция СтрокиТаблицыДанныхДляПолученияСпецифики(ДанныеКодовМаркировки, СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок, ПараметрыСканирования)
	
	СтрокиТаблицыДанных = Новый Массив;
	
	Для Каждого СтрокаДанных Из ДанныеКодовМаркировки Цикл
		
		Если СтрокаДанных.ОбработанСОшибками Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВозможнаПродукцияМОТП(СтрокаДанных)
			И ЗначениеЗаполнено(СтрокаДанных.ШтрихкодУпаковки)
			И СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок[СтрокаДанных] = Неопределено Тогда
				СтрокиТаблицыДанных.Добавить(СтрокаДанных);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрокиТаблицыДанных;
	
КонецФункции

// Возвращает признак, что обрабатываемый код маркировки относится либо может относиться к МОТП
//
// Параметры:
//   СтрокаДанных - Произвольный - элемент коллекции "ШтрихкодированиеИС.ИнициализацияТаблицыДанныхКодовМаркировки"
//     либо совместимый по полям (строка дерева значений, структура).
// Возвращаемое значение:
//   Булево - в текущей строке продукция МОТП явно присутствует либо возможна
Функция ВозможнаПродукцияМОТП(СтрокаДанных)

	Если СтрокаДанных.ЭтоШтрихкодНоменклатуры Тогда
		Возврат Ложь;
	ИначеЕсли ИнтеграцияИСКлиентСервер.ЭтоПродукцияМОТП(СтрокаДанных.ВидПродукции) Тогда
		Возврат Истина;
	ИначеЕсли ЗначениеЗаполнено(СтрокаДанных.ВидПродукции) Тогда
		Возврат Ложь;
	ИначеЕсли СтрокаДанных.ПрисутствуетТабачнаяПродукция Тогда // Флаг заполняется если неизвестно АТП это или классический табак
		Возврат Истина;
	ИначеЕсли Не СтрокаДанных.ЭтоКодВводаОстатков Тогда
		Возврат Ложь;
	КонецЕсли;

	Для Каждого ВидПродукции Из СтрокаДанных.ВидыПродукцииКодаМаркировки Цикл
		Если ИнтеграцияИСКлиентСервер.ЭтоПродукцияМОТП(ВидПродукции) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

// Получает дерево упаковок из системы МОТП для контроля расхождений состава с данными ИБ.
//
// Параметры:
//  ДанныеПоШтрихкодам - См. ШтрихкодированиеИС.ИнициализацияДанныхПоШтрихкодам
//  ПараметрыСканирования - См. ШтрихкодированиеИСКлиент.ПараметрыСканирования
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение:
//   * Ключ     - См. ИнициализацияТаблицыДанныхКодовМаркировки
//   * Значение - СтрокаДереваЗначений
Функция СформироватьДеревоУпаковокПоДаннымСервиса(ДанныеПоШтрихкодам, ПараметрыСканирования)
	
	Если ПараметрыСканирования.Свойство("КонтролироватьРасхождениеСоставаУпаковокМеждуИБиИСМП")
		И Не ПараметрыСканирования.КонтролироватьРасхождениеСоставаУпаковокМеждуИБиИСМП Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	СтрокиТаблицыДляЗапроса = Новый Массив;
	Для Каждого СтрокаДанных Из ДанныеПоШтрихкодам.ДанныеКодовМаркировки Цикл
		
		Если СтрокаДанных.ОбработанСОшибками Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИнтеграцияИСКлиентСервер.ЭтоУпаковкаПоВиду(СтрокаДанных.ВидУпаковки)
			И ШтрихкодированиеИС.ПрисутствуетТабачнаяПродукция(СтрокаДанных.ВидыПродукцииКодаМаркировки)
			И ЗначениеЗаполнено(СтрокаДанных.ШтрихкодУпаковки)
			И СтрокаДанных.Входящий Тогда
			
			СтрокиТаблицыДляЗапроса.Добавить(СтрокаДанных);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтрокиТаблицыДляЗапроса.Количество() = 0 Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	РезультатПолученияДанных = ДеревоУпаковокПоДаннымМОТП(СтрокиТаблицыДляЗапроса, ПараметрыСканирования); 
	Если ЗначениеЗаполнено(РезультатПолученияДанных.ТекстОшибки) Тогда
		
		ДанныеПоШтрихкодам.ЕстьОшибки                     = Истина;
		ДанныеПоШтрихкодам.ТекстОшибки                    = РезультатПолученияДанных.ТекстОшибки;
		ДанныеПоШтрихкодам.ТребуетсяОбновлениеКлючаСессии = РезультатПолученияДанных.ТребуетсяОбновлениеКлючаСессии;
		
	Иначе
		
		Если ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП
			И ПараметрыСканирования.ПроверятьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодовМОТП Тогда
			
			РезультатПроверкиСеройЗоны = ПроверитьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодов(
				РезультатПолученияДанных, ДанныеПоШтрихкодам.ДанныеКодовМаркировки, ПараметрыСканирования);
			
			Если Не ПустаяСтрока(РезультатПроверкиСеройЗоны.ТекстОшибки) Тогда
				
				ДанныеПоШтрихкодам.ЕстьОшибки                     = Истина;
				ДанныеПоШтрихкодам.ТекстОшибки                    = РезультатПроверкиСеройЗоны.ТекстОшибки;
				ДанныеПоШтрихкодам.ТребуетсяОбновлениеКлючаСессии = РезультатПроверкиСеройЗоны.ТребуетсяОбновлениеКлючаСессии;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеПоШтрихкодам.ДеревоПоДаннымСервиса = РезультатПолученияДанных.ДеревоУпаковок;
		
	КонецЕсли;
	
	Возврат РезультатПолученияДанных.СоответствиеСтрокДерева;
	
КонецФункции

// Заполняет связанные строки таблицы Маркированные товары данными строк дерева упаковок.
// 
// Параметры:
//  МаркированныеТовары - ТаблицаЗначений - Таблица маркируемой продукции.
Процедура ПривестиДанныеМаркированныхТоваровВСоответствиеДеревуУпаковок(МаркированныеТовары)
	
	Для Каждого СтрокаТовары Из МаркированныеТовары Цикл
		Если СтрокаТовары.СтрокаДерева <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТовары, СтрокаТовары.СтрокаДерева);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область УчетМРЦ

Процедура ОбработкаДанныхПоШтрихкодамУчетМРЦ(ДанныеПоШтрихкодам, ПараметрыСканирования)
	
	Если ПараметрыСканирования.ЭтоПроверкаКодовМаркировкиИСМП Тогда
		ВключенУчетМРЦ = Истина;
	Иначе
		ВключенУчетМРЦ = ИнтеграцияИСМПКлиентСерверПовтИсп.УчитыватьМРЦ();
	КонецЕсли;
	
	Кэш = Новый Соответствие;
	
	ПривестиСтрокиКоллекцииПоУчетуМРЦ(
		ДанныеПоШтрихкодам.ДанныеКодовМаркировки,
		Кэш,
		ВключенУчетМРЦ);
	
	Если ДанныеПоШтрихкодам.ВложенныеШтрихкоды <> Неопределено Тогда
		ПривестиСтрокиКоллекцииПоУчетуМРЦ(
			ДанныеПоШтрихкодам.ВложенныеШтрихкоды.ДеревоУпаковок.Строки,
			Кэш,
			ВключенУчетМРЦ);
	КонецЕсли;
	
КонецПроцедуры

Функция УчитыватьМРЦПоСтрокеКоллекции(СтрокаКоллекции, Кэш, УчетМРЦВключен = Истина)
	
	ВозвращаемоеЗначение = Ложь;
	
	Если УчетМРЦВключен И СтрокаКоллекции.ВидПродукции = Перечисления.ВидыПродукцииИС.Табак Тогда
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаКоллекции, "Номенклатура") Тогда
			
			ТребуетсяЗапрос = Кэш.Получить(СтрокаКоллекции.Номенклатура);
			Если ТребуетсяЗапрос = Неопределено Тогда
				
				ТребуетсяЗапрос = Истина;
				ШтрихкодированиеМОТППереопределяемый.ПриОпределенииНеобходимостиЗапросаМРЦ(
					СтрокаКоллекции.Номенклатура,
					ТребуетсяЗапрос);
				Кэш.Вставить(СтрокаКоллекции.Номенклатура, ТребуетсяЗапрос);
				
			КонецЕсли;
			
		Иначе
			
			ТребуетсяЗапрос = УчетМРЦВключен;
			
		КонецЕсли;
			
		Если ТребуетсяЗапрос Тогда
			ВозвращаемоеЗначение = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#КонецОбласти
