
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Ссылка = НастройкиПродажДляПользователейВызовСервера.НастройкаОграниченийПоОбъекту(ПараметрКоманды);
	Если Ссылка = Неопределено Тогда
		ЗначенияЗаполнения = Новый Структура("Владелец", ПараметрКоманды);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", Ссылка);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.НастройкиПродажДляПользователей.Форма.ФормаЭлемента",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
