
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ИмяМенеджераПечати = "Документ.СообщениеОбменСБанками";
	ПараметрыПечати = Новый Структура;
	
	ИмяМакета = "ЭД";
	ПараметрыПечати.Вставить("Идентификатор", "ЭД");
	ПараметрыПечати.Вставить("ЗаголовокФормы", НСтр("ru = 'Печать электронного документа'"));
	ПараметрыПечати.Вставить("Представление", НСтр("ru = 'Печать электронного документа'"));
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		ИмяМенеджераПечати, ИмяМакета, ПараметрКоманды, ПараметрыВыполненияКоманды.Источник, ПараметрыПечати);
	
КонецПроцедуры

#КонецОбласти