////////////////////////////////////////////////////////////////////////////////
// ОбменСКонтрагентамиКлиентПовтИсп: механизм обмена электронными документами.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает признак использования сертификатов пользователя в облачном сервисе.
//
// Возвращаемое значение:
//  Булево - флаг использования сертификатов пользователя в облачном сервисе.
//
Функция ИспользованиеСертификатовОблачногоСервисаВозможно() Экспорт
	
	Возврат ОбменСКонтрагентамиСлужебныйВызовСервера.ИспользованиеСертификатовОблачногоСервисаВозможно();
	
КонецФункции

// Проверяет использование оповещений о новых документах в сервисе ЭДО
// 
// Возвращаемое значение:
//  Булево - если истина, то оповещения используются.
//
Функция ИспользоватьОповещенияОтСервисаЭДО() Экспорт
	
	Возврат ОбменСКонтрагентамиСлужебныйВызовСервера.ИспользоватьОповещенияОтСервисаЭДО();
	
КонецФункции

#Область СопоставлениеНоменклатуры

Функция ПодсистемаСопоставленияНоменклатурыСуществует() Экспорт
	
	Возврат ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЭлектронноеВзаимодействие.СопоставлениеНоменклатурыКонтрагентов");
	
КонецФункции

Функция МодульСопоставлениеНоменклатурыКонтрагентовКлиент() Экспорт
	
	Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("СопоставлениеНоменклатурыКонтрагентовКлиент");
	
КонецФункции

Функция МодульСопоставлениеНоменклатурыКонтрагентовСлужебныйКлиент() Экспорт
	
	Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("СопоставлениеНоменклатурыКонтрагентовСлужебныйКлиент");
	
КонецФункции

#КонецОбласти

#КонецОбласти