#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает таблицу для конвертации ОКВЭД в ОКВЭД2.
//
// Возвращаемое значение:
//	ТаблицаЗначений - Содержит колонки:
//		* КодОКВЭД - Строка - Код ОКВЭД.
//		* КодОКВЭД2 - Строка - Код ОКВЭД2.
//
Функция ТаблицаКонвертацииОКВЭД_ОКВЭД2() Экспорт
	
	ТекстКонвертации = Справочники.КлассификаторОКВЭД2.ПолучитьМакет("КонвертацияОКВЭД_ОКВЭД2").ПолучитьТекст();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстКонвертации);
	
	Если Не ЧтениеXML.Прочитать() Тогда
		ВызватьИсключение НСтр("ru = 'Пустой XML'");
	ИначеЕсли ЧтениеXML.Имя <> "КонвертацияОКВЭД_ОКВЭД2" Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка в структуре XML'");
	КонецЕсли;
	
	ТаблицаКонвертацииОКВЭД_ОКВЭД2 = Новый ТаблицаЗначений;
	ТаблицаКонвертацииОКВЭД_ОКВЭД2.Колонки.Добавить("КодОКВЭД",   Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(8)));
	ТаблицаКонвертацииОКВЭД_ОКВЭД2.Колонки.Добавить("КодОКВЭД2",  Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(8)));
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		ИмяУзла = ЧтениеXML.Имя;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Если ИмяУзла = "КонвертацияОКВЭД_ОКВЭД2" Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Если ИмяУзла = "Элемент" Тогда
				
				ТекущаяСтрока = ТаблицаКонвертацииОКВЭД_ОКВЭД2.Добавить();
				ТекущаяСтрока.КодОКВЭД   = ЧтениеXML.ПолучитьАтрибут("КодОКВЭД");
				ТекущаяСтрока.КодОКВЭД2  = ЧтениеXML.ПолучитьАтрибут("КодОКВЭД2");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
	Возврат ТаблицаКонвертацииОКВЭД_ОКВЭД2;
	
КонецФункции

// Функция ищет по коду элементы в справочнике Классификатор ОКВЭД2.
//  Если их нет, то создает элементы справочника в соответствии с классификатором.
//
// Параметры:
//  Код - Строка(10) - Строка с кодом ОКВЭД2,
//  РежимОбновления - Булево, Истина - признак записи объекта через метод ОбновлениеИнформационнойБазы.ЗаписатьОбъект().
// 
// Возвращаемое значение:
//  Ссылка - ссылка на элемент классификатора или Неопределено, если такого кода нет в ОКВЭД2.
//
Функция НайтиСоздатьЭлементКлассификатораОКВЭД2(Код, РежимОбновления = Ложь) Экспорт
	
	СуществующийЭлемент = Справочники.КлассификаторОКВЭД2.НайтиПоКоду(Код);
	Если Не ЗначениеЗаполнено(СуществующийЭлемент) Тогда
		
		ТаблицаКлассификатора = Справочники.Организации.КлассификаторОКВЭД2();
		ТаблицаКлассификатора.Индексы.Добавить("Код");
		
		СтруктураПоиска = Новый Структура("Код",Код);
		НайденныеСтроки = ТаблицаКлассификатора.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 1 Тогда
			СвойстваЭлемента = НайденныеСтроки[0];
			
			СправочникОбъект = Справочники.КлассификаторОКВЭД2.СоздатьЭлемент();
			
			СправочникОбъект.Наименование            = СвойстваЭлемента.Наименование;
			СправочникОбъект.НаименованиеПолное      = СвойстваЭлемента.Наименование;
			СправочникОбъект.Код                     = СвойстваЭлемента.Код;
			
			Если РежимОбновления Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
			Иначе
				СправочникОбъект.Записать();
			КонецЕсли;
			
			Возврат СправочникОбъект.Ссылка;
			
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат СуществующийЭлемент;
	КонецЕсли;
		
КонецФункции

#КонецОбласти

#КонецЕсли