
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	КлючеваяОперация = "Обработка.ЖурналДокументовАвансовыеОтчеты.Команда.АвансовыеОтчетыКОформлению";
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(, КлючеваяОперация);
	
	ПараметрыФормы = Новый Структура("", );
	ОткрытьФорму("Обработка.ЖурналДокументовАвансовыеОтчеты.Форма.АвансовыеОтчетыКОформлению",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
КонецПроцедуры

#КонецОбласти