
#Область ПрограммныйИнтерфейс

Процедура СохранитьДоступностьЭлементовПоУмолчанию(Форма) Экспорт
	
	ЗаполнитьПараметрыЗапретаРедактированияРеквизитовEDI(Форма.ПараметрыЗапретаРедактированияРеквизитовEDI, 
	                                                     Форма.ТипДокументаEDI);
	
	ВсеБлокируемыеЭлементы = ВсеБлокируемыеЭлементы(Форма.ПараметрыЗапретаРедактированияРеквизитовEDI);
	
	Для Каждого ИмяЭлементаФормы Из ВсеБлокируемыеЭлементы Цикл
		
		ЭлементФормы = Форма.Элементы.Найти(ИмяЭлементаФормы);
		Если ЭлементФормы <> Неопределено Тогда
			Если ТипЗнч(ЭлементФормы) = Тип("ПолеФормы")
				И ЭлементФормы.Вид <> ВидПоляФормы.ПолеНадписи Тогда
				
				ДобавитьСтрокуВТаблицуДоступностиЭлементов(Форма.ДоступностьЭлементовБлокируемыхEDI, ИмяЭлементаФормы, Не ЭлементФормы.ТолькоПросмотр);
				
			ИначеЕсли ТипЗнч(ЭлементФормы) = Тип("ТаблицаФормы") Тогда
				
				ДобавитьСтрокуВТаблицуДоступностиЭлементов(Форма.ДоступностьЭлементовБлокируемыхEDI, 
				                                           ИмяЭлементаФормы,
				                                           ЭлементФормы.ИзменятьСоставСтрок) ;
				
			Иначе
				
				ДобавитьСтрокуВТаблицуДоступностиЭлементов(Форма.ДоступностьЭлементовБлокируемыхEDI, ИмяЭлементаФормы, ЭлементФормы.Доступность);
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс


// Заполняет таблицу реквизитов сервиса для документа "Заказ поставщику"
// 
// Параметры:
// 	ТаблицаПараметров - ТаблицаЗначений - таблица со следующей структурой:
// 	* ИмяРеквизита        - Строка         - имя реквизита сервиса.
// 	* БлокируемыеЭлементы - СписокЗначений - список имен элементов формы, связанных с реквизитом сервиса.
Процедура ЗаполнитьТаблицуПараметровЗаказПоставщику(ТаблицаПараметров) Экспорт
	
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Покупатель");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Поставщик");
	
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ПоставщикБанковскийСчет");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ВариантУказанияНоменклатурыВЗаказе");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Валюта");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ЦенаВключаетНДС");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "СуммаДокумента");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "СпособДоставки");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "АдресДоставки");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "НалогообложениеНДС");
	
	// Табличная часть "Товары"
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.ПокупательНоменклатура");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.ПокупательУпаковка");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.ПокупательКоличество");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.ПокупательКоличествоУпаковок");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.ПоставщикНоменклатура");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.ПоставщикУпаковка");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.ПоставщикКоличество");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.ПоставщикКоличествоУпаковок");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.Цена");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.Сумма");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.СуммаСкидки");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.СтавкаНДС");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.СуммаНДС");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.СуммаСНДС");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.СрокПоставки");
	
	// Табличная часть "Этапы оплаты"
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ЭтапыГрафикаОплаты");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ЭтапыГрафикаОплаты.ВариантОплаты");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ЭтапыГрафикаОплаты.ФормаОплаты");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ЭтапыГрафикаОплаты.ДатаПлатежа");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ЭтапыГрафикаОплаты.ПроцентПлатежа");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ЭтапыГрафикаОплаты.СуммаПлатежа");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ЭтапыГрафикаОплаты.Сдвиг");
	
КонецПроцедуры

// Заполняет таблицу реквизитов сервиса для документа "Заказ клиента"
// 
// Параметры:
// 	ТаблицаПараметров - ТаблицаЗначений - таблица со следующей структурой:
// 	* ИмяРеквизита        - Строка         - имя реквизита сервиса.
// 	* БлокируемыеЭлементы - СписокЗначений - список имен элементов формы, связанных с реквизитом сервиса.
Процедура ЗаполнитьТаблицуПараметровЗаказКлиента(ТаблицаПараметров) Экспорт
	
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Покупатель");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Поставщик");
	
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ПоставщикБанковскийСчет");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ВариантУказанияНоменклатурыВЗаказе");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Валюта");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ЦенаВключаетНДС");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "СуммаДокумента");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "СпособДоставки");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "АдресДоставки");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "НалогообложениеНДС");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ОтгружатьЗаказЦеликом");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ПлановаяДатаПоставки");
	
	// Табличная часть "Товары"
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.ПокупательНоменклатура");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.ПокупательУпаковка");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.ПокупательКоличество");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.ПокупательКоличествоУпаковок");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.ПоставщикНоменклатура");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.ПоставщикУпаковка");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.ПоставщикКоличество");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.ПоставщикКоличествоУпаковок");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.Цена");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.Сумма");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.СуммаСкидки");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.СтавкаНДС");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.СуммаНДС");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.СуммаСНДС");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "Товары.СрокПоставки");
	
	// Табличная часть "Этапы оплаты"
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ЭтапыГрафикаОплаты");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ЭтапыГрафикаОплаты.ВариантОплаты");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ЭтапыГрафикаОплаты.ФормаОплаты");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ЭтапыГрафикаОплаты.ДатаПлатежа");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ЭтапыГрафикаОплаты.ПроцентПлатежа");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ЭтапыГрафикаОплаты.СуммаПлатежа");
	ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, "ЭтапыГрафикаОплаты.Сдвиг");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьТаблицуПараметровЗапретаРедактированияБлокируемымиРеквизитами(ТаблицаПараметров, ТипДокумента)
	
	РедактированиеРеквизитовEDIИнтеграция.ЗаполнитьТаблицуПараметровЗапретаРедактированияБлокируемымиРеквизитами(ТаблицаПараметров, ТипДокумента);
	
КонецПроцедуры

Процедура ДобавитьСтрокуВТаблицуПараметров(ТаблицаПараметров, ИмяРеквизита) 
	
	НоваяСтрока = ТаблицаПараметров.Добавить();
	НоваяСтрока.ИмяРеквизита = ИмяРеквизита;
	
КонецПроцедуры

Процедура ДобавитьСтрокуВТаблицуДоступностиЭлементов(ТаблицаДоступность, ИмяРеквизита, Доступность)
	
	НоваяСтрока = ТаблицаДоступность.Добавить();
	НоваяСтрока.ИмяЭлемента = ИмяРеквизита;
	НоваяСтрока.Доступен    = Доступность;
	
КонецПроцедуры

Функция ВсеБлокируемыеЭлементы(ТаблицаПараметров)
	
	ВсеБлокируемыеЭлементы = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ТаблицаПараметров Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеБлокируемыеЭлементы, СтрокаТаблицы.БлокируемыеЭлементы, Истина);
		
	КонецЦикла;
	
	Возврат ВсеБлокируемыеЭлементы;
	
КонецФункции

Процедура ЗаполнитьПараметрыЗапретаРедактированияРеквизитовEDI(ТаблицаПараметров, ТипДокумента)
	
	ТаблицаПараметров.Очистить();
	
	ЗаполнитьТаблицуПараметровЗапретаРедактированияБлокируемымиРеквизитами(ТаблицаПараметров, ТипДокумента);
	
	РедактированиеРеквизитовEDIИнтеграция.ЗаполнитьПараметрыЗапретаРедактированияРеквизитовEDI(ТаблицаПараметров, ТипДокумента);
	
КонецПроцедуры

#КонецОбласти 