
#Область СлужебныйПрограммныйИнтерфейс

// Определяет соответствие проверяемому типу документа, результат возвращает через второй параметр.
//
// Параметры:
//  Контекст        - ФормаКлиентскогоПриложения, ДокументСсылка - Контекст для определения типа документа
//  ЭтоПриобретение - Булево - исходящий признак соответствия документа типу «Приобретение товаров и услуг».
Процедура ЭтоДокументПриобретения(Контекст, ЭтоПриобретение) Экспорт
	
	//++ НЕ ГОСИС
	Если ИнтеграцияИСУТКлиентСервер.ЭтоДокументПоНаименованию(Контекст, "ПриобретениеТоваровУслуг") Тогда
		ЭтоПриобретение = Истина;
	ИначеЕсли ИнтеграцияИСУТКлиентСервер.ЭтоДокументПоНаименованию(Контекст, "ВозвратТоваровОтКлиента")
		И Не ИнтеграцияИСУТКлиентСервер.ЭтоВозвратТовараОтРозничногоКлиента(Контекст) Тогда
		ЭтоПриобретение = Истина;
	КонецЕсли;
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Определяет соответствие проверяемому типу документа, результат возвращает через второй параметр.
//
// Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка - Контекст для определения типа документа
//  ЭтоЧек   - Булево - исходящий признак соответствия документа типу «Чек ККМ».
Процедура ЭтоЧекККМ(Контекст, ЭтоЧек) Экспорт
	
	//++ НЕ ГОСИС
	ЭтоЧек = ИнтеграцияИСУТКлиентСервер.ЭтоДокументПоНаименованию(Контекст, "ЧекККМ");
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Определяет соответствие проверяемому типу документа, результат возвращает через второй параметр.
//
// Параметры:
//  Контекст      - ФормаКлиентскогоПриложения, ДокументСсылка - Контекст для определения типа документа
//  ЭтоЧекВозврат - Булево - исходящий признак соответствия документа типу «Чек ККМ возврат».
Процедура ЭтоЧекККМВозврат(Контекст, ЭтоЧекВозврат) Экспорт
	
	//++ НЕ ГОСИС
	ЭтоЧекВозврат = ИнтеграцияИСУТКлиентСервер.ЭтоДокументПоНаименованию(Контекст, "ЧекККМВозврат");
	//-- НЕ ГОСИС
	
КонецПроцедуры

#Область СерииНоменклатуры

// Возвращает через параметр коды статусов указания серий, соответствующих не заполненным сериям.
//
// Параметры:
//  СтатусыСерияНеУказана - Массив - Исходящий, значения статусов, соответствующих не заполненным сериям.
Процедура СтатусыСерийСерияНеУказана(СтатусыСерияНеУказана) Экспорт
	
	//++ НЕ ГОСИС
	СтатусыСерияНеУказана = НоменклатураКлиентСервер.СтатусыСерийСерияНеУказана();
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Возвращает через параметр коды статусов указания серий, соответствующих сериям, которые можно заполнить.
//
// Параметры:
//  СтатусыСерияНеУказана - Массив - Исходящий, значения статусов, соответствующих сериям, которые можно заполнить.
Процедура СтатусыСерийСериюМожноУказать(СтатусыСерийСериюМожноУказать) Экспорт
	
	//++ НЕ ГОСИС
	СтатусыСерийСериюМожноУказать = НоменклатураКлиентСервер.СтатусыСерийСериюМожноУказать();
	//-- НЕ ГОСИС
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти