
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область ОбработкаПереходаСРегистраПартииПрочихРасходовНаРегистрПартииНДСКРаспределению

// Процедура конвертирует записи регистра ПартииПрочихРасходов, относящиеся к распределению НДС, в отдельный 
// регистр ПартииНДСКРаспределению.
// 
// Параметры:
// 	Регистратор - ДокументСсылка.ПриобретениеТоваровУслуг - документ-регистратор
// 	Набор - РегистрНакопленияНаборЗаписей.ПартииПрочихРасходов - набор записей регистра для обработки
// 	ВыборкаЗаписей - ВыборкаИзРезультатаЗапроса - записи набора с рассчитанными дополнительными полями
// 
// Возвращаемое значение:
// 	РегистрНакопленияНаборЗаписей.ПартииНДСКРаспределению - набор записей нового регистра
//
Функция ПеренестиДанныеРегистраПартииПрочихРасходовВРегистрПартииНДСКРаспределению(Регистратор, Набор, ВыборкаЗаписей) Экспорт
	
	НаборПартийНДС = РегистрыНакопления.ПартииНДСКРаспределению.СоздатьНаборЗаписей();
	НаборПартийНДС.ОбменДанными.Загрузка = Истина;
	НаборПартийНДС.Отбор.Регистратор.Установить(Регистратор);
	НаборПартийНДС.Прочитать();
		
	ЗаписиКУдалению = Новый Массив();
	
	Пока ВыборкаЗаписей.Следующий() Цикл
		
		Если ВыборкаЗаписей.ПереноситьЗапись Тогда
			ЗаписьНабора = Набор[ВыборкаЗаписей.НомерСтроки - 1];
			ЗаписиКУдалению.Добавить(ЗаписьНабора);
		Иначе
			Продолжить;
		КонецЕсли;
		
		ЗаписьНДС = НаборПартийНДС.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьНДС, ВыборкаЗаписей);
			
	КонецЦикла;
	
	Для Каждого ЗаписьНабора Из ЗаписиКУдалению Цикл
		Набор.Удалить(ЗаписьНабора);
	КонецЦикла;
	
	Возврат НаборПартийНДС;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
