
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Документ) <> Тип("СправочникСсылка.ЕГАИСПрисоединенныеФайлы") Тогда
		ОписаниеОшибки = ИнтеграцияЕГАИСВызовСервера.ТекстОшибкиИзПротокола(Параметры.Документ);
	Иначе
		ОписаниеОшибки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Описание");
	КонецЕсли;
	
	СобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
