#Область СлужебныйПрограммныйИнтерфейс

// Получает содержимое текущего лога запросов и помещает во временной хранилище.
// 
// Параметры:
// 	УникальныйИдентификаторФормы - УникальныйИдентификатор - Уникальный идентификатор формы.
// Возвращаемое значение:
// 	Строка - Адрес содержания лога во временном хранилище.
Функция АдресСодержанияЛоговЗапросов(УникальныйИдентификаторФормы) Экспорт
	
	СодержаниеЛогаЗапросов = ЛогированиеЗапросовИСМП.СодержаниеЛогаЗапросов();
	
	Возврат ПоместитьВоВременноеХранилище(СодержаниеЛогаЗапросов, УникальныйИдентификаторФормы);
	
КонецФункции

// см. ЛогированиеЗапросовИСМП.ВключитьЛогированиеЗапросов
Процедура ВключитьЛогированиеЗапросов(ЗаписыватьСекунд = 300, НовыйЛог = Ложь) Экспорт
	
	ЛогированиеЗапросовИСМП.ВключитьЛогированиеЗапросов(ЗаписыватьСекунд, НовыйЛог);
	
КонецПроцедуры

#КонецОбласти